apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
/****************************************************************************
 * arch/renesas/src/rx65n/rx65n_usbhost.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <unistd.h>
#include <semaphore.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/signal.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/ohci.h>
#include <nuttx/usb/usbhost.h>
#include <nuttx/usb/usbhost_devaddr.h>
#include <nuttx/usb/hid.h>

#include <nuttx/kmalloc.h>

#include <nuttx/irq.h>

#include <arch/board/board.h>

#include "renesas_internal.h"
#include "chip.h"
#include "rx65n_usbhost.h"

#include "arch/rx65n/iodefine.h"
#include "rx65n_cmtw.h"

#define INTSTS0_BIT_VALUES_TO_ACK       (0xd870u)
#define INTSTS1_BIT_VALUES_TO_ACK       (0xd870u)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* All I/O buffers must lie in AHB SRAM because of the OHCI DMA.
 * It might be okay if no I/O buffers are used *IF* the application
 * can guarantee that all end-user I/O buffers reside in AHB SRAM.
 */

#if defined(CONFIG_USBHOST) && defined(CONFIG_USBDEV)
#  error "Both USB Host & Device cannot be configured"
#endif

#ifndef CONFIG_RX65N_USBHOST_NPREALLOC
#  define CONFIG_RX65N_USBHOST_NPREALLOC 8
#endif

#ifndef CONFIG_DEBUG_USB_INFO
#  undef CONFIG_RX65N_USBHOST_REGDEBUG
#endif

/* USB Host Memory **********************************************************/

/* Periodic intervals 2, 4, 8, 16,and 32 supported */

#define MIN_PERINTERVAL 2
#define MAX_PERINTERVAL 32

/* Descriptors **************************************************************/

/* TD delay interrupt value */

#define TD_DELAY(n) (uint32_t)((n) << GTD_STATUS_DI_SHIFT)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure retains the state of the USB host controller */

struct rx65n_usbhost_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbhost_s
   * to struct rx65n_usbhost_s.
   */

  struct usbhost_driver_s drvr;

  /* This is the hub port description understood by class drivers */

  struct usbhost_roothubport_s rhport;

  /* Driver status */

  volatile bool    change;      /* Connection change */
  volatile bool    connected;   /* Connected to device */

  /* Thread is waiting for a port status change */

  volatile bool    pscwait;     /* Thread is waiting for a port status change */

#ifndef CONFIG_USBHOST_INT_DISABLE

  /* Minimum periodic IN EP polling interval: 2, 4, 6, 16, or 32 */

  uint8_t          ininterval;

  /* Minimum periodic IN EP polling interval: 2, 4, 6, 16, or 32 */

  uint8_t          outinterval;

#endif

  mutex_t          lock;         /* Support mutually exclusive access */

  /* Semaphore to wait Write-back Done Head event */

  sem_t            pscsem;
  struct work_s    rx65n_interrupt_bhalf; /* Supports interrupt bottom half */

#ifdef CONFIG_USBHOST_HUB

  /* Used to pass external hub port events */

  volatile struct usbhost_hubport_s *hport;
#endif

  struct usbhost_devaddr_s devgen;  /* Address generation data */
};

/* This structure describes one asynchronous transfer */

struct rx65n_usbhost_xfrinfo_s
{
  volatile bool wdhwait;      /* Thread is waiting for WDH interrupt */

  /* TD control status bits from last Write-back Done Head event */

  volatile uint8_t tdstatus;
  uint8_t *buffer;            /* Transfer buffer start */
  uint16_t buflen;            /* Buffer length */
  uint16_t xfrd;              /* Number of bytes transferred */
  volatile uint8_t tdxfercond;

  /* New variable. added
   * TD transfer condition : used for deciding
   * what to do in the interrupt/bottom
   * half context
   */

#ifdef CONFIG_USBHOST_ASYNCH
#if RX65N_USBHOST_IOBUFFERS > 0

  /* Remember the allocated DMA buffer address so that it can be freed when
   * the transfer completes.
   */

  uint8_t *alloc;             /* Allocated buffer */
#endif

  /* Retain the callback information for the asynchronous transfer
   * completion.
   */

  usbhost_asynch_t callback;  /* Transfer complete callback */
  void *arg;                  /* Argument that accompanies the callback */
#endif
};

/* The OCHI expects the size of an endpoint descriptor to be 16 bytes.
 * However, the size allocated for an endpoint descriptor is 32 bytes.
 * This extra 16-bytes is used by the OHCI host driver in
 * order to maintain additional endpoint-specific data.
 */

