apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
struct rx65n_usbhost_ed_s
{
  /* Hardware specific fields */

  struct ohci_ed_s hw;        /* 0-15 */

  /* Software specific fields */

  /* 16: Transfer type.  See SB_EP_ATTR_XFER_* in usb.h */

  uint8_t          xfrtype;

  /* 17: Periodic EP polling interval: 2, 4, 6, 16, or 32 */

  uint8_t          interval;

  /* 18: Semaphore used to wait for Writeback Done Head event */

  sem_t            wdhsem;

  /* Pointer to struct that manages asynchronous transfers on this pipe */

  /* 16: pipe number associated with with this Endpoint */

  uint8_t          pipenum;

  struct rx65n_usbhost_xfrinfo_s *xfrinfo;
};

struct rx65n_usbhost_gtd_s
{
  /* Hardware specific fields */

  struct ohci_gtd_s hw;

  /* Software specific fields */

  struct rx65n_usbhost_ed_s *ed;      /* Pointer to parent ED */
  uint8_t           pad[12];
};

/* The following is used to manage lists of free EDs, TDs, and TD buffers */

struct rx65n_usbhost_list_s
{
  struct rx65n_usbhost_list_s *flink;

  /* Link to next buffer in the list */

  /* Variable length buffer data follows */
};

struct rx65n_usbhost_ed_s  aligned_data(32);
struct rx65n_usbhost_gtd_s  aligned_data(32);

/* This must be aligned to a 256-byte boundary */

static struct ohci_hcca_s g_hcca        aligned_data(256);
static struct ohci_hcca_s *HCCA;

static struct rx65n_usbhost_gtd_s       *TDTAIL;

/* static struct rx65n_usbhost_ed_s      g_rx65n_ep0ed; */

static struct rx65n_usbhost_ed_s        *EDCTRL;

static struct rx65n_usbhost_gtd_s
        g_rx65n_tdlist[CONFIG_RX65N_USBHOST_NTDS];
static struct rx65n_usbhost_ed_s
        g_rx65n_edlist[CONFIG_RX65N_USBHOST_NEDS + 1];
static uint8_t nrdy_retries[CONFIG_RX65N_USBHOST_NEDS + 1];
#define RX65N_TD_BUF_SIZE (CONFIG_RX65N_USBHOST_TDBUFFERS * \
                      CONFIG_RX65N_USBHOST_TDBUFSIZE)
static uint8_t g_tdbuffer [RX65N_TD_BUF_SIZE];

static uint8_t g_kbdport;
static uint16_t g_usbidx;
static uint8_t g_hubkbd;
static uint8_t g_kbdpipe;
static uint8_t g_attached;
static uint8_t g_detached;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#define rx65n_usbhost_getreg(addr)     getreg16((volatile short *)addr)
#define rx65n_usbhost_putreg(val,addr) putreg16(val,(volatile short *)addr)
static void rx65n_usbhost_setbit(volatile short *regadd,
                                 uint16_t setbitval);
static void rx65n_usbhost_clearbit(volatile short *regadd,
                                   uint16_t clearbitval);

/* Semaphores ***************************************************************/

/* Byte stream access helper functions **************************************/

static inline uint16_t rx65n_usbhost_getle16(const uint8_t *val);

/* OHCI memory pool helper functions ****************************************/

static inline void rx65n_usbhost_edfree(struct rx65n_usbhost_ed_s *ed);
static struct rx65n_usbhost_gtd_s *rx65n_usbhost_tdalloc(uint8_t epnum);
static void rx65n_usbhost_tdfree(struct rx65n_usbhost_gtd_s *buffer);
static uint8_t *rx65n_usbhost_tballoc(void);
static void rx65n_usbhost_tbfree(uint8_t *buffer);
#if RX65N_USBHOST_IOBUFFERS > 0
static uint8_t *rx65n_usbhhost_allocio(void);
static void rx65n_usbhhost_freeio(uint8_t *buffer);
#endif
static struct rx65n_usbhost_xfrinfo_s *rx65n_usbhost_alloc_xfrinfo(void);
static void rx65n_usbhost_free_xfrinfo
        (struct rx65n_usbhost_xfrinfo_s *xfrinfo);

/* ED list helper functions *************************************************/

static inline int rx65n_usbhost_addctrled(struct rx65n_usbhost_s *priv,
                                          struct rx65n_usbhost_ed_s *ed);
static inline int rx65n_usbhost_remctrled(struct rx65n_usbhost_s *priv,
                                          struct rx65n_usbhost_ed_s *ed);

static inline int rx65n_usbhost_addbulked(struct rx65n_usbhost_s *priv,
                                          const struct usbhost_epdesc_s
                                          *epdesc, struct rx65n_usbhost_ed_s
                                          *ed);

static inline int rx65n_usbhost_rembulked(struct rx65n_usbhost_s *priv,
                                          struct rx65n_usbhost_ed_s *ed);

#if !defined(CONFIG_USBHOST_INT_DISABLE) || !defined(CONFIG_USBHOST_ISOC_DISABLE)
static unsigned int rx65n_usbhost_getinterval(uint8_t interval);
static void rx65n_usbhost_setinttab(uint32_t value, unsigned int interval,
                                    unsigned int offset);
#endif

static inline int rx65n_usbhost_addinted(struct rx65n_usbhost_s *priv,
                                const struct usbhost_epdesc_s *epdesc,
                                struct rx65n_usbhost_ed_s *ed);
static inline int rx65n_usbhost_reminted(struct rx65n_usbhost_s *priv,
                                struct rx65n_usbhost_ed_s *ed);

static inline int rx65n_usbhost_addisoced(struct rx65n_usbhost_s *priv,
                                  const struct usbhost_epdesc_s *epdesc,
                                  struct rx65n_usbhost_ed_s *ed);
static inline int rx65n_usbhost_remisoced(struct rx65n_usbhost_s *priv,
                                  struct rx65n_usbhost_ed_s *ed);

/* Descriptor helper functions **********************************************/

static int rx65n_usbhost_enqueuetd(struct rx65n_usbhost_s *priv,
                           struct rx65n_usbhost_ed_s *ed, uint32_t dirpid,
                           uint32_t toggle, volatile uint8_t *buffer,
                           size_t buflen);
static int rx65n_usbhost_ctrltd(struct rx65n_usbhost_s *priv,
                        struct rx65n_usbhost_ed_s *ed,
                        uint32_t dirpid, uint8_t *buffer, size_t buflen);

/* Interrupt handling *******************************************************/

static int rx65n_usbhost_usbinterrupt(int irq, void *context, void *arg);

/* USB host controller operations *******************************************/

static int rx65n_usbhost_wait(struct usbhost_connection_s *conn,
                              struct usbhost_hubport_s **hport);
static int rx65n_usbhost_rh_enumerate(struct usbhost_connection_s *conn,
                                      struct usbhost_hubport_s *hport);
static int rx65n_usbhost_enumerate(struct usbhost_connection_s *conn,
                                   struct usbhost_hubport_s *hport);

static int rx65n_usbhost_ep0configure(struct usbhost_driver_s *drvr,
                                      usbhost_ep_t ep0, uint8_t funcaddr,
                                      uint8_t speed, uint16_t maxpacketsize);
static int rx65n_usbhost_epalloc(struct usbhost_driver_s *drvr,
                                 const struct usbhost_epdesc_s *epdesc,
                                 usbhost_ep_t *ep);
static int rx65n_usbhost_epfree(struct usbhost_driver_s *drvr,
                                usbhost_ep_t ep);
static int rx65n_usbhost_alloc(struct usbhost_driver_s *drvr,
                               uint8_t **buffer, size_t *maxlen);
static int rx65n_usbhost_free(struct usbhost_driver_s *drvr,
                              uint8_t *buffer);
static int rx65n_usbhost_ioalloc(struct usbhost_driver_s *drvr,
                                 uint8_t **buffer, size_t buflen);
static int rx65n_usbhost_iofree(struct usbhost_driver_s *drvr,
                                uint8_t *buffer);
static int rx65n_usbhost_ctrlin(struct usbhost_driver_s *drvr,
                                usbhost_ep_t ep0,
                                const struct usb_ctrlreq_s *req,
                                uint8_t *buffer);
static int rx65n_usbhost_ctrlout(struct usbhost_driver_s *drvr,
                                 usbhost_ep_t ep0,
                                 const struct usb_ctrlreq_s *req,
                                 const uint8_t *buffer);
static int rx65n_usbhost_transfer_common(struct rx65n_usbhost_s *priv,
                                         struct rx65n_usbhost_ed_s *ed,
                                         uint8_t *buffer, size_t buflen);
#if RX65N_USBHOST_IOBUFFERS > 0
static int rx65n_usbhost_dma_alloc(struct rx65n_usbhost_s *priv,
                                   struct rx65n_usbhost_ed_s *ed,
                                   uint8_t *userbuffer,
                                   size_t buflen, uint8_t **alloc);
static void rx65n_usbhost_dma_free(struct rx65n_usbhost_s *priv,
                                   struct rx65n_usbhost_ed_s *ed,
                                   uint8_t *userbuffer,
                                   size_t buflen, uint8_t *alloc);
#endif
static ssize_t rx65n_usbhost_transfer(struct usbhost_driver_s *drvr,
                                      usbhost_ep_t ep,
                                      uint8_t *buffer, size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static void rx65n_usbhost_asynch_completion(struct rx65n_usbhost_s *priv,
                                            struct rx65n_usbhost_ed_s *ed);
static int rx65n_usbhost_asynch(struct usbhost_driver_s *drvr,
                                usbhost_ep_t ep, uint8_t *buffer,
                                size_t buflen, usbhost_asynch_t callback,
                                void *arg);
#endif
static int rx65n_usbhost_cancel(struct usbhost_driver_s *drvr,
                                usbhost_ep_t ep);
#ifdef CONFIG_USBHOST_HUB
static int rx65n_usbhost_connect(struct usbhost_driver_s *drvr,
                                 struct usbhost_hubport_s *hport,
                                 bool connected);
#endif
static void rx65n_usbhost_disconnect(struct usbhost_driver_s *drvr,
                                     struct usbhost_hubport_s *hport);

/* Initialization ***********************************************************/

static inline void rx65n_usbhost_ep0init(struct rx65n_usbhost_s *priv);

/* Prototype for USB Private Functions */

static void usb_cstd_set_nak(uint16_t pipe);
static void usb_cstd_clr_transaction_counter(uint16_t trnreg);
void usb_hstd_read_lnst(uint16_t *buf);
void usb_hstd_chk_sof(void);
void usb_hstd_attach(uint16_t result);
void usb_hstd_detach(void);
static void usb_cstd_chg_curpipe(uint16_t pipe, uint16_t fifosel,
                                 uint16_t isel);
static void usb_cstd_do_aclrm(uint16_t pipe);
static void usb_cstd_set_buf(uint16_t pipe);
static void usb_cstd_clr_stall(uint16_t pipe);
static void usb_cstd_pipe_init(uint16_t pipe);
void usb_hstd_bus_reset(void);
uint16_t usb_hstd_detach_process(void);
static uint16_t usb_cstd_get_pipe_dir(uint16_t pipe);
static void usb_cstd_clr_pipe_cnfg(uint16_t pipe_no);

static void *hw_usb_get_fifosel_adr(uint16_t pipemode);
static void *hw_usb_get_fifoctr_adr(uint16_t pipemode);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* In this driver implementation, support is provided for only a single a
 * single USB device.  All status information can be simply retained in a
 * single globalinstance.
 */

static struct rx65n_usbhost_s g_usbhost =
{
  .lock = NXMUTEX_INITIALIZER,
  .pscsem = SEM_INITIALIZER(0),
};

/* This is the connection/enumeration interface */

static struct usbhost_connection_s g_usbconn =
{
  .wait      = rx65n_usbhost_wait,
  .enumerate = rx65n_usbhost_enumerate,
};

/* This is a free list of EDs and TD buffers */

static struct rx65n_usbhost_list_s *g_edfree; /* List of unused EDs */
static struct rx65n_usbhost_list_s *g_tdfree; /* List of unused TDs */
static struct rx65n_usbhost_list_s *g_tbfree; /* List of unused TBs */
#if RX65N_USBHOST_IOBUFFERS > 0
static struct rx65n_usbhost_list_s *g_iofree; /* unused IO buffers */
#endif

/* Pool and free-list of transfer structures */

static struct rx65n_usbhost_list_s *g_xfrfree;
static struct rx65n_usbhost_xfrinfo_s g_xfrbuffers
       [CONFIG_RX65N_USBHOST_NPREALLOC];

/* Prototype for interrupt bottom half function */

static void rx65n_usbhost_bottomhalf(void *arg);

