apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
typedef struct usb_pipe_table
{
    uint16_t    use_flag;
    uint16_t    pipe_cfg;
    uint16_t    pipe_maxp;
    uint16_t    pipe_peri;
} usb_pipe_table_t;

usb_pipe_table_t g_usb_pipe_table[USB_MAX_PIPE_NUM + 1];

uint8_t kbd_report_data[8];
uint8_t kbd_interrupt_in_pipe = 0;

/****************************************************************************
 * Public Data
 ****************************************************************************/

/* Prototypes to avoid errors */

static uint16_t usb_cstd_get_buf_size(uint16_t pipe);
static uint16_t usb_cstd_is_set_frdy(uint16_t pipe, uint16_t fifosel,
                                     uint16_t isel);
static uint16_t usb_cstd_get_maxpacket_size(uint16_t pipe);
uint8_t *usb_hstd_read_fifo(uint16_t count, uint16_t pipemode,
                            uint8_t *read_p);
static uint16_t usb_cstd_get_pid(uint16_t pipe);
uint8_t *usb_hstd_write_fifo(uint16_t count, uint16_t pipemode,
                             uint8_t *write_p);
static void usb_cstd_set_transaction_counter(uint16_t trnreg,
                                             uint16_t trncnt);
static void usb_cstd_nrdy_enable(uint16_t pipe);
void usb_hstd_buf_to_fifo(uint8_t *buffer, size_t buflen, uint16_t pipe,
                          uint16_t useport);
void usb_hstd_forced_termination(uint16_t pipe, uint16_t status);
void usb_hstd_nrdy_endprocess(uint16_t pipe);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void rx65n_usbhost_setbit(volatile short *regadd,
                                 uint16_t setbit_val)
{
  volatile uint16_t value_to_set;
  value_to_set = rx65n_usbhost_getreg(regadd);
  value_to_set = value_to_set | setbit_val;
  rx65n_usbhost_putreg(value_to_set, regadd);
}

static void rx65n_usbhost_clearbit(volatile short *regadd,
                                   uint16_t clearbit_val)
{
  volatile uint16_t value_to_clear;
  value_to_clear = rx65n_usbhost_getreg(regadd);
  value_to_clear = value_to_clear & (~clearbit_val);
  rx65n_usbhost_putreg(value_to_clear, regadd);
}

/****************************************************************************
 * Function Name   : usb_chattaring
 * Description     : Remove chattaring processing
 * Arguments       : uint16_t *syssts : SYSSTS register value
 * Return value    : LNST bit value
 ****************************************************************************/

uint16_t usb_chattaring(uint16_t *syssts)
{
  uint16_t lnst[4];

  /* WAIT_LOOP */

  while (1)
    {
      lnst[0] = (*syssts) & RX65N_USB_SYSSTS0_LNST;
      up_mdelay(1); /* 1ms wait */
      lnst[1] = (*syssts) & RX65N_USB_SYSSTS0_LNST;
      up_mdelay(1); /* 1ms wait */
      lnst[2] = (*syssts) & RX65N_USB_SYSSTS0_LNST;
      if ((lnst[0] == lnst[1]) && (lnst[0] == lnst[2]))
        {
          break;
        }
    }

  return lnst[0];
}

/****************************************************************************
 * Function Name   : hw_usb_hset_enb_ovrcre
 * Description     : Set specified port's OVRCRE-bit (Overcurrent Input
 *                 : Change Interrupt Status Enable) in the INTENB1 register.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hset_enb_ovrcre(void)
{
  rx65n_usbhost_setbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_OVRCRE);
}

/****************************************************************************
 * Function Name   : hw_usb_hclear_enb_ovrcre
 * Description     : Clear the OVRCRE-bit of the specified port's INTENB1
 *                 : register, to prohibit VBUS interrupts.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hclear_enb_ovrcre(void)
{
  rx65n_usbhost_clearbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_OVRCRE);
}

/****************************************************************************
 * Function Name   : hw_usb_hset_enb_bchge
 * Description     : The BCHGE-bit (USB Bus Change Interrupt Enable) is set
 *                 : in the specified port's INTENB1 register. This will
 *                 : cause a BCHG interrupt when a change of USB bus state
 *                 : has been detected.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hset_enb_bchge(void)
{
  rx65n_usbhost_setbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_BCHGE);
}

/****************************************************************************
 * Function Name   : hw_usb_hclear_enb_bchge
 * Description     : The BCHGE-bit (USB Bus Change Interrupt Enable) is
 *                 : cleared in the specified port's INTENB1 register.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hclear_enb_bchge(void)
{
  rx65n_usbhost_clearbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_BCHGE);
}

/****************************************************************************
 * Function Name   : hw_usb_hset_enb_dtche
 * Description     : Enable the specified port's DTCHE-interrupt
 *                 : "Disconnection Detection" by setting the DTCHE-bit.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hset_enb_dtche(void)
{
  rx65n_usbhost_setbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_DTCHE);
}

/****************************************************************************
 * Function Name   : hw_usb_hclear_enb_dtche
 * Description     : Disable the specified port's DTCHE-interrupt
 *                 : "Disconnection Detection" by clearing the DTCHE-bit.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hclear_enb_dtche(void)
{
  rx65n_usbhost_clearbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_DTCHE);
}

/****************************************************************************
 * Function Name   : hw_usb_hset_enb_attche
 * Description     : Enable the specified port's ATTCHE-interrupt "Connection
 *                 : Detection" by setting the ATTCHE-bit.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hset_enb_attche(void)
{
  rx65n_usbhost_setbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_ATTCHE);
}

/****************************************************************************
 * Function Name   : hw_usb_hclear_enb_attche
 * Description     : Disable the specified port's ATTCHE-interrupt
 *                 : "Disconnection Detection" by clearing the ATTCHE-bit.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hclear_enb_attche(void)
{
  rx65n_usbhost_clearbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_ATTCHE);
}

/****************************************************************************
 * Function Name   : hw_usb_hset_enb_signe
 * Description     : Enable the SIGNE-interrupt "Setup Transaction
 *                 : Error" by setting the SIGNE-bit.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hset_enb_signe(void)
{
  rx65n_usbhost_setbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_SIGNE);
}

/****************************************************************************
 * Function Name   : hw_usb_hset_enb_sacke
 * Description     : Enable the SACKE-interrupt "Setup Transaction
 *                 : Normal Response" by setting the SACKE-bit.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hset_enb_sacke(void)
{
  rx65n_usbhost_setbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_SACKE);
}

/****************************************************************************
 * Function Name   : hw_usb_hclear_sts_ovrcr
 * Description     : Clear the specified port's OVRCR-bit; "Over current
 *                 : Input Change Interrupt Status".
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hclear_sts_ovrcr(void)
{
  rx65n_usbhost_putreg(((~RX65N_USB_INTSTS1_OVRCRE) &
                        INTSTS1_BIT_VALUES_TO_ACK), RX65N_USB_INTSTS1);
}

/****************************************************************************
 * Function Name   : hw_usb_hclear_sts_bchg
 * Description     : Clear the specified port's BCHG-bit; "USB Bus Change
 *                 : Interrupt Status".
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hclear_sts_bchg(void)
{
  rx65n_usbhost_putreg(((~RX65N_USB_INTSTS1_BCHG) &
                        INTSTS1_BIT_VALUES_TO_ACK), RX65N_USB_INTSTS1);
}

/****************************************************************************
 * Function Name   : hw_usb_hclear_sts_dtch
 * Description     : Clear the specified port's DTCH-bit; "USB Disconnection
 *                 : Detection Interrupt Status".
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hclear_sts_dtch(void)
{
  rx65n_usbhost_putreg(((~RX65N_USB_INTSTS1_DTCH) &
                        INTSTS1_BIT_VALUES_TO_ACK), RX65N_USB_INTSTS1);
}

/****************************************************************************
 * Function Name   : hw_usb_hclear_sts_attch
 * Description     : Clear the specified port's ATTCH-bit; "ATTCH Interrupt
 *                 : Status".
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

