apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
void hw_usb_hclear_sts_attch(void)
{
  rx65n_usbhost_putreg(((~RX65N_USB_INTSTS1_ATTCH) &
                       INTSTS1_BIT_VALUES_TO_ACK), RX65N_USB_INTSTS1);
}

/****************************************************************************
 * Function Name   : hw_usb_hclear_sts_sign
 * Description     : Clear the SIGN-bit; "Setup Transaction Error
 *                 : Interrupt Status".
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hclear_sts_sign(void)
{
  rx65n_usbhost_putreg(((~RX65N_USB_INTSTS1_SIGN) &
                       INTSTS1_BIT_VALUES_TO_ACK), RX65N_USB_INTSTS1);
}

/****************************************************************************
 * Function Name   : hw_usb_hclear_sts_sack
 * Description     : Clear the SACK-bit; "Setup Transaction Normal
 *                 : Response Interrupt Status".
 *                 : Interrupt Status".
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hclear_sts_sack(void)
{
  rx65n_usbhost_putreg(((~RX65N_USB_INTSTS1_SACK) &
                       INTSTS1_BIT_VALUES_TO_ACK), RX65N_USB_INTSTS1);
}

/****************************************************************************
 * Function Name   : hw_usb_hwrite_dcpctr
 * Description     : Write the specified data value to the DCPCTR register.
 * Arguments       : uint16_t  data   : Setting value
 * Return value    : none
 ****************************************************************************/

void hw_usb_hwrite_dcpctr(uint16_t data)
{
  rx65n_usbhost_putreg(data, RX65N_USB_DCPCTR);
}

/****************************************************************************
 * Function Name   : hw_usb_hset_sureq
 * Description     : Set the SUREQ-bit in the DCPCTR register
 *                 : (Set SETUP packet send when HostController function
 *                                 : is selected)
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hset_sureq(void)
{
  rx65n_usbhost_setbit(RX65N_USB_DCPCTR, RX65N_USB_DCPCTR_SUREQ);
}

/****************************************************************************
 * Function Name   : hw_usb_hread_devadd
 * Description     : Return the DEVADD register value for the specified USB
 *                 ; device address.
 * Arguments       : uint16_t  devsel : USB device address value
 * Return value    : DEVADDx content
 ****************************************************************************/

uint16_t hw_usb_hread_devadd(uint16_t devsel)
{
  volatile uint16_t *preg;
  uint16_t devadr;
  uint16_t return_value;

  devadr = devsel >> USB_DEVADDRBIT;

  if (devadr > USB_MAXDEVADDR)
    {
      uerr("ERROR: device address %d is more than max device \
            address.\n", devadd);
      return -ENODEV;
    }
  else
    {
      preg = (uint16_t *)((RX65N_USB_DEVADD0) + (devadr));
      return_value = ((*preg));
      return return_value;
    }
}

/****************************************************************************
 * Function Name   : hw_usb_hset_usbspd
 * Description     : Set the DEVADD register's USBSPD for the specified
 *                                 : device address.
 * Arguments       : uint16_t  devsel : USB device address value
 *                 : uint16_t  data   : The value to write.
 * Return value    : none
 ****************************************************************************/

void hw_usb_hset_usbspd(uint16_t devsel, uint8_t data)
{
  volatile uint16_t *preg;
  uint16_t devadr;

  devadr = devsel;

  preg = (uint16_t *)(RX65N_USB_DEVADD0 + devadr);

  (*preg) &= (~RX65N_USB_DEVSPD);

  (*preg) |= data;
}

/****************************************************************************
 * Function Name   : hw_usb_hmodule_init
 * Description     : USB module initialization for USB Host mode
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_hmodule_init(void)
{
  uint16_t sts;

  rx65n_usbhost_setbit(RX65N_USB_SYSCFG, RX65N_USB_SYSCFG_SCKE);
  up_mdelay(1);

  /* wait until SCKE bit is set */

  while (1)
    {
      uint16_t regval;
      regval = rx65n_usbhost_getreg(RX65N_USB_SYSCFG);
      if (regval & RX65N_USB_SYSCFG_SCKE)
      break;
    }

  putreg32(0x05, RX65N_USB_PHYSLEW);

  rx65n_usbhost_setbit(RX65N_USB_SYSCFG, RX65N_USB_SYSCFG_DCFM);

  rx65n_usbhost_setbit(RX65N_USB_SYSCFG, RX65N_USB_SYSCFG_DRPD);

  sts = usb_chattaring((uint16_t *)RX65N_USB_SYSSTS0);

  rx65n_usbhost_setbit(RX65N_USB_SYSCFG, RX65N_USB_SYSCFG_USBE);

  rx65n_usbhost_setbit(RX65N_USB_CFIFOSEL, RX65N_USB_CFIFOSEL_MBW_16);
  rx65n_usbhost_setbit(RX65N_USB_D0FIFOSEL, RX65N_USB_DFIFOSEL_MBW_16);
  rx65n_usbhost_setbit(RX65N_USB_D1FIFOSEL, RX65N_USB_DFIFOSEL_MBW_16);

  switch (sts)
  {
    case RX65N_USB_SYSSTS0_LNST_LS_JSTS:
    case RX65N_USB_SYSSTS0_LNST_FS_JSTS: /* USB device already connected */

    syslog(LOG_INFO, "USB Device already connected\n");
    rx65n_usbhost_setbit(RX65N_USB_DVSTCTR0, RX65N_USB_DVSTCTR0_USBRST);
    up_mdelay(20);                        /* Need to wait greater equal 10ms in USB spec */
    rx65n_usbhost_clearbit(RX65N_USB_DVSTCTR0,
                           RX65N_USB_DVSTCTR0_USBRST);

    /* WAIT_LOOP */

    while (((rx65n_usbhost_getreg(RX65N_USB_DVSTCTR0)) &
        RX65N_USB_DVSTCTR0_RHST) == 4)
      {
        /* Wait till the reset is completed */

        up_mdelay(1);
      }

    if (((rx65n_usbhost_getreg(RX65N_USB_DVSTCTR0)) &
          RX65N_USB_DVSTCTR0_RHST) ==
          RX65N_USB_DVSTCTR0_SPEED_LOW)
      {
        rx65n_usbhost_setbit(RX65N_USB_SOFCFG,
        RX65N_USB_SOFCFG_TRNENSEL);
      }

    rx65n_usbhost_setbit(RX65N_USB_DVSTCTR0,
    RX65N_USB_DVSTCTR0_UACT);
    break;

    case RX65N_USB_SYSSTS0_LNST_SE0:     /* USB device not connected */
    rx65n_usbhost_setbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_ATTCHE);
    break;

    default:
    break;
  }

