apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  rx65n_usbhost_putreg(((~RX65N_USB_INTSTS1_OVRCRE) &
  INTSTS1_BIT_VALUES_TO_ACK), RX65N_USB_INTSTS1);
  rx65n_usbhost_setbit(RX65N_USB_INTENB0, (RX65N_USB_INTENB0_BEMPE |
  RX65N_USB_INTENB0_NRDYE | RX65N_USB_INTENB0_BRDYE));
  rx65n_usbhost_setbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_ATTCHE);
}

/****************************************************************************
 * Function Name   : hw_usb_read_syscfg
 * Description     : Returns the SYSCFG register value.
 * Arguments       : none
 * Return value    : SYSCFG content.
 ****************************************************************************/

uint16_t hw_usb_read_syscfg(void)
{
  return rx65n_usbhost_getreg(RX65N_USB_SYSCFG);
}

/****************************************************************************
 * Function Name   : hw_usb_set_usbe
 * Description     : Enable USB operation.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_set_usbe(void)
{
  rx65n_usbhost_setbit(RX65N_USB_SYSCFG, RX65N_USB_SYSCFG_USBE);
}

/****************************************************************************
 * Function Name   : hw_usb_clear_usbe
 * Description     : Enable USB operation.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_clear_usbe(void)
{
  rx65n_usbhost_clearbit(RX65N_USB_SYSCFG, RX65N_USB_SYSCFG_USBE);
}

/****************************************************************************
 * Function Name   : hw_usb_read_syssts
 * Description     : Returns the value of the specified port's SYSSTS
 *                 : register.
 * Arguments       : none
 * Return value    : SYSSTS0 content
 ****************************************************************************/

static uint16_t hw_usb_read_syssts(void)
{
  return rx65n_usbhost_getreg(RX65N_USB_SYSSTS0);
}

/****************************************************************************
 * Function Name   : hw_usb_read_dvstctr
 * Description     : Returns the specified port's DVSTCTR register content.
 * Arguments       : none
 * Return value    : DVSTCTR0 content
 ****************************************************************************/

static uint16_t hw_usb_read_dvstctr(void)
{
  return rx65n_usbhost_getreg(RX65N_USB_DVSTCTR0);
}

/****************************************************************************
 * Function Name   : hw_usb_rmw_dvstctr
 * Description     : Read-modify-write the specified port's DVSTCTR.
 * Arguments       : uint16_t  data  : The value to write.
 *                 : uint16_t  bitptn: Bit pattern to read-modify-write.
 * Return value    : none
 ****************************************************************************/

void hw_usb_rmw_dvstctr(uint16_t data, uint16_t bitptn)
{
  uint16_t buf;

  buf = rx65n_usbhost_getreg(RX65N_USB_DVSTCTR0);
  buf &= (~bitptn);
  buf |= (data & bitptn);

  rx65n_usbhost_putreg(buf, RX65N_USB_DVSTCTR0);
}

/****************************************************************************
 * Function Name   : hw_usb_clear_dvstctr
 * Description     : Clear the bit pattern specified in argument, of the
 *                                 : specified port's DVSTCTR register.
 * Arguments       : uint16_t  bitptn: Bit pattern to read-modify-write.
 * Return value    : none
 ****************************************************************************/

void hw_usb_clear_dvstctr(uint16_t bitptn)
{
  rx65n_usbhost_clearbit(RX65N_USB_DVSTCTR0, bitptn);
}

/****************************************************************************
 * Function Name   : hw_usb_set_vbout
 * Description     : Set specified port's VBOUT-bit in the DVSTCTR register.
 *                 : (To output a "High" to pin VBOUT.)
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_set_vbout(void)
{
  rx65n_usbhost_setbit(RX65N_USB_DVSTCTR0, RX65N_USB_DVSTCTR0_VBUSEN);
}

/****************************************************************************
 * Function Name   : hw_usb_clear_vbout
 * Description     : Clear specified port's VBOUT-bit in the DVSTCTR register
 *                 : (To output a "Low" to pin VBOUT.)
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_clear_vbout(void)
{
  rx65n_usbhost_clearbit(RX65N_USB_DVSTCTR0, RX65N_USB_DVSTCTR0_VBUSEN);
}

/****************************************************************************
 * Function Name   : hw_usb_read_fifo16
 * Description     : Data is read from the specified pipemode's FIFO register
 *                 : 16-bits  wide, corresponding to the specified PIPEMODE.
 * Arguments       : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 * Return value    : CFIFO/D0FIFO/D1FIFO content (16-bit)
 ****************************************************************************/

static uint16_t hw_usb_read_fifo16(uint16_t pipemode)
{
  uint16_t data = 0;

  switch (pipemode)
    {
      case RX65N_USB_USING_CFIFO:
      data = USB0.CFIFO.WORD;
      break;

      case RX65N_USB_USING_D0FIFO:
      data = rx65n_usbhost_getreg(RX65N_USB_D0FIFO);
      break;

      case RX65N_USB_USING_D1FIFO:
      data = rx65n_usbhost_getreg(RX65N_USB_D1FIFO);
      break;

      default:
      syslog(LOG_INFO, "Debug : %s(): Line : %d what is this \
             pipe mode?? %d\n", __func__, __LINE__, pipemode);
      break;
    }

  return data;
}

/****************************************************************************
 * Function Name   : hw_usb_write_fifo16
 * Description     : Data is written to the specified pipemode's FIFO
 *                 : register, 16-bits wide, corresponding to the specified
 *                 : PIPEMODE.
 * Arguments       : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 *                 : uint16_t  data      : Setting value
 * Return value    : none
 ****************************************************************************/

static void hw_usb_write_fifo16(uint16_t pipemode, uint16_t data)
{
  switch (pipemode)
    {
      case RX65N_USB_USING_CFIFO:
      data = rx65n_usbhost_putreg(data, RX65N_USB_CFIFO);
      break;

      case RX65N_USB_USING_D0FIFO:
      data = rx65n_usbhost_putreg(data, RX65N_USB_D0FIFO);
      break;

      case RX65N_USB_USING_D1FIFO:
      data = rx65n_usbhost_putreg(data, RX65N_USB_D1FIFO);
      break;

      default:
      syslog(LOG_INFO, "Debug : %s(): Line : %d what is this \
             pipe mode?? %d\n", __func__, __LINE__, pipemode);
      break;
    }
}

/****************************************************************************
 * Function Name   : hw_usb_write_fifo8
 * Description     : Data is written to the specified pipemode's FIFO
 *                 : register, 8-bits wide, corresponding to the specified
 *                 : PIPEMODE.
 * Arguments       : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 *                 : uint8_t  data       : Setting value
 * Return value    : none
 ****************************************************************************/

