apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
static void hw_usb_write_fifo8(uint16_t pipemode, uint8_t data)
{
  switch (pipemode)
  {
    case USB_CUSE:

    /* USB0_CFIFO8 = data; */

    putreg8(data, RX65N_USB_CFIFO);
    break;

    case USB_D0USE:

    /* USB0_D0FIFO8 = data; */

    putreg8(data, RX65N_USB_D0FIFO);
    break;

    case USB_D1USE:

    /* USB0_D1FIFO8 = data; */

    putreg8(data, RX65N_USB_D1FIFO);
    break;

    default:
    syslog(LOG_INFO, "Debug : %s(): Line : %d Debug hook...\n",
           __func__, __LINE__);
    break;
  }
}

/****************************************************************************
 * Function Name   : hw_usb_get_fifosel_adr
 * Description     : Returns the *address* of the FIFOSEL register
 *                 : corresponding to specified PIPEMODE.
 * Arguments       : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 * Return value    : none
 ****************************************************************************/

static void *hw_usb_get_fifosel_adr(uint16_t pipemode)
{
  void *p_reg = NULL;

  switch (pipemode)
    {
      case RX65N_USB_USING_CFIFO:
      p_reg = (void *)RX65N_USB_CFIFOSEL;
      break;

      case RX65N_USB_USING_D0FIFO:
      p_reg = (void *)RX65N_USB_D0FIFOSEL;
      break;

      case RX65N_USB_USING_D1FIFO:
      p_reg = (void *)RX65N_USB_D1FIFOSEL;
      break;

      default:
      syslog(LOG_INFO,
             "Debug : %s(): Line : %d what is this pipe mode?? %d\n",
             __func__, __LINE__, pipemode);
      break;
    }

  return p_reg;
}

/****************************************************************************
 * Function Name   : hw_usb_read_fifosel
 * Description     : Returns the value of the specified pipemode's FIFOSEL
 *                 : register.
 * Arguments       : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 * Return value    : FIFOSEL content
 ****************************************************************************/

static uint16_t hw_usb_read_fifosel(uint16_t pipemode)
{
  volatile uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifosel_adr(pipemode);

  return *p_reg;
}

/****************************************************************************
 * Function Name   : hw_usb_rmw_fifosel
 * Description     : Data is written to the specified pipemode's FIFOSEL
 *                 : register (the FIFOSEL corresponding to the specified
 *                 : PIPEMODE), using read-modify-write.
 * Arguments       : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
 *                 : uint16_t  data      : Setting value
 *                 : uint16_t bitptn   : bitptn: Bit pattern to
 *                 : read-modify-write.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_rmw_fifosel(uint16_t pipemode, uint16_t data,
                               uint16_t bitptn)
{
  uint16_t buf;
  volatile uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifosel_adr(pipemode);

  buf = *p_reg;
  buf &= (~bitptn);
  buf |= (data & bitptn);
  *p_reg = buf;
}

/****************************************************************************
 * Function Name   : hw_usb_set_mbw
 * Description     : Set MBW-bits (CFIFO Port Access Bit Width) of the
 *                 : FIFOSEL corresponding to the specified PIPEMODE, to
 *                 : select 8 or 16-bit wide FIFO port access.
 * Arguments       : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 *                 : uint16_t  data       : Setting value
 *                 : (data = 0x0400), 32 bit (data = 0x0800) access mode.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_mbw(uint16_t pipemode, uint16_t data)
{
  volatile uint16_t *p_reg;

  p_reg = hw_usb_get_fifosel_adr(pipemode);
  (*p_reg) &= (~RX65N_USB_CFIFOSEL_MBW_16);

  if (0 != data)
    {
      (*p_reg) |= RX65N_USB_CFIFOSEL_MBW_16;
    }
}

/****************************************************************************
 * Function Name   : hw_usb_set_curpipe
 * Description     : Set pipe to the number given; in the FIFOSEL
 *                 : corresponding to specified PIPEMODE.
 * Arguments       : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 *                 : uint16_t  pipeno     : Pipe number.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_curpipe(uint16_t pipemode, uint16_t pipeno)
{
  volatile uint16_t *p_reg;
  volatile uint16_t reg;

  p_reg = hw_usb_get_fifosel_adr(pipemode);
  reg = *p_reg;

#ifdef CONFIG_RX65N_USBHOST_DMA
  if ((USB_D0USE == pipemode) || (USB_D1USE == pipemode))
    {
      if (false == usb_check_use_usba_module(ptr))
        {
          reg &= (~USB_DREQE);
        }
    }
#endif /* NOT_USING_D0_D1_FIFO */

  reg &= (~RX65N_USB_CFIFOSEL_CURPIPE_MASK);
  *p_reg = reg;

  reg |= pipeno;

  *p_reg = reg;
}

/****************************************************************************
 * Function Name   : hw_usb_get_fifoctr_adr
 * Description     : Returns the *address* of the FIFOCTR register
 *                 : corresponding to specified PIPEMODE.
 *                 : (FIFO Port Control Register.)
 * Arguments       : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 * Return value    : none
 ****************************************************************************/

static void *hw_usb_get_fifoctr_adr(uint16_t pipemode)
{
  void *p_reg = NULL;
  switch (pipemode)
    {
      case RX65N_USB_USING_CFIFO:
      p_reg = (void *)RX65N_USB_CFIFOCTR;
      break;

      case RX65N_USB_USING_D0FIFO:
      p_reg = (void *)RX65N_USB_D0FIFOCTR;
      break;

      case RX65N_USB_USING_D1FIFO:
      p_reg = (void *)RX65N_USB_D0FIFOCTR;
      break;

      default:
      syslog(LOG_INFO, "Debug : %s(): Line : %d what is this \
             pipe mode?? %d\n",
             __func__, __LINE__, pipemode);
      break;
    }

  return p_reg;
}

/****************************************************************************
 * Function Name   : hw_usb_read_fifoctr
 * Description     : Returns the value of the FIFOCTR register corresponding
 *                 : to specified PIPEMODE.
 * Arguments       : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 * Return value    : FIFOCTR content
 ****************************************************************************/

static uint16_t hw_usb_read_fifoctr(uint16_t pipemode)
{
  volatile uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifoctr_adr(pipemode);

