apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  return *p_reg;
}

/****************************************************************************
 * Function Name   : hw_usb_set_bval
 * Description     : Set BVAL (Buffer Memory Valid Flag) to the number given;
 *                 : in the FIFOCTR corresponding to the specified PIPEMODE.
 * Arguments       : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_bval(uint16_t pipemode)
{
  volatile uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifoctr_adr(pipemode);

  (*p_reg) |= RX65N_USB_FIFOCTR_BVAL;
}

/****************************************************************************
 * Function Name   : hw_usb_set_bclr
 * Description     : Set BCLR (CPU Buffer Clear) to the number given; in the
 *                 : FIFOCTR corresponding to the specified PIPEMODE.
 * Arguments       : uint16_t  pipemode   : CUSE/D0DMA/D1DMA
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_bclr(uint16_t pipemode)
{
  volatile uint16_t *p_reg;

  p_reg = (uint16_t *)hw_usb_get_fifoctr_adr(pipemode);

  *p_reg = RX65N_USB_FIFOCTR_BCLR;
}

/****************************************************************************
 * Function Name   : hw_usb_set_intenb
 * Description     : Bit(s) to be set in INTENB register,
 *                 : enabling the respective USB interrupt(s).
 * Arguments       : uint16_t  data  : Bit pattern: Respective interrupts
 *                 :         with '1' will be enabled.
 * Return value    : none
 ****************************************************************************/

void hw_usb_set_intenb(uint16_t data)
{
  rx65n_usbhost_setbit(RX65N_USB_INTENB0, data);
}

/****************************************************************************
 * Function Name   : hw_usb_set_brdyenb
 * Description     : A bit is set in the specified pipe's BRDYENB, enabling
 *                 : the respective pipe BRDY interrupt(s).
 * Arguments       : uint16_t  pipeno : Pipe number.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_brdyenb(uint16_t pipeno)
{
  rx65n_usbhost_setbit(RX65N_USB_BRDYENB, (1 << pipeno));
}

/****************************************************************************
 * Function Name   : hw_usb_clear_brdyenb
 * Description     : Clear the PIPExBRDYE-bit of the specified pipe to
 *                 : prohibit BRDY interrupts of that pipe.
 * Arguments       : uint16_t  pipeno : Pipe number.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_clear_brdyenb(uint16_t pipeno)
{
  rx65n_usbhost_clearbit(RX65N_USB_BRDYENB, (1 << pipeno));
}

/****************************************************************************
 * Function Name   : hw_usb_set_nrdyenb
 * Description     : A bit is set in the specified pipe's NRDYENB, enabling
 *                 : the respective pipe NRDY interrupt(s).
 * Arguments       : uint16_t  pipeno : Pipe number
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_nrdyenb(uint16_t pipeno)
{
  rx65n_usbhost_setbit(RX65N_USB_NRDYENB, (1 << pipeno));
}

/****************************************************************************
 * Function Name   : hw_usb_clear_nrdyenb
 * Description     : Clear the PIPExNRDYE-bit of the specified pipe to
 *                 : prohibit NRDY interrupts of that pipe.
 * Arguments       : uint16_t  pipeno : Pipe number.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_clear_nrdyenb(uint16_t pipeno)
{
  rx65n_usbhost_clearbit(RX65N_USB_NRDYENB, (1 << pipeno));
}

/****************************************************************************
 * Function Name   : hw_usb_set_bempenb
 * Description     : A bit is set in the specified pipe's BEMPENB enabling
 *                 : the respective pipe's BEMP interrupt(s).
 * Arguments       : uint16_t  pipeno  : Pipe number.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_bempenb(uint16_t pipeno)
{
  rx65n_usbhost_setbit(RX65N_USB_BEMPENB, (1 << pipeno));
}

/****************************************************************************
 * Function Name   : hw_usb_clear_bempenb
 * Description     : Clear the PIPExBEMPE-bit of the specified pipe to
 *                 : prohibit BEMP interrupts of that pipe.
 * Arguments       : uint16_t  pipeno : Pipe number.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_clear_bempenb(uint16_t pipeno)
{
  rx65n_usbhost_clearbit(RX65N_USB_BEMPENB, (1 << pipeno));
}

/****************************************************************************
 * Function Name   : hw_usb_clear_sts_sofr
 * Description     : Clear the SOFR-bit (Frame Number Refresh Interrupt
 *                 : Status) of the clear SOF interrupt status.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void hw_usb_clear_sts_sofr(void)
{
  rx65n_usbhost_clearbit(RX65N_USB_INTSTS0, RX65N_USB_INTSTS0_SOFR);
}

/****************************************************************************
 * Function Name   : hw_usb_clear_sts_brdy
 * Description     : Clear the PIPExBRDY status bit of the specified pipe to
 *                 : clear its BRDY interrupt status.
 * Arguments       : uint16_t  pipeno: Pipe number.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_clear_sts_brdy(uint16_t pipeno)
{
  rx65n_usbhost_putreg((~(1 << pipeno)) & RX65N_USB_PIPE_ALL,
  RX65N_USB_BRDYSTS);
}

/****************************************************************************
 * Function Name   : hw_usb_clear_status_nrdy
 * Description     : Clear the PIPExNRDY status bit of the specified pipe to
 *                 : clear its NRDY interrupt status.
 * Arguments       : uint16_t  pipeno: Pipe number.
 * Return value    : none
 ****************************************************************************/

