apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
static void hw_usb_clear_status_nrdy(uint16_t pipeno)
{
  rx65n_usbhost_putreg((~(1 << pipeno)) & RX65N_USB_PIPE_ALL,
    RX65N_USB_NRDYSTS);
}

/****************************************************************************
 * Function Name   : hw_usb_clear_status_bemp
 * Description     : Clear the PIPExBEMP status bit of the specified pipe to
 *                 :  its BEMP interrupt status.
 * Arguments       : uint16_t  pipeno: Pipe number.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_clear_status_bemp(uint16_t pipeno)
{
  rx65n_usbhost_putreg((~(1 << pipeno)) & RX65N_USB_PIPE_ALL,
    RX65N_USB_BEMPSTS);
}

/****************************************************************************
 * Function Name   : hw_usb_write_dcpcfg
 * Description     : Specified data is written to DCPCFG register.
 * Arguments       : uint16_t  data   : Setting value
 * Return value    : none
 ****************************************************************************/

static void hw_usb_write_dcpcfg(uint16_t data)
{
  rx65n_usbhost_putreg(data, RX65N_USB_DCPCFG);
}

/****************************************************************************
 * Function Name   : hw_usb_read_dcpmaxp
 * Description     : Returns DCPMAXP register content.
 * Arguments       : none
 * Return value    : DCPMAXP content
 ****************************************************************************/

static uint16_t hw_usb_read_dcpmaxp(void)
{
  return rx65n_usbhost_getreg(RX65N_USB_DCPMAXP);
}

/****************************************************************************
 * Function Name   : hw_usb_write_dcpmxps
 * Description     : Specified data is written to DCPMAXP register.
 * Arguments       : uint16_t  data   : Setting value
 * Return value    : none
 ****************************************************************************/

static void hw_usb_write_dcpmxps(uint16_t data)
{
  rx65n_usbhost_putreg(data, RX65N_USB_DCPMAXP);
}

/****************************************************************************
 * Function Name   : hw_usb_write_pipesel
 * Description     : Specified data is written to PIPESEL register.
 * Arguments       : uint16_t  data   : The value to write.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_write_pipesel(uint16_t data)
{
  rx65n_usbhost_putreg(data, RX65N_USB_PIPESEL);
}

/****************************************************************************
 * Function Name   : hw_usb_read_pipecfg
 * Description     : Returns PIPECFG register content.
 * Arguments       : none
 * Return value    : PIPECFG content
 ****************************************************************************/

static uint16_t hw_usb_read_pipecfg(void)
{
  return rx65n_usbhost_getreg(RX65N_USB_PIPECFG);
}

/****************************************************************************
 * Function Name   : hw_usb_write_pipecfg
 * Description     : Specified data is written to PIPECFG register.
 * Arguments       : uint16_t  data   : Setting value
 * Return value    : none
 ****************************************************************************/

static void hw_usb_write_pipecfg(uint16_t data)
{
  rx65n_usbhost_putreg(data, RX65N_USB_PIPECFG);
}

/****************************************************************************
 * Function Name   : hw_usb_read_pipemaxp
 * Description     : Returns PIPEMAXP register content.
 * Arguments       : none
 * Return value    : PIPEMAXP content
 ****************************************************************************/

static uint16_t hw_usb_read_pipemaxp(void)
{
  return rx65n_usbhost_getreg(RX65N_USB_PIPEMAXP);
}

/****************************************************************************
 * Function Name   : hw_usb_write_pipemaxp
 * Description     : Specified data is written to PIPEMAXP register.
 * Arguments       : uint16_t  data   : Setting value
 * Return value    : none
 ****************************************************************************/

static void hw_usb_write_pipemaxp(uint16_t data)
{
  rx65n_usbhost_putreg(data, RX65N_USB_PIPEMAXP);
}

/****************************************************************************
 * Function Name   : hw_usb_write_pipeperi
 * Description     : Specified data is written to PIPEPERI register.
 * Arguments       : uint16_t  data   : Setting value
 * Return value    : none
 ****************************************************************************/

static void hw_usb_write_pipeperi(uint16_t data)
{
  rx65n_usbhost_putreg(data, RX65N_USB_PIPEPERI);
}

/****************************************************************************
 * Function Name   : hw_usb_read_pipectr
 * Description     : Returns DCPCTR or the specified pipe's PIPECTR register
 *                 : content. The Pipe Control Register returned is
 *                 : determined by the specified pipe number.
 * Arguments       : uint16_t  pipeno : Pipe number.
 * Return value    : PIPExCTR content
 ****************************************************************************/

static uint16_t hw_usb_read_pipectr(uint16_t pipeno)
{
  volatile uint16_t *p_reg;

  /* Control pipe */

  if (pipeno == 0)
    {
      p_reg = (uint16_t *)RX65N_USB_DCPCTR;
    }
  else
    {
      p_reg = (uint16_t *)(RX65N_USB_PIPE1CTR + (pipeno - 1));
    }

  return rx65n_usbhost_getreg(p_reg);
}

/****************************************************************************
 * Function Name   : hw_usb_write_pipectr
 * Description     : Specified data is written to the specified pipe's
 *                 : PIPEPERI register.
 * Arguments       : uint16_t  pipeno : Pipe number
 *                 : uint16_t  data   : Setting value
 * Return value    : none
 ****************************************************************************/

void hw_usb_write_pipectr(uint16_t pipeno, uint16_t data)
{
  volatile uint16_t *p_reg;

  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)RX65N_USB_DCPCTR;
    }
  else
    {
      p_reg = (uint16_t *)RX65N_USB_PIPE1CTR + (pipeno - 1);
    }

  *p_reg = data;
}

/****************************************************************************
 * Function Name   : hw_usb_set_aclrm
 * Description     : The ACLRM-bit (Auto Buffer Clear Mode) is set in the
 *                 : specified pipe's control register.
 * Arguments       : uint16_t  pipeno : Pipe number
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_aclrm(uint16_t pipeno)
{
  volatile uint16_t *p_reg;
  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)RX65N_USB_DCPCTR;
    }
  else
    {
      p_reg = (uint16_t *)RX65N_USB_PIPE1CTR + (pipeno - 1);
    }

  (*p_reg) |= RX65N_USB_PIPECTR_ACLRM;
}

/****************************************************************************
 * Function Name   : hw_usb_clear_aclrm
 * Description     : Clear the ACLRM bit in the specified pipe's control
 *                 : register to disable Auto Buffer Clear Mode.
 *                 : its BEMP interrupt status.
 * Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
 *                 : uint16_t  pipeno : Pipe number
 * Return value    : none
 ****************************************************************************/

static void hw_usb_clear_aclrm(uint16_t pipeno)
{
  volatile uint16_t *p_reg;
  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)RX65N_USB_DCPCTR;
    }
  else
    {
      p_reg = (uint16_t *)RX65N_USB_PIPE1CTR + (pipeno - 1);
    }

  (*p_reg) &= (~RX65N_USB_PIPECTR_ACLRM);
}

/****************************************************************************
 * Function Name   : hw_usb_set_sqclr
 * Description     : The SQCLR-bit (Toggle Bit Clear) is set in the specified
 *                 : pipe's control register. Setting SQSET to 1 makes DATA0
 *                 : the expected data in the pipe's next transfer.
 * Arguments       : uint16_t  pipeno : Pipe number
 * Return value    : none
 ****************************************************************************/

