apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
static void hw_usb_set_sqclr(uint16_t pipeno)
{
  volatile uint16_t *p_reg;
  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)RX65N_USB_DCPCTR;
    }
    else
    {
      p_reg = (uint16_t *)RX65N_USB_PIPE1CTR + (pipeno - 1);
    }

  (*p_reg) |= RX65N_USB_PIPECTR_SQCLR;
}

/****************************************************************************
 * Function Name   : hw_usb_set_sqset
 * Description     : The SQSET-bit (Toggle Bit Set) is set in the specified
 *                 : pipe's control register. Setting SQSET to 1 makes DATA1
 *                 : the expected data in the next transfer.
 * Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
 *                 : uint16_t  pipeno : Pipe number
 * Return value    : none
 ****************************************************************************/

void hw_usb_set_sqset(uint16_t pipeno)
{
  volatile uint16_t *p_reg;
  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)RX65N_USB_DCPCTR;
    }
  else
    {
      p_reg = (uint16_t *)RX65N_USB_PIPE1CTR + (pipeno - 1);
    }

  (*p_reg) |= RX65N_USB_PIPECTR_SQSET;
}

/****************************************************************************
 * Function Name   : hw_usb_set_pid
 * Description     : Set the specified PID of the specified pipe's
 *                 : DCPCTR/PIPECTR register.
 * Arguments       : uint16_t  pipeno : Pipe number
 *                 : uint16_t  data   : NAK/BUF/STALL.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_pid(uint16_t pipeno, uint16_t data)
{
  volatile uint16_t *p_reg;
  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)RX65N_USB_DCPCTR;
    }
  else
    {
      p_reg = (uint16_t *)RX65N_USB_PIPE1CTR + (pipeno - 1);
    }

  (*p_reg) &= (~RX65N_USB_PIPECTR_PID_MASK);
  (*p_reg) |= data;
}

/****************************************************************************
 * Function Name   : hw_usb_clear_pid
 * Description     : Clear the specified PID-bits of the specified pipe's
 *                 : DCPCTR/PIPECTR register.
 * Arguments       : uint16_t  pipeno : Pipe number
 *                 : uint16_t  data  : NAK/BUF/STALL - to be cleared.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_clear_pid(uint16_t pipeno, uint16_t data)
{
  volatile uint16_t *p_reg;
  if (USB_PIPE0 == pipeno)
    {
      p_reg = (uint16_t *)RX65N_USB_DCPCTR;
    }
  else
    {
      p_reg = (uint16_t *)RX65N_USB_PIPE1CTR + (pipeno - 1);
    }

  (*p_reg) &= (~RX65N_USB_PIPECTR_PID_MASK);
}

/****************************************************************************
 * Function Name   : hw_usb_set_trenb
 * Description     : The TRENB-bit (Transaction Counter Enable) is set in
 *                 : the specified pipe's control register, to enable the
 *                 : counter.
 * Arguments       : uint16_t  pipeno : Pipe number
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_trenb(uint16_t pipeno)
{
  volatile uint16_t *p_reg;

  p_reg = (uint16_t *)RX65N_USB_PIPE1TRE + ((pipeno - 1) * 2);

  (*p_reg) |= RX65N_USB_PIPETRE_TRENB;
}

/****************************************************************************
 * Function Name   : hw_usb_clear_trenb
 * Description     : The TRENB-bit (Transaction Counter Enable) is cleared in
 *                 : the specified pipe's control register, to disable the
 *                 : counter.
 * Arguments       : uint16_t  pipeno : Pipe number
 * Return value    : none
 ****************************************************************************/

static void hw_usb_clear_trenb(uint16_t pipeno)
{
  volatile uint16_t *p_reg;

  p_reg = (uint16_t *)RX65N_USB_PIPE1TRE + ((pipeno - 1) * 2);

  (*p_reg) &= (~RX65N_USB_PIPETRE_TRENB);
}

/****************************************************************************
 * Function Name   : hw_usb_set_trclr
 * Description     : The TRENB-bit (Transaction Counter Clear) is set in the
 *                 : specified pipe's control register to clear the current
 *                 : counter value.
 * Arguments       : uint16_t  pipeno : Pipe number
 * Return value    : none
 ****************************************************************************/

static void hw_usb_set_trclr(uint16_t pipeno)
{
  volatile uint16_t *p_reg;

  p_reg = (uint16_t *)RX65N_USB_PIPE1TRE + ((pipeno - 1) * 2);
  (*p_reg) |= RX65N_USB_PIPETRE_TRCLR;
}

/****************************************************************************
 * Function Name   : hw_usb_write_pipetrn
 * Description     : Specified data is written to the specified pipe's
 *                 : PIPETRN register.
 * Arguments       : uint16_t  pipeno : Pipe number
 *                 : uint16_t  data   : The value to write.
 * Return value    : none
 ****************************************************************************/

static void hw_usb_write_pipetrn(uint16_t pipeno, uint16_t data)
{
  volatile uint16_t *p_reg;

  p_reg = (uint16_t *)RX65N_USB_PIPE1TRN + ((pipeno - 1) * 2);

  *p_reg = data;
}

/****************************************************************************
 * Function Name   : usb_hstd_bchg_enable
 * Description     : Enable BCHG interrupt for the specified USB port.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_bchg_enable(void)
{
  hw_usb_hclear_sts_bchg();
  hw_usb_hset_enb_bchge();
}

/****************************************************************************
 * Function Name   : usb_hstd_bchg_disable
 * Description     : Disable BCHG interrupt for specified USB port.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_bchg_disable(void)
{
  hw_usb_hclear_sts_bchg();
  hw_usb_hclear_enb_bchge();
}

/****************************************************************************
 * Function Name   : usb_hstd_set_uact
 * Description     : Start sending SOF to the connected USB device.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_set_uact(void)
{
  hw_usb_rmw_dvstctr(RX65N_USB_DVSTCTR0_UACT,
                    ((RX65N_USB_DVSTCTR0_USBRST |
                      RX65N_USB_DVSTCTR0_RESUME) |
                     RX65N_USB_DVSTCTR0_UACT));
}

/****************************************************************************
 * Function Name   : usb_hstd_attch_enable
 * Description     : Enable ATTCH (attach) interrupt of the specified USB
 *                 : port.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_attch_enable(void)
{
  /* ATTCH status Clear */

  hw_usb_hclear_sts_attch();

  /* Attach enable */

