apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  hw_usb_hset_enb_attche();
}

/****************************************************************************
 * Function Name   : usb_hstd_attch_disable
 * Description     : Disable ATTCH (attach) interrupt of the specified USB
 *                 : port.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_attch_disable(void)
{
  /* ATTCH Clear */

  hw_usb_hclear_sts_attch();

  /* Attach disable */

  hw_usb_hclear_enb_attche();
}

/****************************************************************************
 * Function Name   : usb_hstd_dtch_enable
 * Description     : Enable DTCH (detach) interrupt of the specified USB
 *                 : port.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_dtch_enable(void)
{
  /* DTCH Clear */

  hw_usb_hclear_sts_dtch();

  /* Detach enable */

  hw_usb_hset_enb_dtche();
}

/****************************************************************************
 * Function Name   : usb_hstd_dtch_disable
 * Description     : Disable DTCH (detach) interrupt of the specified USB
 *                 : port.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_dtch_disable(void)
{
  /* DTCH Clear */

  hw_usb_hclear_sts_dtch();

  /* Detach disable */

  hw_usb_hclear_enb_dtche();
}

/****************************************************************************
 * Function Name   : usb_hstd_berne_enable
 * Description     : Enable BRDY/NRDY/BEMP interrupt.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_berne_enable(void)
{
  /* Enable BEMP, NRDY, BRDY */

  hw_usb_set_intenb((RX65N_USB_INTENB0_BEMPE |
  RX65N_USB_INTENB0_NRDYE) |
  RX65N_USB_INTENB0_BRDYE);
}

/****************************************************************************
 * Function Name   : usb_hstd_do_sqtgl
 * Description     : Toggle setting of the toggle-bit for the specified pipe
 *                 : by argument.
 * Arguments       : uint16_t pipe    : Pipe number.
 *                 : uint16_t toggle  : Current toggle status.
 * Return value    : none
 ****************************************************************************/

void usb_hstd_do_sqtgl(uint16_t pipe, uint16_t toggle)
{
  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* Check toggle */

  if (RX65N_USB_DCPCTR_SQMON == (toggle & RX65N_USB_DCPCTR_SQMON))
    {
      /* Do pipe SQSET */

      hw_usb_set_sqset(pipe);
    }
  else
    {
      /* Do pipe SQCLR */

      hw_usb_set_sqclr(pipe);
    }
}

/****************************************************************************
 * Function Name   : usb_hstd_write_data_control_pipe
 * Description     : Request the USB FIFO to write data, and manage the size
 *                 : of written data.
 * Arguments       : uint8_t      buf_add     : Buffer address
 *                 : size_t       buf_size    : Size of the data
 * Return value    : uint16_t end_flag
 ****************************************************************************/

uint16_t usb_hstd_write_data_control_pipe(uint8_t * buf_add,
                                          size_t buf_size)
{
  uint16_t size;
  uint16_t count = 0;
  uint16_t buffer;
  uint16_t mxps;
  uint16_t end_flag;

  buffer = usb_cstd_is_set_frdy(USB_PIPE0,
                                RX65N_USB_USING_CFIFO,
                                RX65N_USB_CFIFOSEL_ISEL);

  /* Check error */

  if (USB_FIFOERROR == buffer)
    {
      /* FIFO access error */

      return USB_FIFOERROR;
    }

  /* Data buffer size */

  size = buf_size;

  /* Max Packet Size */

  mxps = usb_cstd_get_maxpacket_size(USB_PIPE0);

  /* Data size check */

  if (buf_size <= (uint32_t)size)
    {
      count = buf_size;

      /* Data count check */

      if (0 == count)
        {
          end_flag = USB_WRITESHRT;
        }
      else if (0 != (count % mxps))
        {
          /* Short Packet is end of write */

          end_flag = USB_WRITESHRT;
        }
      else
        {
          end_flag = USB_WRITING;
        }
    }
  else
    {
      /* Write continues */

      end_flag = USB_WRITING;
      count = mxps;
    }

  buf_add = usb_hstd_write_fifo(count, USB_CUSE, buf_add);
  g_rx65n_edlist[USB_PIPE0].xfrinfo->xfrd += count;

  /* Check data count to remain */

  /* Check if this affects any of the standard request commands... */

  if (buf_size <= (uint32_t) size)
    {
      /* Clear data count */

      buffer = hw_usb_read_fifoctr(USB_CUSE); /* Read CFIFOCTR */

      /* Check BVAL */

      if (0u == (buffer & USB_BVAL))
        {
          /* Short Packet */

          hw_usb_set_bval(USB_CUSE);
        }
    }

  return end_flag;
}

/****************************************************************************
 * Function Name   : usb_hstd_write_data
 * Description     : Switch PIPE, request the USB FIFO to write data, and
 *                 : manage the size of written data.
 * Arguments       : uint16_t     pipe        : Pipe no.
 *                 : uint16_t     pipemode    : CUSE/D0DMA/D1DMA
 * Return value    : uint16_t end_flag
 ****************************************************************************/

uint16_t usb_hstd_write_data(uint8_t *buf_add, size_t buf_size,
uint16_t pipe, uint16_t pipemode)
{
  uint16_t size;
  uint16_t count = 0;
  uint16_t buffer;
  uint16_t mxps;
  uint16_t end_flag;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_WRITESHRT; /* Error */
    }

  /* Changes FIFO port by the pipe. */

      buffer = usb_cstd_is_set_frdy(pipe, pipemode, USB_FALSE);

  /* Check error */

  if (USB_FIFOERROR == buffer)
    {
      /* FIFO access error */

      return USB_FIFOERROR;
    }

  /* Data buffer size */

  size = usb_cstd_get_buf_size(pipe);

  /* Max Packet Size */

