apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  mxps = usb_cstd_get_maxpacket_size(pipe);

  /* Data size check */

  if (buf_size <= (uint32_t)size)
    {
      count = buf_size;

      /* Data count check */

      if (0 == count)
        {
          end_flag = USB_WRITESHRT;
        }
      else if (0 != (count % mxps))
        {
          /* Short Packet is end of write */

          end_flag = USB_WRITESHRT;
        }
      else
        {
            {
              /* Write continues */

              end_flag = USB_WRITEEND;
            }
        }
    }
  else
    {
      /* Write continues */

      end_flag = USB_WRITING;
      count = mxps;
    }

  buf_add = usb_hstd_write_fifo(count, pipemode, buf_add);
  g_rx65n_edlist[pipe].xfrinfo->xfrd += count;
  g_rx65n_edlist[pipe].xfrinfo->buffer += count;

  /* Check data count to remain */

  if (buf_size <= (uint32_t) size)
    {
      /* Clear data count */

      buffer = hw_usb_read_fifoctr(pipemode); /* Read CFIFOCTR */

      /* Check BVAL */

      if (0u == (buffer & USB_BVAL))
        {
          /* Short Packet */

          hw_usb_set_bval(pipemode);
        }
    }

  return end_flag;
}

/****************************************************************************
 * Function Name   : usb_hstd_receive_start
 * Description     : Start data reception using CPU/DMA transfer to USB
 *                 : Host/USB device.
 * Arguments       : uint16_t     pipe    : Pipe no.
 * Return value    : none
 ****************************************************************************/

void usb_hstd_receive_start(uint8_t *buffer, size_t buflen, uint8_t pipe)
{
  uint32_t length;
  uint16_t mxps;
  uint16_t useport;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* Select NAK */

  usb_cstd_set_nak(pipe);

  /* Ignore count clear */

  hw_usb_clear_status_bemp(pipe); /* BEMP Status Clear */
  hw_usb_clear_sts_brdy(pipe);    /* BRDY Status Clear */
  hw_usb_clear_status_nrdy(pipe); /* NRDY Status Clear */
  nrdy_retries[pipe] = 0;         /* Initialize theh NRDY retries to 0 */
  useport = USB_CUSE;

  /* Changes the FIFO port by the pipe. */

  usb_cstd_chg_curpipe(pipe, useport, USB_FALSE);
  mxps = usb_cstd_get_maxpacket_size(pipe); /* Max Packet Size */

  length = buflen;

  if (0u != length)
    {
      /* Data length check */

      if ((0u == (length % mxps))
        {
          /* Set Transaction counter */

          usb_cstd_set_transaction_counter(pipe, length / mxps);
        }
      else
        {
          /* Set Transaction counter */

          usb_cstd_set_transaction_counter(pipe, length / mxps + 1u));
        }
    }

  usb_cstd_set_buf(pipe); /* Set BUF */

  /* Enable Ready Interrupt */

  hw_usb_set_brdyenb(pipe);

  /* Enable Not Ready Interrupt */

  usb_cstd_nrdy_enable(pipe);
}

/****************************************************************************
 * Function Name   : usb_hstd_send_start
 * Description     : Start data transmission using CPUtransfer to USB host/
 *                 : /device.
 * Arguments       : uint8_t pipe  : Pipe no.
 * Return value    : none
 ****************************************************************************/

void usb_hstd_send_start(uint8_t *buffer, size_t buflen, uint8_t pipe)
{
  uint16_t useport;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  usb_cstd_set_nak(pipe);            /* Select NAK */
  hw_usb_clear_status_bemp(pipe);    /* BEMP Status Clear */
  hw_usb_clear_sts_brdy(pipe);       /* BRDY Status Clear */
  hw_usb_clear_status_nrdy(pipe);    /* NRDY Status Clear */
  nrdy_retries[pipe] = 0;            /* Initialize theh NRDY retries to 0 */

  /* Pipe number to FIFO port select */

  useport = USB_CUSE;

  /* Changes the FIFO port by the pipe. */

  usb_cstd_chg_curpipe(pipe, useport, USB_FALSE);

  /* Buffer to FIFO data write */

  usb_hstd_buf_to_fifo(buffer, buflen, pipe, useport);
  usb_cstd_set_buf(pipe); /* Set BUF */
}

/****************************************************************************
 * Function Name   : usb_hstd_get_pipe_no
 * Description     : Get PIPE No.
 * Arguments       : uint8_t  type   : Transfer Type.(USB_EP_BULK/USB_EP_INT)
 *                 : uint8_t  dir    : (USB_PIPE_DIR_IN/USB_PIPE_DIR_OUT)
 * Return value    : Pipe no (USB_PIPE1->USB_PIPE9:OK, USB_NULL:Error)
 ****************************************************************************/

uint8_t usb_hstd_get_pipe_no(uint8_t type, uint8_t dir)
{
  uint8_t     pipe_no = USB_NULL;
  uint16_t    pipe;

  if (USB_EP_BULK == type)
    {
      /* BULK PIPE Loop */

      /* WAIT_LOOP */

      if (dir == USB_EP_IN)
        {
          pipe = USB_BULK_PIPE_START;
        }
      else
        {
          pipe = USB_BULK_PIPE_START + 1;
        }

      for (; pipe < (USB_BULK_PIPE_END + 1); pipe = pipe + 2)
        {
          if (USB_FALSE == g_usb_pipe_table[pipe].use_flag)
            {
              /* Check Free pipe */

              pipe_no = pipe; /* Set Free pipe */
              break;
            }
        }
    }

  if (USB_EP_INT == type)
    {
      /* Interrupt PIPE Loop */

      /* WAIT_LOOP */

      for (pipe = USB_INT_PIPE_START; pipe < (USB_INT_PIPE_END +1); pipe++)
        {
          if (USB_FALSE == g_usb_pipe_table[pipe].use_flag)
            {
              /* Check Free pipe */

              pipe_no = pipe; /* Set Free pipe */
              break;
            }
        }
    }

  return pipe_no;
}

/****************************************************************************
 * Function Name   : usb_hstd_read_data_control_pipe
 * Description     : Request to read data from USB FIFO, and manage the size
 *                 : of the data read.
 * Arguments       : None
 * Return value    : USB_READING / USB_READEND / USB_READSHRT / USB_READOVER
 ****************************************************************************/

uint16_t usb_hstd_read_data_control_pipe(void)
{
  uint16_t count;
  uint16_t buffer;
  uint16_t mxps;
  uint16_t dtln;
  uint16_t end_flag;

  /* Changes FIFO port by the pipe. */

  buffer = usb_cstd_is_set_frdy(USB_PIPE0, USB_CUSE, USB_FALSE);

