apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  if (USB_FIFOERROR == buffer)
    {
      /* FIFO access error */

      return USB_FIFOERROR;
      syslog(LOG_INFO, "FIFO ERROR");
    }

  dtln = buffer & RX65N_USB_FIFOCTR_DTLN;

  /* Max Packet Size */

  mxps = usb_cstd_get_maxpacket_size(USB_PIPE0);

  /* now calculate the count */

  count = g_rx65n_tdlist[USB_PIPE0].ed->xfrinfo->buflen -
  g_rx65n_tdlist[USB_PIPE0].ed->xfrinfo->xfrd;

  if (count < dtln)
    {
      /* Buffer Over ? */

      end_flag = USB_READOVER;
      usb_cstd_set_nak(USB_PIPE0); /* Set NAK */
      count = g_rx65n_tdlist[USB_PIPE0].ed->xfrinfo->xfrd;
      g_rx65n_tdlist[USB_PIPE0].ed->xfrinfo->xfrd = dtln;
    }

  else if (count == dtln)
    {
      /* Just Receive Size */

      count = dtln;
      end_flag = USB_READEND;
      usb_cstd_set_nak(USB_PIPE0); /* Set NAK */
    }
  else
    {
      /* Continuous Receive data */

      count = dtln;

      end_flag = USB_READING;
      if ((0 == count) || (0 != (count % mxps)))
        {
          /* Null Packet receive */

          end_flag = USB_READSHRT;
          usb_cstd_set_nak(USB_PIPE0); /* Select NAK */
        }
    }

  if (0 == dtln)
    {
      /* 0 length packet */

      /* Clear BVAL */

      hw_usb_set_bclr(USB_CUSE);
    }
  else
    {
      g_rx65n_tdlist[USB_PIPE0].ed->xfrinfo->buffer = usb_hstd_read_fifo(
          count, USB_CUSE, g_rx65n_tdlist[USB_PIPE0].ed->xfrinfo->buffer);
    }

  g_rx65n_tdlist[USB_PIPE0].ed->xfrinfo->xfrd += count;

  return end_flag;
}

/****************************************************************************
 * Function Name   : usb_hstd_read_data
 * Description     : Request to read data from USB FIFO, and manage the size
 *                 : of the data read.
 * Arguments       : uint16_t     pipe     : Pipe no.
 *                 : uint16_t     pipemode : Pipe mode (CFIFO/D0FIFO/D1FIFO)
 * Return value    : USB_READING / USB_READEND / USB_READSHRT / USB_READOVER
 ****************************************************************************/

uint16_t usb_hstd_read_data(uint16_t pipe, uint16_t pipemode)
{
  uint16_t count;
  uint16_t buffer;
  uint16_t mxps;
  uint16_t dtln;
  uint16_t end_flag = 0;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_ERROR; /* Error */
    }

  if (pipe != 0) /* Data transfer for non CTRL pipe */
    {
      buffer = usb_cstd_is_set_frdy(pipe, pipemode, USB_FALSE);

      if (USB_FIFOERROR == buffer)
        {
          return USB_FIFOERROR;
        }

      dtln = buffer & RX65N_USB_FIFOCTR_DTLN;
      mxps = usb_cstd_get_maxpacket_size(pipe);

      /* now calculate the count */

  if (pipe == g_kbdpipe)
    {
      /* For HID KBD read the received data */

      count = dtln;
    }
  else
    {
      count = g_rx65n_edlist[pipe].xfrinfo->buflen -
      g_rx65n_edlist[pipe].xfrinfo->xfrd;
    }

  if (count < dtln)
    {
      /* Buffer Over ? */

      count = dtln;
      end_flag = USB_READOVER;
    }

  else if (count == dtln)
    {
      /* Just Receive Size */

      count = dtln;
      end_flag = USB_READEND;
      usb_cstd_set_nak(pipe);
    }
  else
    {
      /* Continuous Receive data */

      count = dtln;

      end_flag = USB_READING;
      if ((0 == count) || (0 != (count % mxps)))
        {
          /* Null Packet receive */

          end_flag = USB_READSHRT;
        }
    }

  usb_hstd_read_fifo(count,
                     pipemode, g_rx65n_edlist[pipe].xfrinfo->buffer);

  g_rx65n_edlist[pipe].xfrinfo->xfrd += count;

  if (pipe == g_kbdpipe)
    {
      /* For HID KBD read pointer should not be incremented */
    }
  else
    {
      g_rx65n_edlist[pipe].xfrinfo->buffer += count;
    }
    }

  return end_flag;
}

/****************************************************************************
 * Function Name   : usb_hstd_data_end
 * Description     : Set USB registers as appropriate after data
 *                 : transmission/reception, and call the callback function
 *                 : as transmission/reception is complete.
 * Arguments       : uint16_t     pipe    : Pipe no.
 *                 : uint16_t     status  : Transfer status type.
 * Return value    : none
 ****************************************************************************/

void usb_hstd_data_end(uint16_t pipe, uint16_t status)
{
  if (USB_MAX_PIPE_NO < pipe)
    {
        return; /* Error */
    }

  /* PID = NAK */

  /* Set NAK */

  usb_cstd_set_nak(pipe);

  /* Disable Interrupt */

  /* Disable Ready Interrupt */

  hw_usb_clear_brdyenb(pipe);

  /* Disable Not Ready Interrupt */

  hw_usb_clear_nrdyenb(pipe);

  /* Disable Empty Interrupt */

  hw_usb_clear_bempenb(pipe);

  /* Disable Transaction count */

  usb_cstd_clr_transaction_counter(pipe);
}

/****************************************************************************
 * Function Name   : usb_hstd_buf_to_fifo
 * Description     : Set USB registers as required to write from data buffer
 *                 : to USBFIFO, to have USB FIFO to write data to bus.
 * Arguments       : uint16_t pipe     : Pipe no.
 *                 : uint16_t useport  : Port no.
 * Return value    : none
 ****************************************************************************/

void usb_hstd_buf_to_fifo(uint8_t *buffer, size_t buflen, uint16_t pipe,
                          uint16_t useport)
{
  uint16_t end_flag;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* Disable Ready and empty Interrupt */

  hw_usb_clear_brdyenb(pipe);
  hw_usb_clear_bempenb(pipe);

  end_flag = usb_hstd_write_data(buffer, buflen, pipe, useport);

  switch (end_flag)
    {
      case USB_WRITING:

      /* Enable Ready Interrupt */

      hw_usb_set_brdyenb(pipe);

      /* Enable Not Ready Interrupt */

      usb_cstd_nrdy_enable(pipe);

      break;

      case USB_WRITEEND:

      /* End of data write */

      /* continue */

      case USB_WRITESHRT:

      /* End of data write */

      /* Enable Empty Interrupt */

      hw_usb_set_bempenb(pipe);

      /* Enable Not Ready Interrupt */

      usb_cstd_nrdy_enable(pipe);

      break;

