apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
      case USB_FIFOERROR:

      /* FIFO access error */

      syslog(LOG_INFO, "### FIFO access error\n");
      usb_hstd_forced_termination(pipe, USB_DATA_ERR);
      break;

      default:
      usb_hstd_forced_termination(pipe, USB_DATA_ERR);
      break;
    }
}

/****************************************************************************
 * Function Name   : usb_hstd_brdy_pipe_process
 * Description     : Search for the PIPE No. that BRDY interrupt occurred,
 *                 : and request data transmission/reception from the PIPE
 * Arguments       : uint16_t     bitsts  : BRDYSTS Register & BRDYENB
 *                 : Register
 * Return value    : none
 ****************************************************************************/

void usb_hstd_brdy_pipe_process(uint16_t bitsts)
{
  uint16_t i;
  uint16_t end_flag;
  size_t data_len;
  uint8_t *data_address;
  uint16_t buffer;
#ifdef CONFIG_USBHOST_ASYNCH
  struct rx65n_usbhost_s *priv = &g_usbhost;
#endif

  for (i = USB_MIN_PIPE_NO; i <= USB_MAX_PIPE_NO; i++)
    {
      if (0 != (bitsts & USB_BITSET(i)))
        {
          /* Clear the Interrupt status bit - clear for both BEMP and BRDY */

          hw_usb_clear_sts_brdy(i);
          hw_usb_clear_status_bemp(i);
          if (RX65N_USB_PIPECFG_DIR == usb_cstd_get_pipe_dir(i))
            {
              /* Buffer to FIFO data write */

              data_len = g_rx65n_edlist[i].xfrinfo->buflen -
                         g_rx65n_edlist[i].xfrinfo->xfrd;
              buffer = usb_cstd_get_pid(i);

              /* MAX packet size error ? */

              if (RX65N_USB_DCPCTR_PIDSTALL == (buffer &
                  RX65N_USB_DCPCTR_PIDSTALL))
                {
                  syslog(LOG_INFO, "### STALL Pipe %d\n", i);
                  usb_hstd_forced_termination(i, USB_DATA_STALL);
                }
              else
                {
                  if (data_len == 0)
                    {
                      syslog(LOG_INFO, "BRDY can NOT be with 0 len\
                             data for pipe\n", i);
                    }

                  /* If still data is present - let the data
                   * transfer continue
                   *
                   */

                  else
                    {
                      data_address = g_rx65n_edlist[i].xfrinfo->buffer;
                      usb_hstd_buf_to_fifo(data_address, data_len, i,
                                           USB_CUSE);
                      usb_cstd_set_buf(i); /* Set BUF */
                    }
                }
            }
          else
            {
              /* FIFO to Buffer data read */

              end_flag = usb_hstd_read_data(i, USB_CUSE);

              if (end_flag != USB_READING)
                {
#ifdef CONFIG_USBHOST_ASYNCH
      if ((i == g_kbdpipe) &&
         (NULL == g_rx65n_edlist[i].xfrinfo->callback))
#else
      if (i == g_kbdpipe)
#endif
                    {
                      usb_cstd_clr_stall(i);
                    }

                  else
                    {
                      usb_hstd_data_end(i, USB_DATA_OK);
                      g_rx65n_edlist[i].xfrinfo->tdstatus =
                      TD_CC_NOERROR;

#ifdef CONFIG_USBHOST_ASYNCH
                      if ((g_rx65n_edlist[i].xfrinfo != 0)
                          && (g_rx65n_edlist[i].xfrinfo->callback))
                        {
                          hw_usb_write_dcpmxps(USB_DEFPACKET + USB_DEVICE_1);
                          rx65n_usbhost_asynch_completion(priv,
                          &g_rx65n_edlist[i]);
                        }

#endif
                    }

                  nxsem_post(&g_rx65n_edlist[i].wdhsem);
                }
            }
        }
    }
}

/****************************************************************************
 * Function Name   : usb_hstd_nrdy_pipe_process
 * Description     : Search for PIPE No. that occurred NRDY interrupt, and
 *                 : execute the process for PIPE when NRDY interrupt
 *                 : occurred
 * Arguments       : uint16_t  bitsts  : NRDYSTS Register & NRDYENB Register
 * Return value    : none
 ****************************************************************************/

void usb_hstd_nrdy_pipe_process(uint16_t bitsts)
{
  uint16_t i;

  /* WAIT_LOOP */

  for (i = USB_MIN_PIPE_NO; i <= USB_MAX_PIPE_NO; i++)
    {
      if (0 != (bitsts & USB_BITSET(i)))
        {
          hw_usb_clear_status_nrdy(i);
          usb_hstd_nrdy_endprocess(i);
        }
    }
}

/****************************************************************************
 * Function Name   : usb_hstd_bemp_pipe_process
 * Description     : Search for PIPE No. that BEMP interrupt occurred, and
 *                                 : complete data transmission for the PIPE
 * Arguments       : uint16_t bitsts  : BEMPSTS Register & BEMPENB Register
 * Return value    : none
 ****************************************************************************/

void usb_hstd_bemp_pipe_process(uint16_t bitsts)
{
  uint16_t buffer;
  uint16_t i;
  size_t data_len;

  /* WAIT_LOOP */

  for (i = USB_MIN_PIPE_NO; i <= USB_PIPE5; i++)
    {
      if (0 != (bitsts & USB_BITSET(i)))
        {
          /* Clear the Interrupt status bit */

          hw_usb_clear_status_bemp(i);
          hw_usb_clear_sts_brdy(i);

         data_len = g_rx65n_edlist[i].xfrinfo->buflen -
                     g_rx65n_edlist[i].xfrinfo->xfrd;
          buffer = usb_cstd_get_pid(i);

          /* MAX packet size error ? */

          if (RX65N_USB_DCPCTR_PIDSTALL == (buffer &
              RX65N_USB_DCPCTR_PIDSTALL))
            {
              syslog(LOG_INFO, "### STALL Pipe %d\n", i);
              usb_hstd_forced_termination(i, USB_DATA_STALL);
            }
          else
            {
              if (data_len == 0)
                {
                  usb_hstd_data_end(i, USB_DATA_OK);
                  g_rx65n_edlist[i].xfrinfo->tdstatus = TD_CC_NOERROR;

                  /* Release the semaphore for this pipe */

