apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
                 nxsem_post(&g_rx65n_edlist[i].wdhsem);
                }

              else
                {
                  syslog(LOG_INFO,
                         "BEMP can NOT be with %d len data for pipe\n",
                         data_len, i);
                }
            }
        }
    }
}

/****************************************************************************
 * Function Name   : usb_hstd_get_pipe_peri_value
 * Description     : Get value to be set in PIPEPERI
 * Arguments       : uint8_t   binterval : bInterval for ENDPOINT Descriptor
 * Return value    : Value for set PIPEPERI
 ****************************************************************************/

uint16_t usb_hstd_get_pipe_peri_value(uint8_t binterval)
{
  uint16_t    pipe_peri = USB_NULL;
  uint16_t    work1;
  uint16_t    work2;

  /* Set interval counter */

  if (0 != binterval)
    {
      /* FS/LS interrupt */

      /* The time of the FS/LS interrupt forwarding of the interval is
       * specified by the unit of ms. It is necessary to calculate to
       * specify USB-IP by the n-th power of two. NAK rate of the control
       * and the bulk transfer doesn't correspond.
           */

      work1 = binterval;
      work2 = 0;
      for (; work1 != 0; work2++ )
        {
          work1 >>= 1;
        }

      if (0 != work2)
        {
          /* Interval time */

          pipe_peri |= (work2 - 1);
        }
    }

  return pipe_peri;
}

/****************************************************************************
 * Function Name   : usb_hstd_chk_attach
 * Description     : Checks whether USB Device is attached or not and return
 *                 : USB speed of USB Device
 * Arguments       : none
 * Return value    : uint16_t   : connection status
 *                 :            : (USB_ATTACHF/USB_ATTACHL/USB_DETACH/USB_OK)
 * Note            : Please change for your SYSTEM
 ****************************************************************************/

uint16_t usb_hstd_chk_attach(void)
{
  uint16_t buf[3];
  usb_hstd_read_lnst(buf);

  if (0 == (buf[1] & RX65N_USB_DVSTCTR0_RHST))
    {
      if (RX65N_USB_SYSSTS0_LNST_FS_JSTS == (buf[0] & 3))
        {
          /* High/Full speed device */

          return USB_ATTACHF;
        }
      else if (RX65N_USB_SYSSTS0_LNST_LS_JSTS == (buf[0] & 3))
        {
          /* Low speed device */

          return USB_ATTACHL;
        }
      else if (RX65N_USB_SYSSTS0_LNST_SE0 == (buf[0] & 3))
        {
          syslog(LOG_INFO, "Debug: Detach device\n");
        }
      else
        {
          syslog(LOG_INFO, "Attach unknown speed device\n");
        }
    }
  else
    {
      syslog(LOG_INFO, "Already device attached\n");
      return 0;
    }

  return USB_DETACH;
}

/****************************************************************************
 * Function Name   : usb_hstd_chk_clk
 * Description     : Checks SOF sending setting when USB Device is detached
 *                 : or suspended , BCHG interrupt enable setting and
 *: clock stop processing
 * Arguments       : uint16_t event    : device state
 * Return value    : none
 ****************************************************************************/

void usb_hstd_chk_clk(uint16_t event)
{
  if ((USB_DETACH == event) || (USB_SUSPEND == event))
    {
      usb_hstd_chk_sof();

      /* Enable port BCHG interrupt */

      usb_hstd_bchg_enable();
    }
}

/****************************************************************************
 * Function Name   : usb_hstd_detach_process
 * Description     : Handles the require processing when USB device is
 *                 : detached (Data transfer forcibly termination processing
 *: to the connected USB Device, the clock supply stop setting and
 *: the USB interrupt disable setting etc)
 * Arguments       : none
 * Return value    : Device speed
 ****************************************************************************/

uint16_t usb_hstd_detach_process(void)
{
  uint16_t connect_inf;
  uint16_t i;

  /* ATTCH interrupt disable */

  usb_hstd_attch_disable();

  /* DTCH  interrupt disable */

  usb_hstd_dtch_disable();
  usb_hstd_bchg_disable();

  /* Check if control pipe in use */

  if (RX65N_USB_PIPECTR_PIDBUF == usb_cstd_get_pid(USB_PIPE0))
    {
      /* End of data transfer (IN/OUT) */

      usb_hstd_forced_termination(USB_PIPE0, USB_DATA_STOP);
    }

  usb_cstd_clr_pipe_cnfg(USB_PIPE0);

  /* WAIT_LOOP */

  for (i = USB_MIN_PIPE_NO; i <= USB_MAX_PIPE_NO; i++)
    {
      /* Not control transfer */

      /* Is this pipe used */

      if (g_usb_pipe_table[i].use_flag == USB_TRUE)
        {
          /* PID=BUF ? */

          if (RX65N_USB_PIPECTR_PIDBUF == usb_cstd_get_pid(i))
            {
              /* End of data transfer (IN/OUT) */

              usb_hstd_forced_termination(i, USB_DATA_STOP);
            }

          usb_cstd_clr_pipe_cnfg(i);
        }
    }

  /* Decide USB Line state (ATTACH) */

  connect_inf = usb_hstd_chk_attach();
  switch (connect_inf)
    {
      case USB_ATTACHL:
      usb_hstd_attach(connect_inf);
      break;

      case USB_ATTACHF:
      usb_hstd_attach(connect_inf);
      break;

      case USB_DETACH:

      /* USB detach */

      usb_hstd_detach();

      /* Check clock */

      usb_hstd_chk_clk(USB_DETACH);
      break;

      default:

      /* USB detach */

      usb_hstd_detach();

      /* Check clock */

      usb_hstd_chk_clk(USB_DETACH);
      break;
    }

  return connect_inf;
}

/****************************************************************************
 * Function Name   : usb_hstd_read_lnst
 * Description     : Reads LNST register two times, checks whether these
 *                 : values are equal and returns the value of DVSTCTR
 *                 : register that correspond to the port specified by 2nd
 *                 : argument.
 * Arguments       : uint16_t *buf : Pointer to the buffer to store DVSTCTR
 *                                 : register
 * Return value    : none
 * Note            : Please change for your SYSTEM
 ****************************************************************************/

void usb_hstd_read_lnst(uint16_t *buf)
{
  /* WAIT_LOOP */

  if (g_attached)
    {
      do
        {
          buf[0] = hw_usb_read_syssts();

