apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
          /* 30ms wait */

          up_mdelay(30);
          buf[1] = hw_usb_read_syssts();
          if ((buf[0] & RX65N_USB_SYSSTS0_LNST) ==
          (buf[1] & RX65N_USB_SYSSTS0_LNST))
            {
              /* 20ms wait */

              up_mdelay(20);
              buf[1] = hw_usb_read_syssts();
            }
        }
      while (((buf[0] & RX65N_USB_SYSSTS0_LNST) !=
            (buf[1] & RX65N_USB_SYSSTS0_LNST)) || (((buf[0] & 3) == 0)));
  buf[1] = hw_usb_read_dvstctr();
    }

  if (g_detached)
    {
      do
        {
          buf[0] = hw_usb_read_syssts();

          /* 30ms wait */

          up_mdelay(30);
          buf[1] = hw_usb_read_syssts();
          if ((buf[0] & RX65N_USB_SYSSTS0_LNST) ==
             (buf[1] & RX65N_USB_SYSSTS0_LNST))
            {
              /* 20ms wait */

              up_mdelay(20);
              buf[1] = hw_usb_read_syssts();
            }
        }
      while (((buf[0] & RX65N_USB_SYSSTS0_LNST) !=
            (buf[1] & RX65N_USB_SYSSTS0_LNST)));
  buf[1] = hw_usb_read_dvstctr();
    }
}

/****************************************************************************
 * Function Name   : usb_hstd_attach_process
 * Description     : Interrupt disable setting when USB Device is attached
 *                 : handles the required interrupt disable setting etc when
 *                 : USB device is attached.
 * Arguments       : none
 * Return value    : Speed of the device
 * Note            : Please change for your SYSTEM
 ****************************************************************************/

uint16_t usb_hstd_attach_process(void)
{
  uint16_t connect_inf;

  /* ATTCH interrupt disable */

  usb_hstd_attch_disable();

  /* DTCH  interrupt disable */

  usb_hstd_dtch_disable();
  usb_hstd_bchg_disable();

  /* Decide USB Line state (ATTACH) */

  connect_inf = usb_hstd_chk_attach();
  switch (connect_inf)
    {
      case USB_ATTACHL:
      usb_hstd_attach(connect_inf);
      break;

      case USB_ATTACHF:
      usb_hstd_attach(connect_inf);
      break;

      case USB_DETACH:

      /* USB detach */

      usb_hstd_detach();

      /* Check clock */

      usb_hstd_chk_clk(USB_DETACH);
      break;

      default:
      usb_hstd_attach(USB_ATTACHF);
      break;
    }

  return connect_inf;
}

/****************************************************************************
 * Function Name   : usb_hstd_chk_sof
 * Description     : Checks whether SOF is sended or not
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_chk_sof(void)
{
  up_mdelay(1);
}

/****************************************************************************
 * Function Name   : usb_hstd_bus_reset
 * Description     : Setting USB register when BUS Reset
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_bus_reset(void)
{
  uint16_t buf;
  uint16_t i;

  /* USBRST=1, UACT=0 */

  hw_usb_rmw_dvstctr(RX65N_USB_DVSTCTR0_USBRST,
  (RX65N_USB_DVSTCTR0_USBRST | RX65N_USB_DVSTCTR0_UACT));

  /* Wait 50ms */

  up_mdelay(50); /* usb_cpu_delay_xms(50); */

  /* USBRST=0, RESUME=0, UACT=1 */

  usb_hstd_set_uact();

  /* Wait 10ms or more (USB reset recovery) */

  up_mdelay(20); /* usb_cpu_delay_xms(20); */

  /* WAIT_LOOP */

  /* If DVSTCTR0 last 3 bits i.e. RHST bit fields are 1xx.
   * Then the USB reset is still in progress
   */

  for (i = 0, buf = 0x04; (i < 3) && (0x04 == buf); ++i)
    {
      /* DeviceStateControlRegister - ResetHandshakeStatusCheck */

      buf = hw_usb_read_dvstctr() & RX65N_USB_DVSTCTR0_RHST;
      if (0x04 == buf)
        {
          /* Wait */

          up_mdelay(10);
        }
    }

  /* 30ms wait */

  up_mdelay(30);
}

/****************************************************************************
 * Function Name   : usb_hstd_write_fifo
 * Description     : Write specified amount of data to specified USB FIFO.
 * Arguments       : uint16_t count      : Write size
 *                 : uint16_t pipemode   : The mode of CPU/DMA(D0)/DMA(D1).
 *                 : uint16_t *write_p   : Address of buffer of data to write
 * Return value    : The incremented address of last argument (write_p).
 ****************************************************************************/

uint8_t *usb_hstd_write_fifo(uint16_t count, uint16_t pipemode,
  uint8_t *write_p)
{
  uint16_t even;
    {
      /* WAIT_LOOP */

      for (even = count >> 1; 0 != even; --even)
        {
          /* 16bit access */

          hw_usb_write_fifo16(pipemode, *((uint16_t *)write_p));

          /* Renewal write pointer */

          write_p += sizeof(uint16_t);
        }

      if ((count & 0x0001u) != 0u)
        {
          /* count == odd */

          /* Change FIFO access width */

          hw_usb_set_mbw(pipemode, USB_MBW_8);

          /* FIFO write */

          hw_usb_write_fifo8(pipemode, *write_p);

          /* Return FIFO access width */

          hw_usb_set_mbw(pipemode, USB_MBW_16);

          /* Renewal write pointer */

          write_p++;
        }
    }

  return write_p;
}

/****************************************************************************
 * Function Name   : usb_hstd_read_fifo
 * Description     : Read specified buffer size from the USB FIFO.
 * Arguments       : uint16_t count   :Read size
 *                 : uint16_t pipemode:The mode of CPU/DMA(D0)/DMA(D1).
 *                 : uint16_t *read_p :Address of buffer to store the read
 *                 : data
 * Return value    : Pointer to a buffer that contains the data to be read
 *                 : next.
 ****************************************************************************/

uint8_t *usb_hstd_read_fifo(uint16_t count, uint16_t pipemode,
  uint8_t *read_p)
{
  uint16_t even;
  uint32_t odd_byte_data_temp;

  /* WAIT_LOOP */

  for (even = count >> 1; 0 != even; --even)
    {
      /* 16bit FIFO access */

