apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
      *(uint16_t *)read_p = hw_usb_read_fifo16(pipemode);

      /* Renewal read pointer */

      read_p += sizeof(uint16_t);
    }

  if ((count & 0x0001) != 0)
    {
      /* 16bit FIFO access */

      odd_byte_data_temp = hw_usb_read_fifo16(pipemode);

      /* Condition compilation by the difference of the little endian */

      *read_p = (uint8_t) (odd_byte_data_temp & 0x00ff);

      /* Renewal read pointer */

      read_p += sizeof(uint8_t);
    }

  return read_p;
}

/****************************************************************************
 * Function Name   : usb_hstd_forced_termination
 * Description     : Terminate data transmission and reception.
 * Arguments       : uint16_t     pipe    : Pipe Number
 *                 : uint16_t     status  : Transfer status type
 * Return value    : none
 * Note            : In the case of timeout status, it does not call
 *                 : back.
 ****************************************************************************/

void usb_hstd_forced_termination(uint16_t pipe, uint16_t status)
{
  uint16_t buffer;

  /* PID = NAK */

  /* Set NAK */

  usb_cstd_set_nak(pipe);

  /* Disable Ready Interrupt */

  hw_usb_clear_brdyenb(pipe);

  /* Disable Not Ready Interrupt */

  hw_usb_clear_nrdyenb(pipe);

  /* Disable Empty Interrupt */

  hw_usb_clear_bempenb(pipe);

  usb_cstd_clr_transaction_counter(pipe);

  /* Clear CFIFO-port */

  buffer = hw_usb_read_fifosel(USB_CUSE);
  if ((buffer & USB_CURPIPE) == pipe)
    {
      /* Changes the FIFO port by the pipe. */

      usb_cstd_chg_curpipe(USB_PIPE0, USB_CUSE, USB_FALSE);
    }

#ifdef DMA_DTC_NOT_ENABLED
#if ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE))

  /* Clear D0FIFO-port */

  buffer = hw_usb_read_fifosel(ptr, USB_D0USE);
  if ((buffer & USB_CURPIPE) == pipe)
    {
      /* Changes the FIFO port by the pipe. */

      usb_cstd_chg_curpipe(ptr, USB_PIPE0, USB_D0USE, USB_FALSE);
    }

  /* Clear D1FIFO-port */

  buffer = hw_usb_read_fifosel(ptr, USB_D1USE);
  if ((buffer & USB_CURPIPE) == pipe)
    {
      /* Changes the FIFO port by the pipe. */

      usb_cstd_chg_curpipe(ptr, USB_PIPE0, USB_D1USE, USB_FALSE);
    }

#endif /* ((USB_CFG_DTC==USB_CFG_ENABLE)||(USB_CFG_DMA==USB_CFG_ENABLE)) */
#endif /* DMA_DTC_NOT_ENABLED */

  /* Do Aclr */

  usb_cstd_do_aclrm(pipe);
}

/****************************************************************************
 * Function Name   : usb_hstd_nrdy_endprocess
 * Description     : NRDY interrupt processing. (Forced termination of
 *                 : data transmission and reception of specified pipe.)
 * Arguments       : uint16_t     pipe        : Pipe No
 * Return value    : none
 * Note            : none
 ****************************************************************************/

void usb_hstd_nrdy_endprocess(uint16_t pipe)
{
  uint16_t buffer;

  /* Host Function */

  hw_usb_write_pipesel(pipe);      /* Select the pipe */
  buffer = usb_cstd_get_pid(pipe); /* Read the PID of selected pipe */
  usb_cstd_set_nak(pipe);          /* Set PIPE to NAK. Stop sending tokens. */

  /* STALL ? */

  if (RX65N_USB_DCPCTR_PIDSTALL == (buffer & RX65N_USB_DCPCTR_PIDSTALL))
    {
      usb_hstd_forced_termination(pipe, USB_DATA_STALL);
    }
  else
    {
      /* Wait for About 60ns */

      buffer = hw_usb_read_syssts();

      if (nrdy_retries[pipe] >= 1)
        {
          /* Data Device Ignore X 3 call back */

          /* End of data transfer */

          usb_hstd_forced_termination(pipe, USB_DATA_TMO);

          g_rx65n_edlist[pipe].xfrinfo->tdstatus = TD_CC_DEVNOTRESPONDING;

          /* Release the semaphore for this pipe */

          nxsem_post(&g_rx65n_edlist[pipe].wdhsem);
        }
      else
        {
          nrdy_retries[pipe]++; /* Increment and note error count */

          /* 5ms wait */

          up_mdelay(1);

          /* PIPEx Data Retry */

          usb_hstd_data_end(pipe, USB_DATA_TMO);
          hw_usb_set_bclr(USB_CUSE); /* Clear Buffer on CPU side */
          g_rx65n_edlist[pipe].xfrinfo->tdstatus = TD_CC_DEVNOTRESPONDING;

          /* 5ms wait */

          usb_cstd_pipe_init(pipe);

          /* Release the semaphore for this pipe */

          nxsem_post(&g_rx65n_edlist[pipe].wdhsem);
        }
    }
}

/****************************************************************************
 * Function Name   : usb_hstd_bus_int_disable
 * Description     : Disable USB Bus Interrupts OVRCR, ATTCH, DTCH, and BCHG.
 * Arguments       : none
 * Return          : none
 ****************************************************************************/

void usb_hstd_bus_int_disable(void)
{
  /* ATTCH interrupt disable */

  usb_hstd_attch_disable();

  /* DTCH     interrupt disable */

  usb_hstd_dtch_disable();

  /* BCHG     interrupt disable */

  usb_hstd_bchg_disable();
}

/****************************************************************************
 * Function Name   : usb_hstd_attach
 * Description     : Set USB registers as required when USB device is
 *                 : attached, and notify MGR (manager) task that attach
 *                 : event occurred.
 * Arguments       : uint16_t     result  : Result.
 * Return value    : none
 ****************************************************************************/

void usb_hstd_attach(uint16_t result)
{
  /* DTCH  interrupt enable */

  usb_hstd_dtch_enable();

  /* Interrupt Enable */

  usb_hstd_berne_enable();

  usb_hstd_bus_reset();
}

/****************************************************************************
 * Function Name   : usb_hstd_detach
 * Description     : Set USB register as required when USB device is detached
 *                 : and notify MGR (manager) task that detach occurred.
 * Arguments       : none
 * Return value    : none
 ****************************************************************************/

void usb_hstd_detach(void)
{
  /* DVSTCTR clear */

  hw_usb_clear_dvstctr(RX65N_USB_DVSTCTR0_RWUPE |
                       RX65N_USB_DVSTCTR0_USBRST |
                       RX65N_USB_DVSTCTR0_RESUME |
                       RX65N_USB_DVSTCTR0_UACT);

  /* ATTCH interrupt enable */

  usb_hstd_attch_enable();
}

/****************************************************************************
 * Function Name   : usb_cstd_get_buf_size
 * Description     : Return buffer size, or max packet size, of specified
 *                 : pipe.
 * Arguments       : uint16_t pipe     : Pipe number.
 * Return value    : uint16_t          : FIFO buffer size or max packet size.
 ****************************************************************************/

