apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
static uint16_t usb_cstd_get_buf_size(uint16_t pipe)
{
  uint16_t size = 0;
  uint16_t buffer;

  if (USB_PIPE0 == pipe)
    {
      /* Not continuation transmit */

      buffer = hw_usb_read_dcpmaxp();

      /* Max Packet Size */

      size = buffer & RX65N_USB_DCPMAXP_MXPS_MASK;
    }
  else
    {
      /* Pipe select */

      hw_usb_write_pipesel(pipe);

      /* Read the maximum packet size of selected pipe */

      buffer = hw_usb_read_pipemaxp();

      /* Max Packet Size */

      size = buffer & RX65N_USB_PIPEMAXP_MXPSMASK;
    }

  return size;
}

/****************************************************************************
 * Function Name   : usb_cstd_pipe_init
 * Description     : Initialization of registers associated with specified
 *                 : pipe.
 * Arguments       : uint16_t pipe     : Pipe Number
 * Return value    : none
 ****************************************************************************/

static void usb_cstd_pipe_init(uint16_t pipe)
{
  /* Interrupt Disable */

  /* Ready         Int Disable */

  hw_usb_clear_brdyenb(pipe);

  /* NotReady      Int Disable */

  hw_usb_clear_nrdyenb(pipe);

  /* Empty/SizeErr Int Disable */

  hw_usb_clear_bempenb(pipe);

  /* PID=NAK & clear STALL */

  usb_cstd_clr_stall(pipe);

  /* PIPE Configuration */

  hw_usb_write_pipesel(pipe);

  rx65n_usbhost_putreg(pipe, RX65N_USB_PIPESEL);
  rx65n_usbhost_putreg(g_usb_pipe_table[pipe].pipe_cfg,
  RX65N_USB_PIPECFG);
  rx65n_usbhost_putreg(g_usb_pipe_table[pipe].pipe_maxp,
  RX65N_USB_PIPEMAXP);
  rx65n_usbhost_putreg(g_usb_pipe_table[pipe].pipe_peri,
  RX65N_USB_PIPEPERI);

  /* FIFO buffer DATA-PID initialized */

  hw_usb_write_pipesel(USB_PIPE0);

  /* SQCLR */

  hw_usb_set_sqclr(pipe);

  /* ACLRM */

  usb_cstd_do_aclrm(pipe);

  /* Interrupt status clear */

  /* Ready         Int Clear */

  hw_usb_clear_sts_brdy(pipe);

  /* NotReady      Int Clear */

  hw_usb_clear_status_nrdy(pipe);

  /* Empty/SizeErr Int Clear */

  hw_usb_clear_status_bemp(pipe);
}

/****************************************************************************
 * Function Name   : usb_cstd_clr_pipe_cnfg
 * Description     : Clear specified pipe configuration register.
 * Arguments       : uint16_t pipe_no  : pipe number
 * Return value    : none
 ****************************************************************************/

static void usb_cstd_clr_pipe_cnfg(uint16_t pipe_no)
{
  /* PID=NAK & clear STALL */

  usb_cstd_clr_stall(pipe_no);

  /* Interrupt disable */

  /* Ready         Int Disable */

  hw_usb_clear_brdyenb(pipe_no);

  /* NotReady      Int Disable */

  hw_usb_clear_nrdyenb(pipe_no);

  /* Empty/SizeErr Int Disable */

  hw_usb_clear_bempenb(pipe_no);

  /* PIPE Configuration */

  usb_cstd_chg_curpipe(USB_PIPE0, USB_CUSE, USB_FALSE);
  hw_usb_write_pipesel(pipe_no);
  hw_usb_write_pipecfg(0);

  hw_usb_write_pipemaxp(0);
  hw_usb_write_pipeperi(0);
  hw_usb_write_pipesel(0);

  /* FIFO buffer DATA-PID initialized */

  /* SQCLR */

  hw_usb_set_sqclr(pipe_no);

  /* ACLRM */

  usb_cstd_do_aclrm(pipe_no);

  usb_cstd_clr_transaction_counter(pipe_no);

  /* Interrupt status clear */

  /* Ready         Int Clear */

  hw_usb_clear_sts_brdy(pipe_no);

  /* NotReady      Int Clear */

  hw_usb_clear_status_nrdy(pipe_no);

  /* Empty/SizeErr Int Clear */

  hw_usb_clear_status_bemp(pipe_no);
}

/****************************************************************************
 * Function Name   : usb_cstd_set_nak
 * Description     : Set up to NAK the specified pipe.
 * Arguments       : uint16_t pipe     : Pipe Number
 * Return value    : none
 ****************************************************************************/

static void usb_cstd_set_nak(uint16_t pipe)
{
  uint16_t buf;
  uint16_t n;

  /* Set NAK */

  hw_usb_clear_pid(pipe, USB_PID_BUF);

  /* The state of PBUSY continues while transmitting the packet
   * when it is a detach. 1ms comes off when leaving because the
   * packet duration might not exceed 1ms.
   */

  /* Whether it is PBUSY release or 1ms passage can be judged. */

  /* WAIT_LOOP */

  for (n = 0; n < 0xffffu; ++n)
    {
      /* PIPE control reg read */

      buf = hw_usb_read_pipectr(pipe);
      if (0 == (buf & RX65N_USB_DCPCTR_PID_MASK))
        {
          n = 0xfffeu;
        }
    }
}

/****************************************************************************
 * Function Name   : usb_cstd_is_set_frdy
 * Description     : Changes the specified FIFO port by the specified pipe.
 * Arguments       : uint16_t pipe     : Pipe Number
 *                 : uint16_t fifosel  : FIFO select
 *                 : uint16_t isel     : ISEL bit status
 * Return value    : FRDY status
 ****************************************************************************/

static uint16_t usb_cstd_is_set_frdy(uint16_t pipe, uint16_t fifosel,
                                     uint16_t isel)
{
  uint16_t buffer;
  uint16_t i;

  /* Changes the FIFO port by the pipe. */

  usb_cstd_chg_curpipe(pipe, fifosel, isel);

  /* WAIT_LOOP */

  for (i = 0; i < 4; i++)
    {
      buffer = hw_usb_read_fifoctr(fifosel);

      if (RX65N_USB_FIFOCTR_FRDY == (buffer &
          RX65N_USB_FIFOCTR_FRDY))
        {
          return buffer;
        }

      buffer = hw_usb_read_syscfg();
      buffer = hw_usb_read_syssts();
      nxsched_usleep(1);
    }

  return RX65N_USB_FIFO_ERROR;
}

/****************************************************************************
 * Function Name   : usb_cstd_chg_curpipe
 * Description     : Switch FIFO and pipe number.
 * Arguments  : uint16_t pipe     : Pipe number.
 *            : uint16_t fifosel  : FIFO selected (CPU, D0, D1..)
 *            : uint16_t isel : CFIFO Port Access Direction.
 *            : (Pipe1 to 9:Set to 0)
 * Return value    : none
 ****************************************************************************/

void usb_cstd_chg_curpipe(uint16_t pipe, uint16_t fifosel, uint16_t isel)
{
  uint16_t buffer;

  /* Select FIFO */

  switch (fifosel)
    {
      /* CFIFO use */

      case RX65N_USB_USING_CFIFO:

      /* ISEL=1, CURPIPE=0 */

