apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
      hw_usb_rmw_fifosel(USB_CUSE, ((USB_RCNT | isel) | pipe),
                        ((USB_RCNT | USB_ISEL) | USB_CURPIPE));

      /* WAIT_LOOP */

      do
        {
          buffer = hw_usb_read_fifosel(USB_CUSE);
        }

      while ((buffer & (USB_ISEL | USB_CURPIPE)) != (isel | pipe));
      break;

#ifdef DTC_DMA_ENABLED
#if ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE))

      /* D0FIFO use */

      case USB_D0USE:

      /* D1FIFO use */

      case USB_D1USE:

      /* DxFIFO pipe select */

      hw_usb_set_curpipe(fifosel, pipe);

      /* WAIT_LOOP */

      do
        {
          buffer = hw_usb_read_fifosel(fifosel);
        }
      while ((buffer & USB_CURPIPE) != pipe);
      break;

#endif /* ((USB_CFG_DTC==USB_CFG_ENABLE||(USB_CFG_DMA==USB_CFG_ENABLE))*/
#endif /* DTC_DMA_ENABLED */

      default:
      break;
    }
}

/****************************************************************************
 * Function Name   : usb_cstd_set_transaction_counter
 * Description     : Set specified Pipe Transaction Counter Register.
 * Arguments       : uint16_t trnreg   : Pipe number
 *                 : uint16_t trncnt   : Transaction counter
 * Return value    : none
 ****************************************************************************/

static void usb_cstd_set_transaction_counter(uint16_t trnreg,
                                             uint16_t trncnt)
{
  hw_usb_set_trclr(trnreg);
  hw_usb_write_pipetrn(trnreg, trncnt);
  hw_usb_set_trenb(trnreg);
}

/****************************************************************************
 * Function Name   : usb_cstd_clr_transaction_counter
 * Description     : Clear specified Pipe Transaction Counter Register.
 * Arguments       : uint16_t trnreg   : Pipe Number
 * Return value    : none
 ****************************************************************************/

static void usb_cstd_clr_transaction_counter(uint16_t trnreg)
{
  hw_usb_clear_trenb(trnreg);
  hw_usb_set_trclr(trnreg);
}

/****************************************************************************
 * Function Name   : usb_cstd_nrdy_enable
 * Description     : Enable NRDY interrupt of the specified pipe.
 * Arguments       : uint16_t pipe  : Pipe number.
 * Return value    : none
 ****************************************************************************/

static void usb_cstd_nrdy_enable(uint16_t pipe)
{
  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* Enable NRDY */

  hw_usb_set_nrdyenb(pipe);
}

/****************************************************************************
 * Function Name   : usb_cstd_get_pid
 * Description     : Fetch specified pipe's PID.
 * Arguments       : uint16_t pipe  : Pipe number.
 * Return value    : uint16_t PID-bit status
 ****************************************************************************/

static uint16_t usb_cstd_get_pid(uint16_t pipe)
{
  uint16_t buf;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_NULL; /* Error */
    }

  /* PIPE control reg read */

  buf = hw_usb_read_pipectr(pipe);
  return buf & RX65N_USB_DCPCTR_PID_MASK;
}

/****************************************************************************
 * Function Name   : usb_cstd_get_maxpacket_size
 * Description     : Fetch MaxPacketSize of the specified pipe.
 * Arguments       : uint16_t pipe  : Pipe number.
 * Return value    : uint16_t MaxPacketSize
 ****************************************************************************/

static uint16_t usb_cstd_get_maxpacket_size(uint16_t pipe)
{
  uint16_t size;
  uint16_t buffer;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_NULL; /* Error */
    }

  if (USB_PIPE0 == pipe)
    {
      buffer = hw_usb_read_dcpmaxp();
    }
  else
    {
      /* Pipe select */

      hw_usb_write_pipesel(pipe);
      buffer = hw_usb_read_pipemaxp();
    }

  /* Max Packet Size */

  size = (buffer & RX65N_USB_DCPMAXP_MXPS_MASK);

  return size;
}

/****************************************************************************
 * Function Name   : usb_cstd_get_pipe_dir
 * Description     : Get PIPE DIR
 * Arguments       : uint16_t pipe  : Pipe number.
 * Return value    : uint16_t pipe direction.
 ****************************************************************************/

static uint16_t usb_cstd_get_pipe_dir(uint16_t pipe)
{
  uint16_t buffer;

  if (USB_MAX_PIPE_NO < pipe)
    {
      return USB_NULL; /* Error */
    }

  /* Pipe select */

  hw_usb_write_pipesel(pipe);

  /* Read Pipe direction */

  buffer = hw_usb_read_pipecfg();
  return buffer & RX65N_USB_PIPECFG_DIR;
}

/****************************************************************************
 * Function Name   : usb_cstd_do_aclrm
 * Description     : Set the ACLRM-bit (Auto Buffer Clear Mode) of the
 *                 : specified pipe.
 * Arguments       : uint16_t pipe  : Pipe number.
 * Return value    : none
 ****************************************************************************/

static void usb_cstd_do_aclrm(uint16_t pipe)
{
  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* Control ACLRM */

  hw_usb_set_aclrm(pipe);
  hw_usb_clear_aclrm(pipe);
}

/****************************************************************************
 * Function Name   : usb_cstd_set_buf
 * Description     : Set PID (packet ID) of the specified pipe to BUF.
 * Arguments       : uint16_t pipe  : Pipe number.
 * Return value    : none
 ****************************************************************************/

static void usb_cstd_set_buf(uint16_t pipe)
{
  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* PIPE control reg set */

  hw_usb_set_pid(pipe, RX65N_USB_DCPCTR_PIDBUF);
}

/****************************************************************************
 * Function Name   : usb_cstd_clr_stall
 * Description     : Set up to NAK the specified pipe, and clear the
 *                 : STALL-bit set to the PID of the specified pipe.
 * Arguments       : usb_utr_t *ptr : Pointer to usb_utr_t structure.
 *                 : uint16_t pipe  : Pipe number.
 * Return value    : none
 * Note            : PID is set to NAK.
 ****************************************************************************/

