apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
static void usb_cstd_clr_stall(uint16_t pipe)
{
  if (USB_MAX_PIPE_NO < pipe)
    {
      return; /* Error */
    }

  /* Set NAK */

  usb_cstd_set_nak(pipe);

  /* Clear STALL */

  hw_usb_clear_pid(pipe, RX65N_USB_DCPCTR_PIDSTALL);
}

/****************************************************************************
 * Function Name   : usb_hstd_ctrl_write_start
 * Description     : Start data stage of Control Write transfer.
 * Arguments       : uint32_t  Bsize   : Data Size
 *                 : uint8_t   *Table  : Data Table Address
 * Return          : uint16_t          : USB_WRITEEND / USB_WRITING
 *                 :                   : USB_WRITESHRT / USB_FIFOERROR
 ****************************************************************************/

uint16_t usb_hstd_ctrl_write_start(uint8_t *buf_add, size_t buf_size)
{
  uint16_t end_flag;

  /* PID=NAK & clear STALL */

  usb_cstd_clr_stall(USB_PIPE0);

  /* DCP Configuration Register  (0x5c) */

  hw_usb_write_dcpcfg((USB_CNTMDFIELD | USB_DIRFIELD));

  hw_usb_set_sqset(USB_PIPE0); /* SQSET=1, PID=NAK */

  hw_usb_clear_status_bemp(USB_PIPE0);

  end_flag = usb_hstd_write_data_control_pipe(buf_add, buf_size);

  switch (end_flag)
    {
      /* End of data write */

      case USB_WRITESHRT:

      /* Next stage is Control write status stage */

      /* Enable Empty Interrupt */

      hw_usb_set_bempenb(USB_PIPE0);

      /* Enable Not Ready Interrupt */

      usb_cstd_nrdy_enable(USB_PIPE0);

      /* Set BUF */

      usb_cstd_set_buf(USB_PIPE0);
      break;

      /* End of data write (not null) */

      case USB_WRITEEND:

      /* continue */

      /* Continue of data write */

      case USB_WRITING:

      /* Enable Empty Interrupt */

      hw_usb_set_bempenb(USB_PIPE0);

      /* Enable Not Ready Interrupt */

      usb_cstd_nrdy_enable(USB_PIPE0);

      /* Set BUF */

      usb_cstd_set_buf(USB_PIPE0);
      break;

      /* FIFO access error */

      case USB_FIFOERROR:
      break;

      default:
      break;
    }

  /* End or Err or Continue */

  return end_flag;
}

/****************************************************************************
 * Function Name   : usb_hstd_ctrl_read_start
 * Description     : Start data stage of Control Read transfer.
 * Arguments       : none
 * Return          : none
 ****************************************************************************/

void usb_hstd_ctrl_read_start(void)
{
  /* PID=NAK & clear STALL */

  usb_cstd_clr_stall(USB_PIPE0);

  /* DCP Configuration Register  (0x5c) */

  hw_usb_write_dcpcfg(RX65N_USB_PIPECFG_SHTNAK);

  /* SQSET=1, PID=NAK */

  hw_usb_hwrite_dcpctr(RX65N_USB_DCPCTR_SQSET);

  /* Interrupt enable */

  /* Enable Ready Interrupt */

  hw_usb_set_brdyenb(USB_PIPE0);

  /* Enable Not Ready Interrupt */

  usb_cstd_nrdy_enable(USB_PIPE0);
  usb_cstd_set_buf(USB_PIPE0); /* Set BUF */
}

/****************************************************************************
 * Function Name   : usb_host_read_pipe_start
 * Description     : Start data stage of data Read transfer.
 * Arguments       : uint32_t Bsize   : Data Size
 *                 : uint8_t *Table   : Data Table Address
 * Return          : none
 ****************************************************************************/

void usb_host_read_pipe_start(uint16_t pipe)
{
  uint16_t config_reg;
  uint16_t ctrl_reg;

  /* PID=NAK & clear STALL */

  usb_cstd_clr_stall(pipe);

  config_reg = hw_usb_read_pipecfg();

  /* Pipe disabled at the end of transfer i.e. it is set to NAK */

  config_reg = config_reg | RX65N_USB_PIPECFG_SHTNAK;

  /* Set the direction as read */

  config_reg = config_reg & ~(RX65N_USB_PIPECFG_DIR);
  hw_usb_write_pipecfg(config_reg);

  ctrl_reg = hw_usb_read_pipectr (pipe);
  ctrl_reg = ctrl_reg | RX65N_USB_PIPECTR_SQSET;
  hw_usb_write_pipectr(pipe, ctrl_reg);

  /* usb_hstd_do_sqtgl((uint16_t) USB_PIPE0, 0); */

  /* Interrupt enable */

  /* Enable Ready Interrupt */

  hw_usb_set_brdyenb(pipe);

  /* Enable Not Ready Interrupt */

  usb_cstd_nrdy_enable(pipe);

  /* Set BUF */

  usb_cstd_set_buf(pipe);
}

/****************************************************************************
 * Function Name   : usb_hstd_status_start
 * Description     : Start status stage of Control Command.
 * Arguments       : none
 ****************************************************************************/

void usb_hstd_status_start(void)
{
  /* Interrupt Disable */

  /* BEMP0 Disable */

  hw_usb_clear_bempenb(USB_PIPE0);

  /* BRDY0 Disable */

  hw_usb_clear_brdyenb(USB_PIPE0);
}

/****************************************************************************
 * Function Name   : usb_hstd_ctrl_end
 * Description     : Call the user registered callback function that notifies
 *                 : completion of a control transfer.
 * Arguments       : uint16_t  status : Transfer status
 * Return          : none
 ****************************************************************************/

void usb_hstd_ctrl_end(uint16_t status)
{
  /* Interrupt Disable */

  hw_usb_clear_bempenb(USB_PIPE0); /* BEMP0 Disable */
  hw_usb_clear_brdyenb(USB_PIPE0); /* BRDY0 Disable */
  hw_usb_clear_nrdyenb(USB_PIPE0); /* NRDY0 Disable */

  usb_cstd_clr_stall(USB_PIPE0); /* PID=NAK & clear STALL */
  hw_usb_set_mbw(USB_CUSE, USB0_CFIFO_MBW);

  /* SUREQ=1, SQCLR=1, PID=NAK */

  hw_usb_hwrite_dcpctr((USB_SUREQCLR | USB_SQCLR);

  /* CFIFO buffer clear */

  usb_cstd_chg_curpipe(USB_PIPE0, USB_CUSE, USB_FALSE);
  hw_usb_set_bclr(USB_CUSE); /* Clear BVAL */
  usb_cstd_chg_curpipe((USB_PIPE0, USB_CUSE, USB_ISEL);
  hw_usb_set_bclr(USB_CUSE); /* Clear BVAL */
}

/****************************************************************************
 * Function Name   : usb_hstd_brdy_pipe
 * Description     : BRDY Interrupt
 * Arguments       : uint16_t bitsts  : BRDYSTS Reg & BRDYENB Reg
 * Return value    : none
 ****************************************************************************/

void usb_hstd_brdy_pipe(void)
{
  uint16_t bitsts;

