apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  bitsts = rx65n_usbhost_getreg(RX65N_USB_BRDYSTS);

  /* When operating by the host function, usb_hstd_brdy_pipe() is executed
   * without fail because only one BRDY message is issued even when the
   * demand of PIPE0 and PIPEx has been generated at the same time.
   */

  if (USB_BRDY0 == (bitsts & USB_BRDY0))
    {
      hw_usb_clear_sts_brdy(USB_PIPE0);

      /* Branch  by the Control transfer stage management */

      if (EDCTRL->xfrinfo->tdxfercond == USB_STATUSRD)
        {
          /* This interrupt occurred due to setup packet status stage of
           * writing NULL packet.
           */

          /* Call this to end the setup packet */

          /* Control Read/Write End */

          usb_hstd_ctrl_end(USB_CTRL_END);

          nxsem_post(&EDCTRL->wdhsem);
          return; /* Nothing else to do here... as of now... */
        }

      switch (EDCTRL->xfrinfo->tdxfercond)
        {
          /* Data stage of Control read transfer */

          case USB_DATARD:
          EDCTRL->xfrinfo->tdxfercond = usb_hstd_read_data_control_pipe ();

          switch (EDCTRL->xfrinfo->tdxfercond)
            {
              /* End of data read */

              case USB_READEND:

              /* continue */

              /* End of data read */

              case USB_READSHRT:

              usb_hstd_status_start();
              break;

              case USB_READING: /* Continue of data read */

              /* Still data is there - so set the condition for
               * reading in next interrupt...
               */

              EDCTRL->xfrinfo->tdxfercond = USB_DATARD;
              break;

              case USB_READOVER: /* FIFO access error */

              /* Control Read/Write End */

              usb_hstd_ctrl_end(USB_DATA_OVR);
              break;

              case USB_FIFOERROR: /* FIFO access error */

              /* Control Read/Write End */

              usb_hstd_ctrl_end(USB_DATA_ERR);
              syslog(LOG_INFO, "ERROR");
              break;

              default:
              break;
            }
          break;

          /* Data stage of Control read transfer */

          case USB_DATARDCNT:

            switch (usb_hstd_read_data_control_pipe())
              {
                case USB_READEND: /* End of data read */

                /* Control Read/Write End */

                usb_hstd_ctrl_end(USB_CTRL_READING);
                break;

                case USB_READSHRT: /* End of data read */

                /* Control Read/Write Status */

                usb_hstd_status_start();
                break;

                case USB_READING: /* Continue of data read */

                /* Still data is there - so set the condition for
                 * reading in next interrupt...
                 */

                EDCTRL->xfrinfo->tdxfercond = USB_DATARDCNT;
                break;

                case USB_READOVER: /* FIFO access error */

                /* Control Read/Write End */

                usb_hstd_ctrl_end(USB_DATA_OVR);
                break;

                case USB_FIFOERROR: /* FIFO access error */

                /* Control Read/Write End */

                usb_hstd_ctrl_end(USB_DATA_ERR);
                syslog(LOG_INFO, "ERROR");
                break;

                default:
                break;
            }
          break;

          /* Status stage Control write (NoData control) transfer */

          case USB_STATUSWR:

          /* Control Read/Write End */

          usb_hstd_ctrl_end(USB_CTRL_END);
          break;

          default:
          break;
        }

      if ((EDCTRL->xfrinfo->tdxfercond == USB_READEND) ||
          (EDCTRL->xfrinfo->tdxfercond == USB_READSHRT) ||
          (EDCTRL->xfrinfo->tdxfercond == USB_READOVER))
        {
          nxsem_post(&EDCTRL->wdhsem);
        }

      hw_usb_clear_sts_brdy(USB_PIPE0); /* This was missing? */
    }

  /* BRDY interrupt */

  usb_hstd_brdy_pipe_process(bitsts);
}

/****************************************************************************
 * Function Name   : usb_hstd_nrdy_pipe
 * Description     : NRDY Interrupt
 * Arguments       : usb_utr_t *ptr   : Pointer to usb_utr_t structure.
 *                 : uint16_t bitsts  : NRDYSTS Reg & NRDYENB Reg
 * Return value    : none
 ****************************************************************************/

void usb_hstd_nrdy_pipe(void)
{
  uint16_t buffer;
  uint16_t bitsts;

  bitsts = rx65n_usbhost_getreg(RX65N_USB_NRDYSTS); /* ptr->status; */

  /* When operating by the host function, usb_hstd_nrdy_pipe()
   * is executed without fail because
   * only one NRDY message is issued even when the demand of
   * PIPE0 and PIPEx has been generated at the same time.
   */

  if (USB_NRDY0 == (bitsts & USB_NRDY0))
    {
      hw_usb_clear_status_nrdy(USB_PIPE0);

      /* Get Pipe PID from pipe number */

      buffer = usb_cstd_get_pid(USB_PIPE0);

      /* STALL ? */

      if (RX65N_USB_DCPCTR_PIDSTALL == (buffer &
          RX65N_USB_DCPCTR_PIDSTALL))
        {
          /* PIPE0 STALL call back */

          usb_hstd_ctrl_end(USB_DATA_STALL);
        }
      else
        {
          /* Control Data Stage Device Ignore X 3 call back */

          usb_hstd_ctrl_end(USB_DATA_ERR);
        }
    }

  /* Nrdy Pipe interrupt */

  usb_hstd_nrdy_pipe_process(bitsts);
}

/****************************************************************************
 * Function Name   : usb_hstd_bemp_pipe
 * Description     : BEMP interrupt
 * Arguments       : uint16_t bitsts  : BEMPSTS Reg & BEMPENB Reg
 * Return value    : none
 ****************************************************************************/

void usb_hstd_bemp_pipe(void)
{
  uint16_t buffer;
  uint16_t bitsts;

  bitsts = rx65n_usbhost_getreg(RX65N_USB_BEMPSTS); /* ptr->status; */

  /* When operating by the host function, usb_hstd_bemp_pipe()
   * is executed without fail because
   * only one BEMP message is issued even when the demand of PIPE0
   * and PIPEx has been generated at the same time.
   */

  if (USB_BEMP0 == (bitsts & USB_BEMP0))
    {
      hw_usb_clear_status_bemp(USB_PIPE0);
      if (EDCTRL->xfrinfo->tdxfercond == USB_STATUSWR)
        {
          /* This interrupt occurred due to setup packet status
           * stage of writing NULL packet.
           */

          /* BEMP0 Disable */

