apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
          hw_usb_clear_bempenb(USB_PIPE0);

          /* BRDY0 Disable */

          hw_usb_clear_brdyenb(USB_PIPE0);

          /* Call this to end the setup packet */

          /* Control Read/Write End */

          usb_hstd_ctrl_end(USB_CTRL_END);

          nxsem_post(&EDCTRL->wdhsem);
          return; /* As of now, Nothing else to do here... */
        }

      /* Get Pipe PID from pipe number */

      buffer = usb_cstd_get_pid(USB_PIPE0);

      /* MAX packet size error ? */

      if (RX65N_USB_DCPCTR_PIDSTALL == (buffer & RX65N_USB_DCPCTR_PIDSTALL))
        {
          /* PIPE0 STALL call back */

          usb_hstd_ctrl_end(USB_DATA_STALL);
        }
      else
        {
          /* Branch  by the Control transfer stage management */

          switch (bitsts)
            {
              /* Continuas of data stage (Control write) */

              case USB_DATAWR:

              /* We should not get into this... */

              /* Buffer to CFIFO data write */

              switch (usb_hstd_write_data_control_pipe(0, 0))
                {
                  /* End of data write */

                  case USB_WRITESHRT:

                  hw_usb_set_bempenb(USB_PIPE0);

                  /* Enable Not Ready Interrupt */

                  usb_cstd_nrdy_enable(USB_PIPE0);
                  break;

                  /* End of data write (not null) */

                  case USB_WRITEEND:

                  /* continue */

                  /* Continue of data write */

                  case USB_WRITING:

                  /* Enable Empty Interrupt */

                  hw_usb_set_bempenb(USB_PIPE0);

                  /* Enable Not Ready Interrupt */

                  usb_cstd_nrdy_enable(USB_PIPE0);
                  break;

                  /* FIFO access error */

                  case USB_FIFOERROR:

                  /* Control Read/Write End */

                  usb_hstd_ctrl_end(USB_DATA_ERR);
                  break;

                 default:
                 break;
                }
              break;

             /* Next stage to Control write data */

              case USB_DATAWRCNT:

              /* Buffer to CFIFO data write */

              /* We should not get here... */

              switch (usb_hstd_write_data_control_pipe(0, 0))
                {
                  /* End of data write */

                  case USB_WRITESHRT:

                  hw_usb_set_bempenb(USB_PIPE0);

                  /* Enable Not Ready Interrupt */

                  usb_cstd_nrdy_enable(USB_PIPE0);
                  break;

                  /* End of data write (not null) */

                  case USB_WRITEEND:

                  /* Control Read/Write End */

                  usb_hstd_ctrl_end(USB_CTRL_WRITING);
                  break;

                  /* Continue of data write */

                  case USB_WRITING:

                  /* Enable Empty Interrupt */

                  hw_usb_set_bempenb(USB_PIPE0);

                  /* Enable Not Ready Interrupt */

                  usb_cstd_nrdy_enable(USB_PIPE0);
                  break;

                  /* FIFO access error */

                  case USB_FIFOERROR:

                  /* Control Read/Write End */

                  usb_hstd_ctrl_end(USB_DATA_ERR);
                  break;

                  default:
                  break;
                }
              break;

              case USB_STATUSWR: /* End of data stage (Control write) */
              usb_hstd_status_start();
              break;

              /* Status stage of Control read transfer */

              case USB_STATUSRD:

              /* Control Read/Write End */

              usb_hstd_ctrl_end(USB_CTRL_END);
              break;

              default:
              break;
            }
        }
    }

  usb_hstd_bemp_pipe_process(bitsts); /* BEMP interrupt */
}

/****************************************************************************
 * Name: rx65n_usbhost_printreg
 *
 * Description:
 *   Print the contents of an RX65N register operation
 *
 ****************************************************************************/

#ifdef CONFIG_RX65N_USBHOST_REGDEBUG
static void rx65n_usbhost_printreg(uint32_t addr, uint32_t val, bool iswrite)
{
  uinfo("%08x%s%08x\n", addr, iswrite ? "<-" : "->", val);
}
#endif

/****************************************************************************
 * Name: rx65n_usbhost_checkreg
 *
 * Description:
 *   Get the contents of an RX65N register
 *
 ****************************************************************************/

#ifdef CONFIG_RX65N_USBHOST_REGDEBUG
static void rx65n_usbhost_checkreg(uint32_t addr, uint32_t val, bool iswrite)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;
  static bool     prevwrite = false;

  /* Is this the same value that we read from/wrote to the same register
   * last time? Are we polling the register?  If so, suppress the output.
   */

  if (addr == prevaddr && val == preval && prevwrite == iswrite)
    {
      /* Yes.. Just increment the count */

      count++;
    }
  else
    {
      /* No this is a new address or value or operation. Were there any
       * duplicate accesses before this one?
       */

      if (count > 0)
        {
          /* Yes.. Just one? */

          if (count == 1)
            {
              /* Yes.. Just one */

              rx65n_usbhost_printreg(prevaddr, preval, prevwrite);
            }
          else
            {
              /* No.. More than one. */

              uinfo("[repeats %d more times]\n", count);
            }
        }

      /* Save the new address, value, count, and operation for next time */

      prevaddr  = addr;
      preval    = val;
      count     = 0;
      prevwrite = iswrite;

      /* Show the new regisgter access */

      rx65n_usbhost_printreg(addr, val, iswrite);
    }
}
#endif

/****************************************************************************
 * Name: rx65n_usbhost_getreg
 *
 * Description:
 *   Get the contents of an RX65N register
 *
 ****************************************************************************/

