apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
#ifdef CONFIG_RX65N_USBHOST_REGDEBUG
static uint16_t rx65n_usbhost_getreg(uint32_t addr)
{
  /* Read the value from the register */

  uint16_t val = getreg16(addr);

  /* Check if we need to print this value */

  rx65n_usbhost_checkreg(addr, val, false);
  return val;
}
#endif

/****************************************************************************
 * Name: rx65n_usbhost_putreg
 *
 * Description:
 *   Set the contents of an RX65N register to a value
 *
 ****************************************************************************/

#ifdef CONFIG_RX65N_USBHOST_REGDEBUG
static void rx65n_usbhost_putreg(uint16_t val, uint32_t addr)
{
  /* Check if we need to print this value */

  rx65n_usbhost_checkreg(addr, val, true);

  /* Write the value */

  putreg16(val, addr);
}
#endif

/****************************************************************************
 * Name: rx65n_usbhost_getle16
 *
 * Description:
 *   Get a (possibly unaligned) 16-bit little endian value.
 *
 ****************************************************************************/

static inline uint16_t rx65n_usbhost_getle16(const uint8_t *val)
{
  return val[1] << 8 | val[0];
}

/****************************************************************************
 * Name: rx65n_usbhost_edfree
 *
 * Description:
 *   Return an endpoint descriptor to the free list
 *
 ****************************************************************************/

static inline void rx65n_usbhost_edfree(struct rx65n_usbhost_ed_s *ed)
{
  struct rx65n_usbhost_list_s *entry = (struct rx65n_usbhost_list_s *)ed;

  /* Put the ED back into the free list */

  entry->flink = g_edfree;
  g_edfree     = entry;
}

/****************************************************************************
 * Name: rx65n_usbhost_tdalloc
 *
 * Description:
 *   Allocate an transfer descriptor from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protected from concurrent access to the TD pool by the interrupt
 *     handler
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

static struct rx65n_usbhost_gtd_s *rx65n_usbhost_tdalloc(uint8_t ep_num)
{
  /* Currently each TD would associate with one EP. So the ep_numb is
   * passed to tdalloc function and it would return the TD with this,
   * there is no need to free this
   */

  memset(&(g_rx65n_tdlist[ep_num]), 0, sizeof(struct rx65n_usbhost_gtd_s));
  return &(g_rx65n_tdlist[ep_num]);
}

/****************************************************************************
 * Name: rx65n_tdfree
 *
 * Description:
 *   Return an transfer descriptor to the free list
 *
 * Assumptions:
 * Only called from the WDH interrupt handler (and during initialization).
 * Interrupts are disabled in any case.
 *
 ****************************************************************************/

static void rx65n_usbhost_tdfree(struct rx65n_usbhost_gtd_s *td)
{
  struct rx65n_usbhost_list_s *tdfree = (struct rx65n_usbhost_list_s *)td;

  /* This should not happen but just to be safe, don't free the common, pre-
   * allocated tail TD.
   */

  if (tdfree != NULL && td != TDTAIL)
    {
      tdfree->flink = g_tdfree;
      g_tdfree      = tdfree;
    }
}

/****************************************************************************
 * Name: rx65n_usbhost_tballoc
 *
 * Description:
 *   Allocate an request/descriptor transfer buffer from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

static uint8_t *rx65n_usbhost_tballoc(void)
{
  uint8_t *ret = (uint8_t *)g_tbfree;

  if (ret)
    {
      g_tbfree = ((struct rx65n_usbhost_list_s *)ret)->flink;
    }

  return ret;
}

/****************************************************************************
 * Name: rx65n_usbhost_tbfree
 *
 * Description:
 *   Return an request/descriptor transfer buffer to the free list
 *
 ****************************************************************************/

static void rx65n_usbhost_tbfree(uint8_t *buffer)
{
  struct rx65n_usbhost_list_s *tbfree =
  (struct rx65n_usbhost_list_s *)buffer;

  if (tbfree)
    {
      tbfree->flink = g_tbfree;
      g_tbfree      = tbfree;
    }
}

/****************************************************************************
 * Name: rx65n_usbhhost_allocio
 *
 * Description:
 *   Allocate an IO buffer from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

#if RX65N_USBHOST_IOBUFFERS > 0
static uint8_t *rx65n_usbhhost_allocio(void)
{
  uint8_t *ret;
  irqstate_t flags;

  flags = enter_critical_section();
  ret = (uint8_t *)g_iofree;
  if (ret)
    {
      g_iofree = ((struct rx65n_usbhost_list_s *)ret)->flink;
    }

  leave_critical_section(flags);
  return ret;
}
#endif

/****************************************************************************
 * Name: rx65n_usbhhost_freeio
 *
 * Description:
 *   Return an TD buffer to the free list
 *
 ****************************************************************************/

#if RX65N_USBHOST_IOBUFFERS > 0
static void rx65n_usbhhost_freeio(uint8_t *buffer)
{
  struct rx65n_usbhost_list_s *iofree;
  irqstate_t flags;

  /* Could be called from the interrupt level */

  flags         = enter_critical_section();
  iofree        = (struct rx65n_usbhost_list_s *)buffer;
  iofree->flink = g_iofree;
  g_iofree      = iofree;
  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: rx65n_usbhost_alloc_xfrinfo
 *
 * Description:
 *   Allocate an asynchronous data structure from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

