apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
static struct rx65n_usbhost_xfrinfo_s *rx65n_usbhost_alloc_xfrinfo(void)
{
  struct rx65n_usbhost_xfrinfo_s *ret;
  irqstate_t flags;

  flags = enter_critical_section();
  ret = (struct rx65n_usbhost_xfrinfo_s *)g_xfrfree;

  if (ret)
    {
      g_xfrfree = ((struct rx65n_usbhost_list_s *)ret)->flink;
    }

  leave_critical_section(flags);

  return ret;
}

/****************************************************************************
 * Name: rx65n_usbhhost_freeio
 *
 * Description:
 *   Return an TD buffer to the free list
 *
 ****************************************************************************/

static void rx65n_usbhost_free_xfrinfo(struct
                rx65n_usbhost_xfrinfo_s *xfrinfo)
{
  struct rx65n_usbhost_list_s *node;
  irqstate_t flags;

  /* Could be called from the interrupt level */

  flags        = enter_critical_section();
  node         = (struct rx65n_usbhost_list_s *)xfrinfo;
  node->flink  = g_xfrfree;
  g_xfrfree    = node;
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: rx65n_usbhost_addctrled
 *
 * Description:
 *   Helper function to add an ED to the control list.
 *
 ****************************************************************************/

static inline int rx65n_usbhost_addctrled(struct rx65n_usbhost_s *priv,
                                          struct rx65n_usbhost_ed_s *ed)
{
  /* Ctrl ED is always used and statically assigned */

  return OK;
}

/****************************************************************************
 * Name: rx65n_usbhost_remctrled
 *
 * Description:
 *   Helper function remove an ED from the control list.
 *
 ****************************************************************************/

static inline int rx65n_usbhost_remctrled(struct rx65n_usbhost_s *priv,
                                          struct rx65n_usbhost_ed_s *ed)
{
  /* Ctrl ED is always used and statically assigned */

  /* The semaphore for the USB HID keyboard is released */

  if (g_kbdport == g_usbidx)
    {
      nxsem_post(&g_rx65n_edlist[g_kbdpipe].wdhsem);
    }

  return OK;
}

/****************************************************************************
 * Name: rx65n_usbhost_addbulked
 *
 * Description:
 *   Helper function to add an ED to the bulk list.
 *
 ****************************************************************************/

static inline int rx65n_usbhost_addbulked(struct rx65n_usbhost_s *priv,
                                   const struct usbhost_epdesc_s *epdesc,
                                   struct rx65n_usbhost_ed_s *ed)
{
#ifndef CONFIG_USBHOST_BULK_DISABLE
  irqstate_t flags;
  uint8_t    pipe_no;
  uint16_t   pipe_cfg;
  uint16_t   pipe_maxp;

  /* Pipe Cycle Control Register is not needed for bulk pipe */

  /* uint16_t    pipe_peri; */

  /* Disable bulk list processing while we modify the list */

  flags   = enter_critical_section();
  pipe_no = ed->pipenum;

  /* To begin with start config as Bulk pipe */

  pipe_cfg = 0x4000;

  /* Update the direction */

  /* Direction is in */

  if (epdesc->in)
    {
      pipe_cfg = pipe_cfg & ~ (RX65N_USB_PIPECFG_DIR);
      pipe_cfg = pipe_cfg | RX65N_USB_PIPECFG_SHTNAK;
    }
  else
    {
      pipe_cfg = pipe_cfg | (RX65N_USB_PIPECFG_DIR);
    }

  /* Finally update the address */

  pipe_cfg = pipe_cfg | ((epdesc->addr) & RX65N_USB_PIPECFG_EPNUM_MASK);

  /* Update pipe_maxp : Begin with initial value from device address */

  pipe_maxp = rx65n_usbhost_getreg(RX65N_USB_DCPMAXP);
  pipe_maxp &= ~(RX65N_USB_PIPEMAXP_MXPSMASK);
  pipe_maxp = pipe_maxp | (epdesc->mxpacketsize);

  /* Now all the values are ready to be written */

  g_usb_pipe_table[pipe_no].pipe_cfg = pipe_cfg;
  g_usb_pipe_table[pipe_no].pipe_maxp = pipe_maxp;
  g_usb_pipe_table[pipe_no].pipe_peri = 0;

  /* Now update these values in the required pipe */

  usb_cstd_pipe_init(pipe_no);
  leave_critical_section(flags);

  return OK;

#else
  return -ENOSYS;
#endif
}

/****************************************************************************
 * Name: rx65n_usbhost_rembulked
 *
 * Description:
 *   Helper function remove an ED from the bulk list.
 *
 ****************************************************************************/

static inline int rx65n_usbhost_rembulked(struct rx65n_usbhost_s *priv,
                                          struct rx65n_usbhost_ed_s *ed)
{
/* This function requires implementation
 * for OHCI specific interrupt disabling
 * As RX65N is not OHCI compliant, this function
 * need not be implemented
 */

  return OK;
}

/****************************************************************************
 * Name: rx65n_usbhost_getinterval
 *
 * Description:
 *   Convert the endpoint polling interval into a HCCA table increment
 *
 ****************************************************************************/

#if !defined(CONFIG_USBHOST_INT_DISABLE) || \
    !defined(CONFIG_USBHOST_ISOC_DISABLE)
static unsigned int rx65n_usbhost_getinterval(uint8_t interval)
{
  /* The bInterval field of the endpoint descriptor contains the polling
   * interval for interrupt and isochronous endpoints. For other types of
   * endpoint, this value should be ignored. bInterval is provided in units
   * of 1MS frames.
   */

  if (interval < 3)
    {
      return 2;
    }
  else if (interval < 7)
    {
      return 4;
    }
  else if (interval < 15)
    {
      return 8;
    }
  else if (interval < 31)
    {
      return 16;
    }
  else
    {
      return 32;
    }
}
#endif

/****************************************************************************
 * Name: rx65n_usbhost_setinttab
 *
 * Description:
 *      Set the interrupt table to the selected value using the provided
 *  interval and offset.
 *
 ****************************************************************************/

#if !defined(CONFIG_USBHOST_INT_DISABLE) || \
!defined(CONFIG_USBHOST_ISOC_DISABLE)
static void rx65n_usbhost_setinttab(uint32_t value, unsigned int interval,
  unsigned int offset)
{
  unsigned int i;

