apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  for (i = offset; i < HCCA_INTTBL_WSIZE; i += interval)
    {
      HCCA->inttbl[i] = value;
    }
}
#endif

/****************************************************************************
 * Name: rx65n_usbhost_addinted
 *
 * Description:
 *   Helper function to add an ED to the HCCA interrupt table.
 *
 *   To avoid reshuffling the table so much and to keep life simple in
 *    general, the following rules are applied:
 *
 *     1. IN EDs get the even entries, OUT EDs get the odd entries.
 *     2. Add IN/OUT EDs are scheduled together at the minimum interval of
 *        all IN/OUT EDs.
 *
 *   This has the following consequences:
 *
 *     1. The minimum support polling rate is 2MS, and
 *     2. Some devices may get polled at a much higher rate than they request
 *
 ****************************************************************************/

static inline int rx65n_usbhost_addinted(struct rx65n_usbhost_s *priv,
                                 const struct usbhost_epdesc_s *epdesc,
                                 struct rx65n_usbhost_ed_s *ed)
{
#ifndef CONFIG_USBHOST_INT_DISABLE
  unsigned int interval;
  unsigned int offset;
  uint32_t head;
  uint8_t     pipe_no;
  uint16_t    pipe_cfg;
  uint16_t    pipe_maxp;
  uint16_t    pipe_peri;

  /* Get the quantized interval value associated with this ED and save it
   * in the ED.
   */

  interval     = rx65n_usbhost_getinterval(epdesc->interval);

  ed->interval = interval;
  uinfo("interval: %d->%d\n", epdesc->interval, interval);

  /* Get the offset associated with the ED direction. IN EDs get the even
   * entries, OUT EDs get the odd entries.
   *
   * Get the new, minimum interval. Add IN/OUT EDs are scheduled together
   * at the minimum interval of all IN/OUT EDs.
   */

  if (epdesc->in)
    {
      offset = 0;
      if (priv->ininterval > interval)
        {
          priv->ininterval = interval;
        }
      else
        {
          interval = priv->ininterval;
        }
    }

  else
    {
      offset = 1;
      if (priv->outinterval > interval)
        {
          priv->outinterval = interval;
        }
      else
        {
          interval = priv->outinterval;
        }
    }

  uinfo("min interval: %d offset: %d\n", interval, offset);

  /* Get value for Interval Error Detection Interval  */

  pipe_no = ed->pipenum;

  if (epdesc->mxpacketsize != 1)
    {
      g_kbdpipe = pipe_no;
      kbd_interrupt_in_pipe = pipe_no;
    }
  else
    {
      g_kbdpipe = 0;
    }

  /* To begin with start config as INT pipe */

  pipe_cfg = 0x8000;

  /* Update the direction */

  /* Direction is in */

  if (epdesc->in)
    {
       pipe_cfg = pipe_cfg & ~ (RX65N_USB_PIPECFG_DIR);
    }
  else
    {
      pipe_cfg = pipe_cfg | ~ (RX65N_USB_PIPECFG_DIR);
    }

  /* Finally update the address */

  pipe_cfg = pipe_cfg | ((epdesc->addr) & RX65N_USB_PIPECFG_EPNUM_MASK);

  /* Update pipe_maxp : Begin with initial value from endpoint address */

  pipe_maxp = rx65n_usbhost_getreg(RX65N_USB_DCPMAXP);
  pipe_maxp &= ~(RX65N_USB_PIPEMAXP_MXPSMASK);
  pipe_maxp = pipe_maxp | (epdesc->mxpacketsize);

  /* Now get the Pipe Peri values */

  pipe_peri = usb_hstd_get_pipe_peri_value(epdesc->interval);

  /* Now all the values are ready to be written */

  g_usb_pipe_table[pipe_no].pipe_cfg = pipe_cfg;
  g_usb_pipe_table[pipe_no].pipe_maxp = pipe_maxp;
  g_usb_pipe_table[pipe_no].pipe_peri = pipe_peri;

  /* Now update these values in the required pipe */

  usb_cstd_pipe_init(pipe_no);

  struct rx65n_usbhost_xfrinfo_s *xfrinfo;
  DEBUGASSERT(ed->xfrinfo == NULL);

  xfrinfo = rx65n_usbhost_alloc_xfrinfo();
  if (xfrinfo == NULL)
    {
      rx65n_usbhost_free_xfrinfo(xfrinfo);
      uerr("ERROR: rx65n_usbhost_alloc_xfrinfo failed\n");
      return -ENOMEM;
    }

  /* Initialize the transfer structure */

  memset(xfrinfo, 0, sizeof(struct rx65n_usbhost_xfrinfo_s));
  xfrinfo->buffer = &kbd_report_data[0];
  xfrinfo->buflen = epdesc->mxpacketsize;
  xfrinfo->tdxfercond = USB_DATARD;

  ed->xfrinfo = xfrinfo;

  /* Start the reading the interrupt pipe for KBD */

  /* Now start the interrupt pipe */

  usb_host_read_pipe_start(pipe_no);

  /* Get the head of the first of the duplicated entries.  The first offset
   * entry is always guaranteed to contain the common ED list head.
   */

  head = HCCA->inttbl[offset];

  /* Clear all current entries in the interrupt table for this direction */

  rx65n_usbhost_setinttab(0, 2, offset);

  /* Add the new ED before the old head of the periodic ED list and set the
   * new ED as the head ED in all of the appropriate entries of the HCCA
   * interrupt table.
   */

  ed->hw.nexted = head;
  rx65n_usbhost_setinttab((uint32_t)ed, interval, offset);
  uinfo("head: %08x next: %08x\n", ed, head);

  return OK;
#else
  return -ENOSYS;
#endif
}

/****************************************************************************
 * Name: rx65n_usbhost_reminted
 *
 * Description:
 *   Helper function to remove an ED from the HCCA interrupt table.
 *
 *   To avoid reshuffling the table so much and to keep life simple in
 *    general, the following rules are applied:
 *
 *     1. IN EDs get the even entries, OUT EDs get the odd entries.
 *     2. Add IN/OUT EDs are scheduled together at the minimum interval of
 *        all IN/OUT EDs.
 *
 *   This has the following consequences:
 *
 *     1. The minimum support polling rate is 2MS, and
 *     2. Some devices may get polled at a much higher rate than they
 *        request.
 *
 ****************************************************************************/

static inline int rx65n_usbhost_reminted(struct rx65n_usbhost_s *priv,
                                         struct rx65n_usbhost_ed_s *ed)
{
  /* This function is to disable OHCI specific interrupts
   * As, RX65N is not OHCI compliant, this function does not require
   * any implementation
   */

  return OK;
}

/****************************************************************************
 * Name: rx65n_usbhost_addisoced
 *
 * Description:
 *   Helper functions to add an ED to the periodic table.
 *
 ****************************************************************************/

