apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
static inline int rx65n_usbhost_addisoced(struct rx65n_usbhost_s *priv,
                                  const struct usbhost_epdesc_s *epdesc,
                                  struct rx65n_usbhost_ed_s *ed)
{
#ifndef CONFIG_USBHOST_ISOC_DISABLE
  printf("Isochronous endpoints not yet supported\n");
#endif
  return -ENOSYS;
}

/****************************************************************************
 * Name: rx65n_usbhost_remisoced
 *
 * Description:
 *   Helper functions to remove an ED from the periodic table.
 *
 ****************************************************************************/

static inline int rx65n_usbhost_remisoced(struct rx65n_usbhost_s *priv,
                                          struct rx65n_usbhost_ed_s *ed)
{
#ifndef CONFIG_USBHOST_ISOC_DISABLE
  printf("Isochronous endpoints not yet supported\n");
#endif
  return -ENOSYS;
}

/****************************************************************************
 * Name: rx65n_usbhost_enqueuetd
 *
 * Description:
 *   Enqueue a transfer descriptor.  Notice that this function only supports
 *   queue on TD per ED.
 *
 ****************************************************************************/

static int rx65n_usbhost_enqueuetd(struct rx65n_usbhost_s *priv,
                                   struct rx65n_usbhost_ed_s *ed,
                                   uint32_t dirpid, uint32_t toggle,
                                   volatile uint8_t *buffer, size_t buflen)
{
  struct rx65n_usbhost_gtd_s *td;
  int ret = -ENOMEM;

  /* Allocate a TD from the free list */

  /* Currently each TD would associate with one EP. So the epnumb
   * is passed to tdalloc function and it would return the TD with
   * this, there is no need to free this - there is no need
   */

  td = rx65n_usbhost_tdalloc(ed->pipenum);

  if (td != NULL)
    {
      /* Initialize allocated TD and link it before the common tail TD. */

      td->hw.ctrl = (GTD_STATUS_R | dirpid | TD_DELAY(0) |
        toggle | GTD_STATUS_CC_MASK);
      TDTAIL->hw.ctrl     = 0;
      td->hw.cbp          = (uint32_t)buffer;
      TDTAIL->hw.cbp      = 0;
      td->hw.nexttd       = (uint32_t)TDTAIL;
      TDTAIL->hw.nexttd   = 0;
      td->hw.be           = (uint32_t)(buffer + (buflen - 1));
      TDTAIL->hw.be       = 0;

      /* Configure driver-only fields in the extended TD structure */

      td->ed              = ed;

      /* Link the td to the head of the ED's TD list */

      ed->hw.headp        = (uint32_t)td | ((ed->hw.headp) & ED_HEADP_C);
      ed->hw.tailp        = (uint32_t)TDTAIL;
      ret                 = OK;
    }

  return ret;
}

/****************************************************************************
 * Name: rx65n_usbhost_wdhwait
 *
 * Description:
 *   Set the request for the Writeback Done Head event well BEFORE enabling
 *   the transfer (as soon as we are absolutely committed to the to avoid
 *   transfer). We do this to minimize race conditions.  This logic would
 *   have to be  expanded if we want to have more than one packet in flight
 *   at a time!
 *
 ****************************************************************************/

static int rx65n_usbhost_wdhwait(struct rx65n_usbhost_s *priv,
                                 struct rx65n_usbhost_ed_s *ed)
{
  struct rx65n_usbhost_xfrinfo_s *xfrinfo;
  irqstate_t flags = enter_critical_section();
  int        ret   = -ENODEV;

  DEBUGASSERT(ed && ed->xfrinfo);
  xfrinfo = ed->xfrinfo;

  /* Is the device still connected? */

  if (priv->connected)
    {
      /* Yes.. then set wdhwait to indicate that we expect to be informed
       * when either (1) the device is disconnected, or (2) the transfer
           *  completed.
       */

      xfrinfo->wdhwait = true;
      ret = OK;
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: rx65n_usbhost_ctrltd
 *
 * Description:
 *   Process a IN or OUT request on the control endpoint.  This function
 *   will enqueue the request and wait for it to complete.  Only one
 *   transfer may be queued; Neither these methods nor the transfer() method
 *   can be called again until the control transfer functions returns.
 *
 *   These are blocking methods; these functions will not return until the
 *   control transfer has completed.
 *
 ****************************************************************************/

static int rx65n_usbhost_ctrltd(struct rx65n_usbhost_s *priv,
                                struct rx65n_usbhost_ed_s *ed,
                                uint32_t dirpid, uint8_t *buffer,
                                size_t buflen)
{
  struct rx65n_usbhost_xfrinfo_s *xfrinfo;
  uint32_t toggle;
  int ret;
  uint16_t sdata;

  /* Allocate a structure to retain the information needed when the
   * transfer completes.
   */

  DEBUGASSERT(ed->xfrinfo == NULL);

  xfrinfo = rx65n_usbhost_alloc_xfrinfo();
  if (xfrinfo == NULL)
    {
      uerr("ERROR: rx65n_usbhost_alloc_xfrinfo failed\n");
      return -ENOMEM;
    }

  /* Initialize the transfer structure */

  memset(xfrinfo, 0, sizeof(struct rx65n_usbhost_xfrinfo_s));
  xfrinfo->buffer = buffer;
  xfrinfo->buflen = buflen;

  /* copy the transfer condition - any way we are copying this
   * address to ed just 2 lines after this...
   */

  xfrinfo->tdxfercond = ed->xfrinfo->tdxfercond;

  ed->xfrinfo = xfrinfo;

  /* Set the request for the Write-back Done Head event well BEFORE
   * enabling the transfer.
   */

  if (priv->connected)
    {
      ret = rx65n_usbhost_wdhwait(priv, ed);
      if (ret < 0)
        {
          syslog(LOG_INFO, "ERROR: Device disconnected\n");
          goto errout_with_xfrinfo;
        }
    }

  /* Configure the toggle field in the TD */

  if (dirpid == GTD_STATUS_DP_SETUP)
    {
      toggle = GTD_STATUS_T_DATA0;
    }
  else
    {
      toggle = GTD_STATUS_T_DATA1;
    }

  /* Then enqueue the transfer */

  xfrinfo->tdstatus = TD_CC_NOERROR;
  ret = rx65n_usbhost_enqueuetd(priv, ed, dirpid, toggle, buffer, buflen);

  if (ret == OK)
    {
      /* Set ControlListFilled.  This bit is used to indicate whether there
       * are TDs on the Control list.
       */

      if (dirpid == GTD_STATUS_DP_SETUP)
        {
          nxmutex_lock(&priv->lock);

          /* Set DATA0 bit of DCPCTR */

          rx65n_usbhost_setbit(RX65N_USB_DCPCTR, RX65N_USB_DCPCTR_SQCLR);

          sdata = *(ed->xfrinfo->buffer) | (*(ed->xfrinfo->buffer + 1) << 8);

