apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
          /* Request type and Request */

          rx65n_usbhost_putreg(sdata, RX65N_USB_USBREQ);
          sdata = *(ed->xfrinfo->buffer + 2) |
                  (*(ed->xfrinfo->buffer + 3) << 8);
          rx65n_usbhost_putreg(sdata, RX65N_USB_USBVAL); /* wValue */
          sdata = *(ed->xfrinfo->buffer + 4) |
                  (*(ed->xfrinfo->buffer + 5) << 8);
         rx65n_usbhost_putreg(sdata, RX65N_USB_USBINDX); /* wIndex */
          sdata = *(ed->xfrinfo->buffer + 6) |
                  (*(ed->xfrinfo->buffer + 7) << 8);
         rx65n_usbhost_putreg(sdata, RX65N_USB_USBLENG); /* wLen */

          rx65n_usbhost_setbit(RX65N_USB_DCPCTR, RX65N_USB_DCPCTR_SQSET);

          hw_usb_hclear_sts_sign();
          hw_usb_hclear_sts_sack();

          hw_usb_hset_enb_signe();
          hw_usb_hset_enb_sacke();
          hw_usb_hset_sureq();

          /* At this point every thing is done w.r.t hardware to send the
           * setup packet... Now release the exclusive access mutex and
           * wait for wdhsem
           */

          nxmutex_unlock(&priv->lock);

          /* Wait for the Writeback Done Head interrupt */

          if (priv->connected)
            {
             nxsem_wait_uninterruptible(&ed->wdhsem);
            }

          /* Disable setup packet status response */

          rx65n_usbhost_clearbit(RX65N_USB_INTENB1,
          RX65N_USB_INTENB1_SACKE | RX65N_USB_INTENB1_SIGNE);
        }

      else if (dirpid == GTD_STATUS_DP_IN)
        {
          nxmutex_lock(&priv->lock);

          /* BEMP0 Disable */

          hw_usb_clear_bempenb(USB_PIPE0);

          /* BRDY0 Disable */

          hw_usb_clear_brdyenb(USB_PIPE0);

          usb_hstd_ctrl_read_start();

          /* At this point every thing is done w.r.t hardware to setup
           * to receive the setup data... Now wait for interrupt
           */

          nxmutex_unlock(&priv->lock);

          if (priv->connected)
            {
             nxsem_wait_uninterruptible(&ed->wdhsem);
            }
        }

      else if (dirpid == GTD_STATUS_DP_OUT)
        {
          nxmutex_lock(&priv->lock);

          /* process setup packet status phase */

          usb_hstd_ctrl_write_start(buffer, buflen);

          nxmutex_unlock(&priv->lock);

          if (priv->connected)
            {
               nxsem_wait_uninterruptible(&ed->wdhsem);
            }

          /* Disable Empty Interrupt */

          hw_usb_clear_bempenb(USB_PIPE0);

          /* Disable Not Ready Interrupt */

          hw_usb_clear_nrdyenb(USB_PIPE0);
        }

      /* Check the TD completion status bits */

      if (xfrinfo->tdstatus == TD_CC_NOERROR)
        {
          ret = OK;
        }
      else
        {
          uerr("ERROR: Bad TD completion status: %d\n", xfrinfo->tdstatus);
          ret = xfrinfo->tdstatus == TD_CC_STALL ? -EPERM : -EIO;
        }
    }
  else
    {
    }

  /* Make sure that there is no outstanding request on this endpoint */

errout_with_xfrinfo:
  rx65n_usbhost_free_xfrinfo(xfrinfo);
  ed->xfrinfo = NULL;
  return ret;
}

/****************************************************************************
 * Name: rx65n_usbhost_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int rx65n_usbhost_usbinterrupt(int irq, void *context, void *arg)
{
  uint16_t intenb0;
  uint16_t intenb1;
  uint16_t intsts0;
  uint16_t intsts1;
  uint16_t ack_interrupt;

  /* Read Interrupt Status and mask out interrupts that are not enabled. */

  intenb0 = rx65n_usbhost_getreg(RX65N_USB_INTENB0);
  intenb1 = rx65n_usbhost_getreg(RX65N_USB_INTENB1);
  intsts0 = rx65n_usbhost_getreg(RX65N_USB_INTSTS0);
  intsts1 = rx65n_usbhost_getreg(RX65N_USB_INTSTS1);

  if ((((intsts1 & intenb1) & RX65N_USB_INTSTS1_SACK)) ==
        RX65N_USB_INTSTS1_SACK)
    {
      hw_usb_hclear_sts_sack();

      /* Disable setup packet status response */

      rx65n_usbhost_clearbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_SACKE |
       RX65N_USB_INTENB1_SIGNE);

      /* release the EP0 ep->wdhsem semaphore */

      DEBUGASSERT(work_available(&g_usbhost.rx65n_interrupt_bhalf));

      DEBUGVERIFY(work_queue(HPWORK, &g_usbhost.rx65n_interrupt_bhalf,
       rx65n_usbhost_bottomhalf,
      (void *)USB_PROCESS_SACK_INT, 0));
    }

  /* Is it ERROR for Setup packet... */

  else if ((((intsts1 & intenb1) & RX65N_USB_INTSTS1_SIGN)) ==
    RX65N_USB_INTSTS1_SIGN)
    {
      hw_usb_hclear_sts_sign();

      /* Disable setup packet status response */

      rx65n_usbhost_clearbit(RX65N_USB_INTENB1, RX65N_USB_INTENB1_SACKE |
      RX65N_USB_INTENB1_SIGNE);
      DEBUGASSERT(work_available(&g_usbhost.rx65n_interrupt_bhalf));

      DEBUGVERIFY(work_queue(HPWORK, &g_usbhost.rx65n_interrupt_bhalf,
      rx65n_usbhost_bottomhalf,
      (void *)USB_PROCESS_SIGN_INT, 0));
    }

  /* Check for EOFERR interrupt... Not using it though */

  else if ((((intsts1 & intenb1) & RX65N_USB_INTSTS1_EOFERR)) ==
    RX65N_USB_INTSTS1_EOFERR)
    {
      rx65n_usbhost_putreg(((~RX65N_USB_INTSTS1_EOFERR) &
      INTSTS1_BIT_VALUES_TO_ACK), RX65N_USB_INTSTS1);
    }

  /* Check for over current condition... */

  else if ((((intsts1 & intenb1) & RX65N_USB_INTSTS1_OVRCRE)) ==
    RX65N_USB_INTSTS1_OVRCRE)
    {
      ack_interrupt = INTSTS1_BIT_VALUES_TO_ACK &
      (~(RX65N_USB_INTSTS1_OVRCRE));

      /* Acknowledge the OVRCR interrupt */

      rx65n_usbhost_putreg(ack_interrupt, RX65N_USB_INTSTS1);
    }

  /* Check for attach condition...  */

  else if ((((intsts1 & intenb1) & RX65N_USB_INTSTS1_ATTCH)) ==
    RX65N_USB_INTSTS1_ATTCH)
    {
      hw_usb_hclear_sts_attch();

      usb_hstd_bus_int_disable();
      DEBUGASSERT(work_available(&g_usbhost.rx65n_interrupt_bhalf));

      DEBUGVERIFY(work_queue(HPWORK, &g_usbhost.rx65n_interrupt_bhalf,
      rx65n_usbhost_bottomhalf,
      (void *)USB_PROCESS_ATTACHED_INT, 0));
    }

  /* Check for detach condition... */

  else if ((((intsts1 & intenb1) & RX65N_USB_INTSTS1_DTCH)) ==
    RX65N_USB_INTSTS1_DTCH)
    {
      hw_usb_hclear_sts_dtch();

      usb_hstd_bus_int_disable();
      DEBUGASSERT(work_available(&g_usbhost.rx65n_interrupt_bhalf));

