apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
      DEBUGVERIFY(work_queue(HPWORK, &g_usbhost.rx65n_interrupt_bhalf,
      rx65n_usbhost_bottomhalf,
      (void *)USB_PROCESS_DETACHED_INT, 0));
    }

  /* Check for BCHG interrupt... Not using it though */

  else if ((((intsts1 & intenb1) & RX65N_USB_INTSTS1_BCHG)) ==
     RX65N_USB_INTSTS1_BCHG)
    {
      hw_usb_hclear_sts_bchg();
      hw_usb_hclear_enb_bchge();
    }

  /* Check for BRDY interrupt... */

  else if ((((intsts0 & intenb0) & RX65N_USB_INTSTS0_BRDY)) ==
    RX65N_USB_INTSTS0_BRDY)
    {
      /* Schedule the workque for processing */

      DEBUGASSERT(work_available(&g_usbhost.rx65n_interrupt_bhalf));

      DEBUGVERIFY(work_queue(HPWORK, &g_usbhost.rx65n_interrupt_bhalf,
      rx65n_usbhost_bottomhalf,
      (void *)USB_PROCESS_BRDY_INT, 0));
    }

  /* Check for BEMP interrupt... */

  else if ((((intsts0 & intenb0) & RX65N_USB_INTSTS0_BEMP)) ==
    RX65N_USB_INTSTS0_BEMP)
    {
      /* Schedule the workque for processing */

      DEBUGASSERT(work_available(&g_usbhost.rx65n_interrupt_bhalf));

      DEBUGVERIFY(work_queue(HPWORK, &g_usbhost.rx65n_interrupt_bhalf,
      rx65n_usbhost_bottomhalf,
      (void *)USB_PROCESS_BEMP_INT, 0));
    }

  /* Check for NRDY interrupt... */

  else if ((((intsts0 & intenb0) & RX65N_USB_INTSTS0_NRDY)) ==
     RX65N_USB_INTSTS0_NRDY)
    {
      /* Schedule the workque for processing */

      DEBUGASSERT(work_available(&g_usbhost.rx65n_interrupt_bhalf));

      DEBUGVERIFY(work_queue(HPWORK, &g_usbhost.rx65n_interrupt_bhalf,
      rx65n_usbhost_bottomhalf,
      (void *)USB_PROCESS_NRDY_INT, 0));
    }

  /* Check for SOF interrupt... Not using though */

  else if ((((intsts0 & intenb0) & RX65N_USB_INTSTS0_SOFR)) ==
    RX65N_USB_INTSTS0_SOFR)
    {
       hw_usb_clear_sts_sofr();
    }

  /* Check for VBINT interrupt... Not using though */

  else if ((((intsts0 & intenb0) & RX65N_USB_INTSTS0_VBINT)) ==
    RX65N_USB_INTSTS0_VBINT)
    {
      rx65n_usbhost_clearbit(RX65N_USB_INTSTS0, RX65N_USB_INTSTS0_VBINT);
    }

  /* If none of the interrupt - what happens? */

  else
    {
      syslog(LOG_INFO, "Unhandled interrupt. INTENB0 = 0x%x, \
             INTENB1 = 0x%x, INTSTS0 = 0x%x and INTSTS1 = 0x%x\n",
             intenb0, intenb1, intsts0, intsts1);
    }

  return OK;
}

/****************************************************************************
 * Name: rx65n_usbhost_bottomhalf
 *
 * Description:
 * OHCI interrupt bottom half.  This function runs on the high priority
 * worker thread and was xcheduled when the last interrupt occurred.
 * Possibly this acts as host_thread functionality which is present in
 * FIT driver
 ****************************************************************************/

static void rx65n_usbhost_bottomhalf(void *arg)
{
  struct rx65n_usbhost_s *priv = &g_usbhost;
  uint32_t bottom_half_processing = (uint32_t)arg;
  uint16_t device_speed;

  /* connected_times variable is used to check the number of times */

  /* connected  and disconnected */

  static uint32_t connected_times = 0;

  /* We need to have exclusive access to the OHCI data structures.
   * Waiting here is not a good thing to do on the worker thread, but there
   * is no real option (other than to reschedule and delay).
   */

  nxmutex_lock(&g_usbhost.lock);

  if (bottom_half_processing == USB_PROCESS_SACK_INT)
    {
      EDCTRL->xfrinfo->tdstatus = TD_CC_NOERROR;
      hw_usb_hclear_sts_sack();
      nxsem_post(&EDCTRL->wdhsem);
    }

  else if (bottom_half_processing == USB_PROCESS_SIGN_INT)
    {
      EDCTRL->xfrinfo->tdstatus = TD_CC_PIDCHECKFAILURE;
      hw_usb_hclear_sts_sign();
      nxsem_post(&EDCTRL->wdhsem);
    }

  else if (bottom_half_processing == USB_PROCESS_ATTACHED_INT)
    {
      g_attached = true;
      device_speed = usb_hstd_attach_process();
      if (!priv->connected)
        {
          /* Yes.. connected. */

          connected_times++;
          syslog(LOG_INFO, "NuttX: USB Device Connected. %d\n",
                 connected_times);
          priv->connected = true;
          priv->change    = true;

          /* Update the speed of the connected device */

          if (device_speed == USB_ATTACHL)
            {
              g_usbhost.rhport.hport.speed = USB_SPEED_LOW;
            }
          else
            {
              g_usbhost.rhport.hport.speed = USB_SPEED_FULL;
            }

          /* Notify any waiters */

          if (priv->pscwait)
            {
              priv->pscwait = false;
              nxsem_post(&priv->pscsem);
            }
        }
      else
        {
          syslog(LOG_INFO, "WARNING: Spurious status change (connected)\n");
        }

      g_attached = false;
    }

  else if (bottom_half_processing == USB_PROCESS_DETACHED_INT)
    {
      g_detached = true;
      device_speed = usb_hstd_detach_process();

      if (priv->connected)
        {
          /* Yes.. disconnect the device */

          syslog(LOG_INFO, "NuttX: USB Device Disconnected. %d\n",
                 connected_times);
          priv->connected = false;
          priv->change    = true;

          /* As detach calls several free functions, make sure access to */

          /* hardware is available */

          nxmutex_unlock(&g_usbhost.lock);

          /* Are we bound to a class instance? */

          if (g_kbdpipe)
            {
              nxsem_post(&g_rx65n_edlist[g_kbdpipe].wdhsem);
            }

          g_kbdpipe = 0;
          if (priv->rhport.hport.devclass)
            {
              /* Yes.. Disconnect the class */

              CLASS_DISCONNECTED(priv->rhport.hport.devclass);
              priv->rhport.hport.devclass = NULL;
            }

          /* Notify any waiters for the Root Hub Status change event */

          if (priv->pscwait)
            {
              nxsem_post(&priv->pscsem);
              priv->pscwait = false;
            }

          return;
        }
      else
        {
           syslog(LOG_INFO, "WARNING: Spurious status change \
                  (disconnected)\n");
        }

      g_detached = false;
    }

