apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  /* We must have exclusive access to EP0 and the control list */

  nxmutex_lock(&priv->lock);
  usb_cstd_set_nak(USB_PIPE0);

  /* Make sure, all the DEVADDn registers are set to default state */

  /* if (funcaddr == 0) */

  hw_usb_hset_usbspd(funcaddr, (speed << 6));

  /* else
   * hw_usb_hset_usbspd (funcaddr, (1 << 6));
   * debug_ptr = RX65N_USB_DEVADD0+funcaddr;
   */

  current_dcpmaxp = hw_usb_read_dcpmaxp();
  current_dcpmaxp = current_dcpmaxp & (~RX65N_USB_DCPMAXP_MXPS_MASK);
  current_dcpmaxp |= maxpacketsize;
  current_dcpmaxp = current_dcpmaxp & (~RX65N_USB_DCPMAXP_DEVADDR_MASK);
  current_dcpmaxp |= funcaddr <<  RX65N_USB_DCPMAXP_DEVADDR_SHIFT;
  hw_usb_write_dcpmxps(current_dcpmaxp);

  hw_usb_set_curpipe(USB_CUSE, USB_PIPE0);
  hw_usb_set_bclr(USB_CUSE);

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: rx65n_usbhost_epalloc
 *
 * Description:
 *   Allocate and configure one endpoint.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   epdesc - Describes the endpoint to be allocated.
 *   ep - A memory location provided by the caller in which to receive the
 *      allocated endpoint descriptor.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno
 *   value is returned indicating the nature of the failure
 *
 * Assumptions:
 *   This function will *not* be called from an interrupt handler.
 *
 ****************************************************************************/

static int rx65n_usbhost_epalloc(struct usbhost_driver_s *drvr,
                                 const struct usbhost_epdesc_s *epdesc,
                                 usbhost_ep_t *ep)
{
  struct rx65n_usbhost_s *priv = (struct rx65n_usbhost_s *)drvr;
  struct usbhost_hubport_s *hport;
  struct rx65n_usbhost_ed_s *ed;
  int ret  = -ENOMEM;
  uint8_t pipe_num;
  uint8_t pipe_type;
  uint8_t pipe_dir;

  /* Sanity check.  NOTE that this method should only be called if a
   * device is connected (because we need a valid low speed indication).
   */

  DEBUGASSERT(priv && epdesc && ep && priv->connected);

  /* We must have exclusive access to the ED pool, the bulk list, the
   * periodic list and the interrupt table.
   */

  nxmutex_lock(&priv->lock);

  /* Take the ED descriptor from the list of ED Array - based on pipe num
   * Also note it down as part of ED structurie itself
   * for futere use - if needed.
   * Take the next ED from the beginning of the free list
   */

  /* DEBUGASSERT(pipe_no == USB_NULL); */

  if (epdesc->in)
    {
       pipe_dir = USB_EP_IN;
    }
  else
    {
      pipe_dir = USB_EP_OUT;
    }

  if ((epdesc->xfrtype) == USB_EP_ATTR_XFER_CONTROL)
    {
      pipe_type = USB_EP_CTRL;
    }
  else if ((epdesc->xfrtype) == USB_EP_ATTR_XFER_BULK)
    {
      pipe_type = USB_EP_BULK;
    }
  else if ((epdesc->xfrtype) == USB_EP_ATTR_XFER_INT)
    {
      pipe_type = USB_EP_INT;
    }
  else
    {
      pipe_type = USB_EP_ISO;
    }

  pipe_num = usb_hstd_get_pipe_no(pipe_type, pipe_dir);
  DEBUGASSERT(pipe_no == USB_NULL);
  g_usb_pipe_table[pipe_num].use_flag = USB_TRUE;

  ed =  &g_rx65n_edlist[pipe_num];
  if (ed)
    {
      /* Remove the ED from the freelist */

      /* Configure the endpoint descriptor. */

      memset((void *)ed, 0, sizeof(struct rx65n_usbhost_ed_s));

      hport = epdesc->hport;
      ed->hw.ctrl = (uint32_t)(hport->funcaddr) << ED_CONTROL_FA_SHIFT |
                    (uint32_t)(epdesc->addr)    << ED_CONTROL_EN_SHIFT |
                    (uint32_t)(epdesc->mxpacketsize) << ED_CONTROL_MPS_SHIFT;

      /* Note down the pipe number for reference */

      ed->pipenum = pipe_num;

      /* Get the direction of the endpoint.  For control endpoints, the
       * direction is in the TD.
       */

      if (epdesc->xfrtype == USB_EP_ATTR_XFER_CONTROL)
        {
          ed->hw.ctrl |= ED_CONTROL_D_TD1;
        }
      else if (epdesc->in)
        {
          ed->hw.ctrl |= ED_CONTROL_D_IN;
        }
      else
        {
          ed->hw.ctrl |= ED_CONTROL_D_OUT;
        }

      /* Check for a low-speed device */

      if (hport->speed == USB_SPEED_LOW)
        {
          ed->hw.ctrl |= ED_CONTROL_S;
        }

      /* Set the transfer type */

      ed->xfrtype = epdesc->xfrtype;

      /* Special Case isochronous transfer types */

      uinfo("EP%d CTRL:%08x\n", epdesc->addr, ed->hw.ctrl);
      nxsem_init(&ed->wdhsem, 0, 0);

      /* Link the common tail TD to the ED's TD list */

      ed->hw.headp = (uint32_t)TDTAIL;
      ed->hw.tailp = (uint32_t)TDTAIL;

      /* Now add the endpoint descriptor to the appropriate list */

      switch (ed->xfrtype)
        {
        case USB_EP_ATTR_XFER_CONTROL:
        ret = rx65n_usbhost_addctrled(priv, ed);
        break;

        case USB_EP_ATTR_XFER_BULK:
        ret = rx65n_usbhost_addbulked(priv, epdesc, ed);
        break;

        case USB_EP_ATTR_XFER_INT:
        ret = rx65n_usbhost_addinted(priv, epdesc, ed);
        break;

        case USB_EP_ATTR_XFER_ISOC:
        ret = rx65n_usbhost_addisoced(priv, epdesc, ed);
        break;

        default:
        ret = -EINVAL;
        break;
        }

      /* Was the ED successfully added? */

      if (ret < 0)
        {
          /* No.. destroy it and report the error */

          uerr("ERROR: Failed to queue ED for transfer type: %d\n",
            ed->xfrtype);
          nxsem_destroy(&ed->wdhsem);
          rx65n_usbhost_edfree(ed);
        }
      else
        {
          /* Yes.. return an opaque reference to the ED */

          *ep = (usbhost_ep_t)ed;
        }
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: rx65n_usbhost_epfree
 *
 * Description:
 *   Free and endpoint previously allocated by DRVR_EPALLOC.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   ep - The endpoint to be freed.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno
 *   value is returned indicating the nature of the failure
 *
 * Assumptions:
 *   This function will *not* be called from an interrupt handler.
 *
 ****************************************************************************/

