apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
static int rx65n_usbhost_epfree(struct usbhost_driver_s *drvr,
                                usbhost_ep_t ep)
{
  struct rx65n_usbhost_s *priv = (struct rx65n_usbhost_s *)drvr;
  struct rx65n_usbhost_ed_s *ed   = (struct rx65n_usbhost_ed_s *)ep;
  int ret;

  /* There should not be any pending, real TDs linked to this ED */

  DEBUGASSERT(ed && (ed->hw.headp & ED_HEADP_ADDR_MASK) == TDTAIL_ADDR);

  /* We must have exclusive access to the ED pool, the bulk list,
   * the periodic list and the interrupt table.
   */

  nxmutex_lock(&priv->lock);

  /* Remove the ED to the correct list depending on the transfer type */

  switch (ed->xfrtype)
    {
    case USB_EP_ATTR_XFER_CONTROL:
    ret = rx65n_usbhost_remctrled(priv, ed);
    break;

    case USB_EP_ATTR_XFER_BULK:
    ret = rx65n_usbhost_rembulked(priv, ed);
    break;

    case USB_EP_ATTR_XFER_INT:
    ret = rx65n_usbhost_reminted(priv, ed);
    break;

    case USB_EP_ATTR_XFER_ISOC:
    ret = rx65n_usbhost_remisoced(priv, ed);
    break;

    default:
    ret = -EINVAL;
    break;
    }

  /* Put the ED back into the free list */

  rx65n_usbhost_edfree(ed);
  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: rx65n_usbhost_alloc
 *
 * Description:
 *   Some hardware supports special memory in which request and descriptor
 *   data can be accessed more efficiently.  This method provides a mechanism
 *   to allocate the request/descriptor memory.  If the underlying hardware
 *   does not support such "special" memory, this functions may
 *   simply map to kmm_malloc.
 *
 *   This interface was optimized under a particular assumption.  It was
 *   assumed that the driver maintains a pool of small, pre-allocated buffers
 *   for descriptor traffic.  NOTE that size is not an input, but an output:
 *   The size of the pre-allocated buffer is returned.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   buffer - The address of a memory location provided by the caller in
 *     which to return the allocated buffer memory address.
 *   maxlen - The address of a memory location provided by the caller in
 *     which to return the maximum size of the allocated buffer memory.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno value i
 *   returned indicating the nature of the failure
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

static int rx65n_usbhost_alloc(struct usbhost_driver_s *drvr,
                               uint8_t **buffer, size_t *maxlen)
{
  struct rx65n_usbhost_s *priv = (struct rx65n_usbhost_s *)drvr;

  DEBUGASSERT(priv && buffer && maxlen);
  int ret = -ENOMEM;

  /* We must have exclusive access to the transfer buffer pool */

  nxmutex_lock(&priv->lock);

  *buffer = rx65n_usbhost_tballoc();
  if (*buffer)
    {
      *maxlen = CONFIG_RX65N_USBHOST_TDBUFSIZE;
      ret = OK;
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: rx65n_usbhost_free
 *
 * Description:
 *   Some hardware supports special memory in which request and descriptor
 *   data can be accessed more efficiently.  This method provides a
 *   mechanism to free that request/descriptor memory.  If the underlying
 *   hardware does not support such "special" memory, this functions may
 *   simply map to kmm_free().
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   buffer - The address of the allocated buffer memory to be freed.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno
 *   value is returned indicating the nature of the failure
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

static int rx65n_usbhost_free(struct usbhost_driver_s *drvr, uint8_t *buffer)
{
  struct rx65n_usbhost_s *priv = (struct rx65n_usbhost_s *)drvr;
  DEBUGASSERT(buffer);

  /* We must have exclusive access to the transfer buffer pool */

  nxmutex_lock(&priv->lock);
  rx65n_usbhost_tbfree(buffer);
  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: rx65n_usbhost_ioalloc
 *
 * Description:
 *   Some hardware supports special memory in which larger IO buffers can
 *   be accessed more efficiently.  This method provides a mechanism to
 *   allocate the request/descriptor memory.  If the underlying hardware
 *   does not support such "special" memory, this functions may simply map
 *   to kmm_malloc.
 *
 *   This interface differs from DRVR_ALLOC in that the buffers are
 *                      variable-sized.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   buffer - The address of a memory location provided by the caller in
 *     which to return the allocated buffer memory address.
 *   buflen - The size of the buffer required.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno
 *   returned indicating the nature of the failure
 *   value is
 *
 * Assumptions:
 *   This function will *not* be called from an interrupt handler.
 *
 ****************************************************************************/

static int rx65n_usbhost_ioalloc(struct usbhost_driver_s *drvr,
                                 uint8_t **buffer, size_t buflen)
{
  uint8_t *alloc;

  DEBUGASSERT(drvr && buffer && buflen > 0);

  /* There is no special memory requirement */

  alloc = kmm_malloc(buflen);
  if (!alloc)
    {
      return -ENOMEM;
    }

  /* Return the allocated buffer */

