apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  *buffer = alloc;
  return OK;
}

/****************************************************************************
 * Name: rx65n_usbhost_iofree
 *
 * Description:
 *   Some hardware supports special memory in which IO data can  be
 *   accessed more efficiently.  This method provides a mechanism to free
 *   that IO buffer memory. If the underlying hardware does not support
 *   such "special" memory,  this functions may simply map to kmm_free().
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   buffer - The address of the allocated buffer memory to be freed.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno value
 *    is returned indicating the nature of the failure
 *
 * Assumptions:
 *   This function will *not* be called from an interrupt handler.
 *
 ****************************************************************************/

static int rx65n_usbhost_iofree(struct usbhost_driver_s *drvr,
                                uint8_t *buffer)
{
  DEBUGASSERT(drvr && buffer);

#if RX65N_USBHOST_IOBUFFERS > 0
  rx65n_usbhhost_freeio(buffer);
  return OK;
#else
  return -ENOSYS;
#endif
}

/****************************************************************************
 * Name: rx65n_usbhost_ctrlin and rx65n_usbhost_ctrlout
 *
 * Description:
 * Description:
 *   Process a IN or OUT request on the control endpoint.  These methods
 *   will enqueue the request and wait for it to complete.  Only one
 *   transfer may be queued; Neither these methods nor the transfer() method
 *   can be called again until the control transfer functions returns.
 *
 *   These are blocking methods; these functions will not return until the
 *   control transfer has completed.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   ep0 - The control endpoint to send/receive the control request.
 *   req - Describes the request to be sent.  This request must lie in
 *      memory created by DRVR_ALLOC.
 *   buffer - A buffer used for sending the request and for returning any
 *     responses.  This buffer must be large enough to hold the length value
 *     in the request description. buffer must have been allocated using
 *      DRVR_ALLOC.
 *
 *   NOTE: On an IN transaction, req and buffer may refer to the same
 *   allocated memory.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated
 *   errno value is returned indicating the nature of the failure
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

static int rx65n_usbhost_ctrlin(struct usbhost_driver_s *drvr,
                                usbhost_ep_t ep0,
                                const struct usb_ctrlreq_s *req,
                                uint8_t *buffer)
{
  struct rx65n_usbhost_s *priv = (struct rx65n_usbhost_s *)drvr;
  struct rx65n_usbhost_ed_s *ed = (struct rx65n_usbhost_ed_s *)ep0;
  uint16_t len;
  int ret;
  uint8_t req_type;
  uint8_t req_req;

  uint8_t *local_buf;
  local_buf = buffer;

  DEBUGASSERT(priv != NULL && ed != NULL && req != NULL);

  uinfo("type:%02x req:%02x value:%02x%02x index:%02x%02x len:%02x%02x\n",
        req->type, req->req, req->value[1], req->value[0],
        req->index[1], req->index[0], req->len[1], req->len[0]);

  /* We must have exclusive access to EP0 and the control list */

  len = rx65n_usbhost_getle16(req->len);
  req_type = req->type;
  req_req = req->req;

  if (req_type == (USB_REQ_DIR_IN | USB_REQ_TYPE_CLASS |
    USB_REQ_RECIPIENT_INTERFACE) &&
    (req_req == USBHID_REQUEST_GETREPORT))
    {
      /* No need to check for this class request */
    }
  else
    {
      ed->xfrinfo->tdxfercond = USB_SETUPRD;
      ret = rx65n_usbhost_ctrltd(priv, ed, GTD_STATUS_DP_SETUP,
      (uint8_t *)req, USB_SIZEOF_CTRLREQ);

      if (ret == OK)
        {
          if (len)
            {
              ed->xfrinfo->tdxfercond = USB_DATARD;
              ret = rx65n_usbhost_ctrltd(priv, ed, GTD_STATUS_DP_IN,
              buffer, len);
              g_usbidx = USB0.USBINDX;
            }

      if (ret == OK)
        {
          ed->xfrinfo->tdxfercond = USB_STATUSWR;
          ret = rx65n_usbhost_ctrltd(priv, ed,
                GTD_STATUS_DP_OUT, NULL, 0);
        }
    }
    }

  /* If this is Get Report request */

  if (req_type == (USB_REQ_DIR_IN | USB_REQ_TYPE_CLASS |
                USB_REQ_RECIPIENT_INTERFACE) &&
                (req_req == USBHID_REQUEST_GETREPORT))
    {
      nxsem_wait_uninterruptible(
        &g_rx65n_edlist[kbd_interrupt_in_pipe].wdhsem);

          *(local_buf + 0) = kbd_report_data [0];
          *(local_buf + 1) = kbd_report_data [1];
          *(local_buf + 2) = kbd_report_data [2];
          *(local_buf + 3) = kbd_report_data [3];
          *(local_buf + 4) = kbd_report_data [4];
          *(local_buf + 5) = kbd_report_data [5];
          *(local_buf + 6) = kbd_report_data [6];
          *(local_buf + 7) = kbd_report_data [7];
          ret = OK;

          /* Reset the transferred count so that for the next interrupt */

          /* for read does the calculation correctly */

          g_rx65n_edlist[kbd_interrupt_in_pipe].xfrinfo->xfrd = 0;
          usb_cstd_set_buf(kbd_interrupt_in_pipe); /* Set BUF */
    }

  return ret;
}

static int rx65n_usbhost_ctrlout(struct usbhost_driver_s *drvr,
  usbhost_ep_t ep0, const struct usb_ctrlreq_s *req,
                        const uint8_t *buffer)
{
  struct rx65n_usbhost_s *priv = (struct rx65n_usbhost_s *)drvr;
  struct rx65n_usbhost_ed_s *ed = (struct rx65n_usbhost_ed_s *)ep0;
  uint16_t len;
  int ret;
  static int dev_addressed_state = 0;

  /* Assumption : This control out is called first time for
   * set address command. Just resetting the bus after the
   * set address command
   */

  if (dev_addressed_state == 0)
    {
      /* Not sure, if the reset is needed or not - at least the FIT code
       * does not have reset...
       * so removing it...
       * usb_hstd_bus_reset();
       */

      dev_addressed_state = 0xff;
    }

  DEBUGASSERT(priv != NULL && ed != NULL && req != NULL);

  uinfo("type:%02x req:%02x value:%02x%02x index:%02x%02x len:%02x%02x\n",
  req->type, req->req, req->value[1], req->value[0],
  req->index[1], req->index[0], req->len[1], req->len[0]);

