apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  /* We must have exclusive access to EP0 and the control list */

  len = rx65n_usbhost_getle16(req->len);
  ed->xfrinfo->tdxfercond = USB_SETUPWR;
  ret = rx65n_usbhost_ctrltd(priv, ed, GTD_STATUS_DP_SETUP,
  (uint8_t *)req, USB_SIZEOF_CTRLREQ);

  if (ret == OK)
    {
      if (len)
        {
          ed->xfrinfo->tdxfercond = USB_DATAWR;
          ret = rx65n_usbhost_ctrltd(priv, ed, GTD_STATUS_DP_OUT,
          (uint8_t *)buffer, len);
        }

      if (ret == OK)
        {
          ed->xfrinfo->tdxfercond = USB_STATUSRD;
          ret = rx65n_usbhost_ctrltd(priv, ed, GTD_STATUS_DP_IN, NULL, 0);
        }
    }

  return ret;
}

/****************************************************************************
 * Name: rx65n_usbhost_transfer_common
 *
 * Description:
 *   Initiate a request to handle a transfer descriptor.  This method will
 *   enqueue the transfer request and return immediately
 *
 * Input Parameters:
 *   priv - Internal driver state structure.
 *   ed - The IN or OUT endpoint descriptor for the device endpoint on
 *      which to perform the transfer.
 *   buffer - A buffer containing the data to be sent (OUT endpoint) or
 *     received (IN endpoint). buffer must have been allocated using
 *     DRVR_ALLOC
 *   buflen - The length of the data to be sent or received.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno
 *   value is returned indicating the nature of the failure.
 *
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

static int rx65n_usbhost_transfer_common(struct rx65n_usbhost_s *priv,
                                         struct rx65n_usbhost_ed_s *ed,
                                         uint8_t *buffer, size_t buflen)
{
  struct rx65n_usbhost_xfrinfo_s *xfrinfo;
  uint32_t dirpid;
  bool in;
  int ret;

  xfrinfo = ed->xfrinfo;
  in      = (ed->hw.ctrl & ED_CONTROL_D_MASK) == ED_CONTROL_D_IN;

  uinfo("EP%u %s toggle:%u maxpacket:%u buflen:%lu\n",
        (ed->hw.ctrl  & ED_CONTROL_EN_MASK) >> ED_CONTROL_EN_SHIFT,
        in ? "IN" : "OUT",
        (ed->hw.headp & ED_HEADP_C) != 0 ? 1 : 0,
        (ed->hw.ctrl  & ED_CONTROL_MPS_MASK) >> ED_CONTROL_MPS_SHIFT,
        (unsigned long)buflen);

  /* Get the direction of the endpoint */

  if (in)
    {
      dirpid = GTD_STATUS_DP_IN;
    }
  else
    {
      dirpid = GTD_STATUS_DP_OUT;
    }

  /* Then enqueue the transfer */

  xfrinfo->tdstatus = TD_CC_NOERROR;

  ret = rx65n_usbhost_enqueuetd(priv, ed, dirpid, GTD_STATUS_T_TOGGLE,
    buffer, buflen);

  if (ed->pipenum == USB_PIPE6 && in == 1)
    {
      usb_hstd_receive_start(buffer, buflen, ed->pipenum);
    }

  if (ret == OK)
    {
      /* BulkListFilled. This bit is used to indicate whether there are any
       * TDs on the Bulk list.
       */

      if (ed->xfrtype == USB_EP_ATTR_XFER_BULK)
        {
          if (in)
            {
              usb_hstd_receive_start(buffer, buflen, ed->pipenum);
            }
          else
            {
              usb_hstd_send_start(buffer, buflen, ed->pipenum);
            }
        }
    }

  return ret;
}

/****************************************************************************
 * Name: rx65n_usbhost_dma_alloc
 *
 * Description:
 *   Allocate DMA memory to perform a transfer, copying user data as
 *   necessary
 * Input Parameters:
 *   priv - Internal driver state structure.
 *   ed - The IN or OUT endpoint descriptor for the device endpoint on which
 *      to perform the transfer.
 *   userbuffer - The user buffer containing the data to be sent (OUT
 *      endpoint) or received (IN endpoint).
 *   buflen - The length of the data to be sent or received.
 *   alloc - The location to return the allocated DMA buffer.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno value
 *   is returned indicating the nature of the failure.
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

#if RX65N_USBHOST_IOBUFFERS > 0
static int rx65n_usbhost_dma_alloc(struct rx65n_usbhost_s *priv,
                                   struct rx65n_usbhost_ed_s *ed,
                                   uint8_t *userbuffer, size_t buflen,
                                   uint8_t **alloc)
{
  syslog(LOG_INFO, "Debug : %s(): Line : %d\n", __func__, __LINE__);

  /* This need to be implemented if DMA is used */

  return OK;
}

/****************************************************************************
 * Name: rx65n_usbhost_dma_free
 *
 * Description:
 *   Free allocated DMA memory.
 *
 * Input Parameters:
 *   priv - Internal driver state structure.
 *   ed - The IN or OUT endpoint descriptor for the device endpoint
 *      on which to perform the transfer.
 *   userbuffer - The user buffer containing the data to be sent
 *      (OUT endpoint) or received (IN endpoint).
 *   buflen - The length of the data to be sent or received.
 *   alloc - The allocated DMA buffer to be freed.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno
 *   value is returned indicating the nature of the failure.
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

static void rx65n_usbhost_dma_free(struct rx65n_usbhost_s *priv,
                                   struct rx65n_usbhost_ed_s *ed,
                                   uint8_t *userbuffer, size_t buflen,
                                   uint8_t *newbuffer)
{
  syslog(LOG_INFO, "Debug : %s(): Line : %d\n", __func__, __LINE__);
}
#endif

/****************************************************************************
 * Name: rx65n_usbhost_transfer
 *
 * Description:
 *   Process a request to handle a transfer descriptor.  This method will
 *   enqueue the transfer request, blocking until the transfer completes.
 *   Only one transfer may be  queued; Neither this method nor the ctrlin or
 *   ctrlout methods can be called again until this function returns.
 *
 *   This is a blocking method; this functions will not return until the
 *   transfer has completed.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   ep - The IN or OUT endpoint descriptor for the device endpoint on
 *      which to perform the transfer.
 *   buffer - A buffer containing the data to be sent (OUT endpoint) or
 *     received (IN endpoint).  buffer must have been allocated using
 *     DRVR_ALLOC
 *   buflen - The length of the data to be sent or received.
 *
 * Returned Value:
 *   On success, a non-negative value is returned that indicates the number
 *   of bytes successfully transferred.  On a failure, a negated errno
 *   value is returned that indicates the nature of the failure:
 *
 *     EAGAIN - If devices NAKs the transfer (or NYET or other error where
 *              it may be appropriate to restart the entire transaction).
 *     EPERM  - If the endpoint stalls
 *     EIO    - On a TX or data toggle error
 *     EPIPE  - Overrun errors
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

