apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
static ssize_t rx65n_usbhost_transfer(struct usbhost_driver_s *drvr,
                                      usbhost_ep_t ep,
                                      uint8_t *buffer, size_t buflen)
{
  struct rx65n_usbhost_s *priv = (struct rx65n_usbhost_s *)drvr;
  struct rx65n_usbhost_ed_s *ed = (struct rx65n_usbhost_ed_s *)ep;
  struct rx65n_usbhost_xfrinfo_s *xfrinfo;
#if RX65N_USBHOST_IOBUFFERS > 0
  uint8_t *alloc = NULL;
  uint8_t *userbuffer = NULL;
#endif
  ssize_t nbytes;
  int ret;
  uint8_t transfer_retry_count = 0;

  DEBUGASSERT(priv && ed && buffer && buflen > 0);

  if (nrdy_retries[ed->pipenum] != 0)
    {
      /* nRdy has occurred already - just return with -ve value,
       * so that file close is also completes with this error
       *
       */

      return -EBUSY;
    }

  do
    {
      /* We must have exclusive access to the endpoint, the TD pool, the I/O
       * buffer pool, the bulk and interrupt lists, and the HCCA interrupt
       * table.
       *
       */

      nxmutex_lock(&priv->lock);

      /* Allocate a structure to retain the information needed when the
       * transfer completes.
       *
       */

      DEBUGASSERT(ed->xfrinfo == NULL);

      xfrinfo = rx65n_usbhost_alloc_xfrinfo();
      if (xfrinfo == NULL)
        {
          uerr("ERROR: rx65n_usbhost_alloc_xfrinfo failed\n");
          nbytes = -ENOMEM;
          nxmutex_unlock(&priv->lock);
          goto errout_with_lock;
        }

      /* Newly added condition */

      if (xfrinfo < 0)
        {
          uerr("ERROR: rx65n_usbhost_alloc_xfrinfo failed\n");
          nbytes = -ENOMEM;
          goto errout_with_xfrinfo;
        }

      /* Initialize the transfer structure */

      memset(xfrinfo, 0, sizeof(struct rx65n_usbhost_xfrinfo_s));
      xfrinfo->buffer = buffer;
      xfrinfo->buflen = buflen;

      /* To begin with transferred bytes = 0 */

      xfrinfo->xfrd = 0;

      ed->xfrinfo = xfrinfo;

#if RX65N_USBHOST_IOBUFFERS > 0
      /* Allocate an IO buffer if the user buffer does not lie in AHB SRAM */

      ret = rx65n_usbhost_dma_alloc(priv, ed, buffer, buflen, &alloc);
      if (ret < 0)
        {
          uerr("ERROR: rx65n_usbhost_dma_alloc failed: %d\n", ret);
          nbytes = (ssize_t)ret;
          goto errout_with_xfrinfo;
        }

      /* If a buffer was allocated, then use it instead of the
       * callers buffer
       *
       */

      if (alloc)
        {
          userbuffer = buffer;
          buffer  = alloc;
        }
#endif

      /* Set the request for the Writeback Done Head event well
       * BEFORE enabling
       * the transfer.
       */

      ret = rx65n_usbhost_wdhwait(priv, ed);
      if (ret < 0)
        {
          uerr("ERROR: Device disconnected\n");
          nbytes = (ssize_t)ret;
          goto errout_with_buffers;
        }

      /* Set up the transfer */

      ret = rx65n_usbhost_transfer_common(priv, ed, buffer, buflen);
      nxmutex_unlock(&priv->lock);
      if (ret < 0)
        {
          uerr("ERROR: rx65n_usbhost_transfer_common failed: %d\n", ret);
          nbytes = (ssize_t)ret;
          goto errout_with_wdhwait;
        }

      /* Wait for the Write-back Done Head interrupt */

      if (priv->connected)
        {
          nxsem_wait_uninterruptible(&ed->wdhsem);
        }

      /* Update the buffer pointer for next buffer operation */

      /* Check the TD completion status bits */

      if (xfrinfo->tdstatus == TD_CC_NOERROR)
        {
          /* Return the number of bytes successfully transferred */

          nbytes = xfrinfo->xfrd;
          DEBUGASSERT(nbytes >= 0 && nbytes <= buflen);
        }
  else
    {
      /* Map the bad completion status to something that a class driver
       * might understand.
       */

      uerr("ERROR: Bad TD completion status: %d\n", xfrinfo->tdstatus);

      switch (xfrinfo->tdstatus)
        {
        case TD_CC_STALL:
          nbytes = -EPERM;
          break;

        /* This case is newly added for NRDY issue */

        case TD_CC_DEVNOTRESPONDING:
          xfrinfo->wdhwait = false;
          transfer_retry_count++;
          nbytes = -EBUSY;
          break;

        case TD_CC_USER:
          nbytes = -ESHUTDOWN;
          break;

        default:
          nbytes = -EIO;
          break;
        }
     }

errout_with_wdhwait:

  /* Make sure that there is no outstanding request on this endpoint */

  xfrinfo->wdhwait = false;

errout_with_buffers:
#if RX65N_USBHOST_IOBUFFERS > 0

  /* Free any temporary IO buffers */

  rx65n_usbhost_dma_free(priv, ed, userbuffer, buflen, alloc);
#endif

errout_with_xfrinfo:

  /* Make sure that there is no outstanding request on this endpoint */

  rx65n_usbhost_free_xfrinfo(xfrinfo);
  ed->xfrinfo = NULL;
  }
  while (0);

errout_with_lock:

  /* nxmutex_unlock(&priv->lock); */

  return nbytes;
}

/****************************************************************************
 * Name: rx65n_usbhost_asynch_completion
 *
 * Description:
 *   This function is called at the interrupt level when an asynchronous
 *   transfer completes.  It performs the pending callback.
 *
 * Input Parameters:
 *   priv - Internal driver state structure.
 *   ep - The IN or OUT endpoint descriptor for the device endpoint on which
 *      the transfer was performed.
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   - Called from the interrupt level
 *
 ****************************************************************************/

#ifdef CONFIG_USBHOST_ASYNCH
static void rx65n_usbhost_asynch_completion(struct rx65n_usbhost_s *priv,
                                            struct rx65n_usbhost_ed_s *ed)
{
  struct rx65n_usbhost_xfrinfo_s *xfrinfo;
  usbhost_asynch_t callback;
  void *arg;
  ssize_t nbytes;

  DEBUGASSERT(ed != NULL && ed->xfrinfo != NULL);
  xfrinfo = ed->xfrinfo;

  DEBUGASSERT(xfrinfo->wdhwait == false &&  xfrinfo->callback != NULL &&
              xfrinfo->buffer != NULL && xfrinfo->buflen > 0);

  /* Check the TD completion status bits */

