apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
#ifdef CONFIG_USBHOST_ASYNCH
      if (xfrinfo->callback || xfrinfo->wdhwait)
#else
      if (xfrinfo->wdhwait)
#endif
        {
          /* Control endpoints should not come through this path and
           * isochronous endpoints are not yet implemented.  So we only have
           * to distinguish bulk and interrupt endpoints.
           */

          if (g_rx65n_edlist[USB_PIPE6].xfrtype == USB_EP_ATTR_XFER_BULK)
            {
              g_rx65n_edlist[USB_PIPE6].hw.headp = (uint32_t)TDTAIL;
              g_rx65n_edlist[USB_PIPE6].xfrinfo  = NULL;
            }
          else
            {
              /* Remove the TDs attached to the ED, keeping the Ed in the
               * list.
               */

              g_rx65n_edlist[USB_PIPE6].hw.headp = (uint32_t)TDTAIL;
            }

          xfrinfo->tdstatus = TD_CC_USER;

          /* If there is a thread waiting for the transfer to complete, then
           * wake up the thread.
           */

          if (xfrinfo->wdhwait)
            {
#ifdef CONFIG_USBHOST_ASYNCH
              /* Yes.. there should not also be a callback scheduled */

              DEBUGASSERT(xfrinfo->callback == NULL);
#endif

              /* Wake up the waiting thread */

              nxsem_post(&g_rx65n_edlist[USB_PIPE6].wdhsem);

              /* And free the transfer structure */

              rx65n_usbhost_free_xfrinfo(xfrinfo);
              g_rx65n_edlist[USB_PIPE6].xfrinfo = NULL;
            }
#ifdef CONFIG_USBHOST_ASYNCH
          else
            {
              /* Otherwise, perform the callback and free the transfer
               * structure.
               */

              rx65n_usbhost_asynch_completion(priv,
              &g_rx65n_edlist[USB_PIPE6]);
              usb_cstd_clr_pipe_cnfg(USB_PIPE6);
              g_usb_pipe_table[USB_PIPE6].use_flag = USB_FALSE;
            }
#endif
        }
      else
        {
          /* Just free the transfer structure */

          rx65n_usbhost_free_xfrinfo(xfrinfo);
          g_rx65n_edlist[USB_PIPE6].xfrinfo = NULL;
        }
    }

  /* Determine the return value */

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: rx65n_usbhost_connect
 *
 * Description:
 *   New connections may be detected by an attached hub.  This method is the
 *   mechanism that is used by the hub class to introduce a new connection
 *   and port description to the system.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   hport - The descriptor of the hub port that detected the connection
 *      related event
 *   connected - True: device connected; false: device disconnected
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno
 *   value is returned indicating the nature of the failure.
 *
 ****************************************************************************/

#ifdef CONFIG_USBHOST_HUB
static int rx65n_usbhost_connect(struct usbhost_driver_s *drvr,
                                 struct usbhost_hubport_s *hport,
                                 bool connected)
{
  struct rx65n_usbhost_s *priv = (struct rx65n_usbhost_s *)drvr;
  DEBUGASSERT(priv != NULL && hport != NULL);

  int ret;

  /* Set the connected/disconnected flag */

  hport->connected = connected;
  uinfo("Hub port %d connected: %s\n", hport->port,
    connected ? "YES" : "NO");

  /* Report the connection event */

  priv->hport = hport;
  ret = usbhost_enumerate(hport, &hport->devclass);
  if (ret < 0)
    {
      syslog(LOG_INFO, "Enumeration failed with %d", ret);
    }

  hw_usb_write_dcpmxps(USB_DEFPACKET + USB_DEVICE_1);

  if (hport->speed == USB_SPEED_LOW)
    {
      switch (hport->port)
        {
          case HUB_PORT1:
          case HUB_PORT2:
          case HUB_PORT3:
          case HUB_PORT4:
          g_kbdport = hport->port;
          g_hubkbd = true;
          break;

          default:
          syslog(LOG_INFO, "Undefined Port");
          break;
        }
    }

  if (ret >= 0)
    {
      syslog(LOG_INFO, "Hub Port device enumerated\n");
    }

  return OK;
}
#endif

/****************************************************************************
 * Name: rx65n_usbhost_disconnect
 *
 * Description:
 *   Called by the class when an error occurs and driver has been
 *       disconnected. The USB host driver should discard the handle to the
 *   class instance (it is stale) and not attempt any further interaction
 *   with the class driver instance (until a new instance is received
 *   from the create() method).
 *   The driver should not called the class' disconnected() method.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   hport - The port from which the device is being disconnected.
 *      Might be a port on a hub.
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   - Only a single class bound to a single device is supported.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

static void rx65n_usbhost_disconnect(struct usbhost_driver_s *drvr,
                                     struct usbhost_hubport_s *hport)
{
  int i;
  struct rx65n_usbhost_s *priv = &g_usbhost;
  uint16_t pipe;

  struct rx65n_usbhost_xfrinfo_s *xfrinfo;
  uint8_t *buffer;
  DEBUGASSERT(hport != NULL);

  if (hport->port)
    {
      if (hport->speed == USB_SPEED_LOW)
        {
          g_usb_pipe_table[kbd_interrupt_in_pipe].use_flag = USB_FALSE;

          for (i = 0, xfrinfo = g_xfrbuffers;
               i < CONFIG_RX65N_USBHOST_NPREALLOC;
               i++, xfrinfo++)
            {
              /* Put the transfer structure in a free list */
#ifdef CONFIG_USBHOST_ASYNCH
              if (!(xfrinfo->callback))
#endif
                {
                  rx65n_usbhost_free_xfrinfo(xfrinfo);
                  g_rx65n_edlist[kbd_interrupt_in_pipe].xfrinfo = NULL;
                }
            }

          g_kbdpipe = 0;
          g_hubkbd = false;
          syslog(LOG_INFO, "KBD Device Disconnected from Hub\n");
        }

      if (hport->speed == USB_SPEED_FULL)
        {
          for (pipe = USB_BULK_PIPE_START ; pipe <= USB_BULK_PIPE_END;
               pipe++)
            {
              if (g_usb_pipe_table[pipe].use_flag == USB_TRUE)
                {
                  g_usb_pipe_table[pipe].use_flag = USB_FALSE;
                }
            }

          syslog(LOG_INFO, "MSC Device Disconnected from Hub\n");
        }
    }

  else if (!hport->port)
    {
      if (g_usbhost.rhport.hport.speed == USB_SPEED_LOW)
        {
          g_usb_pipe_table[kbd_interrupt_in_pipe].use_flag = USB_FALSE;
          for (i = 0, xfrinfo = g_xfrbuffers;
               i < CONFIG_RX65N_USBHOST_NPREALLOC;
               i++, xfrinfo++)
            {
              /* Put the transfer structure in a free list */

               rx65n_usbhost_free_xfrinfo(xfrinfo);
               g_rx65n_edlist[kbd_interrupt_in_pipe].xfrinfo = NULL;
            }
        }

      if (g_usbhost.rhport.hport.speed == USB_SPEED_FULL)
        {
          if (g_hubkbd)
            {
              /* If Keyboard device is connected, and the USB Hub disconnect
               * task is invoked, then make the Hub task sleep,
               * so that in this time the keyboard task completes
               * its disconnection event.
               *
               */

