apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
              nxsched_usleep(100000);
            }

          for (i = 0; i < CONFIG_RX65N_USBHOST_NEDS; i++)
            {
              /* Put the ED in a free list */

              rx65n_usbhost_edfree(&g_rx65n_edlist[i]);
            }

          /* Initialize user-configurable TDs */

          for (i = 0; i < CONFIG_RX65N_USBHOST_NTDS; i++)
            {
              /* Put the TD in a free list */

              rx65n_usbhost_tdfree(&g_rx65n_tdlist[i]);
            }

          /* Initialize user-configurable request/descriptor transfer
           * buffers
           */

          buffer = g_tdbuffer;

          for (i = 0; i < CONFIG_RX65N_USBHOST_TDBUFFERS; i++)
            {
              /* Put the TD buffer in a free list */

              rx65n_usbhost_tbfree(buffer);
              buffer += CONFIG_RX65N_USBHOST_TDBUFSIZE;
            }

          /* Initialize transfer structures */

          for (i = 0, xfrinfo = g_xfrbuffers;
               i < CONFIG_RX65N_USBHOST_NPREALLOC;
               i++, xfrinfo++)
            {
              /* Put the transfer structure in a free list */

              rx65n_usbhost_free_xfrinfo(xfrinfo);
            }

          /* Wait 50MS then perform hardware reset */

          up_mdelay(50);

          /* Set up the root hub port EP0 */

          rx65n_usbhost_ep0init(priv);

          /* To begin with make all pipes are available */

          for (i = USB_MIN_PIPE_NUM; i < (USB_MAX_PIPE_NUM +1); i++)
            {
              g_usb_pipe_table[i].use_flag = USB_FALSE;
            }
        }
    }

  hport->devclass = NULL;
}

/****************************************************************************
 * Initialization
 ****************************************************************************/

/****************************************************************************
 * Name: rx65n_usbhost_ep0init
 *
 * Description:
 *   Initialize ED for EP0, add it to the control ED list, and enable
 *   control transfers.
 *
 * Input Parameters:
 *   priv - private driver state instance.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void rx65n_usbhost_ep0init(struct rx65n_usbhost_s *priv)
{
  /* Initialize the common tail TD. */

  memset(TDTAIL, 0, sizeof(struct rx65n_usbhost_gtd_s));
  TDTAIL->ed = EDCTRL;

  /* Link the common tail TD to the ED's TD list */

  memset(EDCTRL, 0, sizeof(struct rx65n_usbhost_ed_s));
  EDCTRL->hw.headp = (uint32_t)TDTAIL;
  EDCTRL->hw.tailp = (uint32_t)TDTAIL;
  EDCTRL->xfrtype  = USB_EP_ATTR_XFER_CONTROL;

  /* Set the head of the control list to the NULL (for now). */

  /* Then add EP0 to the empty Control List */

  rx65n_usbhost_addctrled(priv, EDCTRL);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rx65n_usbhost_initialize
 *
 * Description:
 *   Initialize USB host device controller hardware.
 *
 * Input Parameters:
 *   controller -- If the device supports more than USB host controller, then
 *     this identifies which controller is being initialized.  Normally, this
 *     is just zero.
 *
 * Returned Value:
 *   And instance of the USB host interface.  The controlling task should
 *   use this interface to (1) call the wait() method to wait for a device
 *   to be connected, and (2) call the enumerate() method to bind the
 *   device to a class driver.
 *
 * Assumptions:
 * - This function should called in the initialization sequence in order
 *   to initialize the USB device functionality.
 * - Class drivers should be initialized prior to calling this function.
 *   Otherwise, there is a race condition if the device is already .
 *   connected
 ****************************************************************************/

struct usbhost_connection_s *rx65n_usbhost_initialize(int controller)
{
  struct rx65n_usbhost_s *priv = &g_usbhost;
  struct usbhost_driver_s *drvr;
  struct usbhost_hubport_s *hport;
  struct rx65n_usbhost_xfrinfo_s *xfrinfo;
  uint32_t reg32;
  uint8_t *buffer;
  irqstate_t flags;
  int i;

  DEBUGASSERT(controller == 0);
  DEBUGASSERT(sizeof(struct rx65n_ed_s)  <= RX65N_ED_SIZE);
  DEBUGASSERT(sizeof(struct rx65n_usbhost_gtd_s) <= RX65N_TD_SIZE);

  /* Initialize all the TDs, EDs (including EDCTRL i.e.
   * Control Endpoint) and HCCA to 0
   */

  /* Set HCCA base address */

  HCCA = &g_hcca;

  /* Set TD TAIL address */

  TDTAIL = &g_rx65n_tdlist[0];

  /* Set ED Tail address as well... */

  /* EDCTRL = &g_rx65n_ep0ed; */

  /* Set first element as CTRL pipe - as there is always
   * only one CTRL pipe
   */

  EDCTRL = &g_rx65n_edlist[0];

  memset((void *)TDTAIL, 0,
                ((sizeof(struct ohci_gtd_s)) * (CONFIG_RX65N_USBHOST_NTDS)));
  memset((void *)(&g_rx65n_edlist[0]), 0,
                ((sizeof(struct rx65n_usbhost_ed_s)) *
                (CONFIG_RX65N_USBHOST_NEDS)));
  memset((void *)EDCTRL, 0, sizeof(struct rx65n_usbhost_ed_s));
  memset((void *)HCCA,   0, sizeof(struct ohci_hcca_s));

  /* Initialize the state data structure */

  /* Initialize the device operations */

  drvr                 = &priv->drvr;
  drvr->ep0configure   = rx65n_usbhost_ep0configure;
  drvr->epalloc        = rx65n_usbhost_epalloc;
  drvr->epfree         = rx65n_usbhost_epfree;
  drvr->alloc          = rx65n_usbhost_alloc;
  drvr->free           = rx65n_usbhost_free;
  drvr->ioalloc        = rx65n_usbhost_ioalloc;
  drvr->iofree         = rx65n_usbhost_iofree;
  drvr->ctrlin         = rx65n_usbhost_ctrlin;
  drvr->ctrlout        = rx65n_usbhost_ctrlout;
  drvr->transfer       = rx65n_usbhost_transfer;
#ifdef CONFIG_USBHOST_ASYNCH
  drvr->asynch         = rx65n_usbhost_asynch;
#endif
  drvr->cancel         = rx65n_usbhost_cancel;
#ifdef CONFIG_USBHOST_HUB
  drvr->connect        = rx65n_usbhost_connect;
#endif
  drvr->disconnect     = rx65n_usbhost_disconnect;

