apache/nuttx/arch/renesas/src/rx65n/rx65n_usbhost.c
  /* Initialize the public port representation */

  hport                = &priv->rhport.hport;
  hport->drvr          = drvr;
#ifdef CONFIG_USBHOST_HUB
  hport->parent        = NULL;
#endif
  hport->ep0           = EDCTRL;
  hport->speed         = USB_SPEED_FULL;
  hport->funcaddr      = 0;

  /* Initialize function address generation logic */

  usbhost_devaddr_initialize(&priv->devgen);
  priv->rhport.pdevgen = &priv->devgen;

#ifndef CONFIG_USBHOST_INT_DISABLE
  priv->ininterval  = MAX_PERINTERVAL;
  priv->outinterval = MAX_PERINTERVAL;
#endif

  /* Enable write to System registers */

  putreg16(RX65N_PRCR_VALUE, RX65N_PRCR_ADDR);

  /* Start CMT module */

  reg32 = getreg32(RX65N_MSTPCRB_ADDR);

  /* Clear bit 19 - so that USB module is released from stop state */

  reg32 &= (~RX65N_MSTPCRB_START_STOP_USB);
  putreg32(reg32, RX65N_MSTPCRB_ADDR);

  reg32 = getreg32(RX65N_MSTPCRB_ADDR);

  /* Enable power by setting PCUSB in the PCONP register.
   * Disable interrupts because this register may be shared with other
   * drivers.
   */

  flags = enter_critical_section();
  putreg32(0, RX65N_USB_DPUSR0R); /* FIT code writes 0 to this DPUSR0R */

  hw_usb_hmodule_init();
  rx65n_usbhost_setbit(RX65N_USB_SOFCFG, RX65N_USB_SOFCFG_TRNENSEL);

  hw_usb_set_vbout();
  up_mdelay(100);

  leave_critical_section(flags);
  nxsem_init(&EDCTRL->wdhsem, 0, 0);

  /* Initialize user-configurable EDs */

  for (i = 0; i < CONFIG_RX65N_USBHOST_NEDS; i++)
    {
      /* Put the ED in a free list */

      rx65n_usbhost_edfree(&g_rx65n_edlist[i]);
    }

  /* Initialize user-configurable TDs */

  for (i = 0; i < CONFIG_RX65N_USBHOST_NTDS; i++)
    {
      /* Put the TD in a free list */

      rx65n_usbhost_tdfree(&g_rx65n_tdlist[i]);
    }

  /* Initialize user-configurable request/descriptor transfer
   * buffers
   */

  buffer = g_tdbuffer;

  for (i = 0; i < CONFIG_RX65N_USBHOST_TDBUFFERS; i++)
    {
      /* Put the TD buffer in a free list */

      rx65n_usbhost_tbfree(buffer);
      buffer += CONFIG_RX65N_USBHOST_TDBUFSIZE;
    }

#if RX65N_USBHOST_IOBUFFERS > 0
  /* Initialize user-configurable IO buffers */

  buffer = (uint8_t *)RX65N_USBHOST_IOFREE_BASE;
  for (i = 0; i < RX65N_USBHOST_IOBUFFERS; i++)
    {
      /* Put the IO buffer in a free list */

      rx65n_usbhhost_freeio(buffer);
      buffer += CONFIG_RX65N_USBHOST_IOBUFSIZE;
    }
#endif

  /* Initialize transfer structures */

  for (i = 0, xfrinfo = g_xfrbuffers;
       i < CONFIG_RX65N_USBHOST_NPREALLOC;
       i++, xfrinfo++)
    {
      /* Put the transfer structure in a free list */

      rx65n_usbhost_free_xfrinfo(xfrinfo);
    }

  /* Wait 50MS then perform hardware reset */

  up_mdelay(50);

  /* Set up the root hub port EP0 */

  rx65n_usbhost_ep0init(priv);

  /* To begin with make all pipes are available */

  for (i = USB_MIN_PIPE_NUM; i < (USB_MAX_PIPE_NUM +1); i++)
    {
       g_usb_pipe_table[i].use_flag = USB_FALSE;
    }

  /* Attach USB host controller interrupt handler */

  ICU.SLIBR185.BYTE = 0x3eu;
  IPR(PERIB, INTB185) = _0F_CMTW_PRIORITY_LEVEL15;

  if (irq_attach(RX65N_INTB185_IRQ, rx65n_usbhost_usbinterrupt,
  NULL) != 0)
    {
      syslog(LOG_INFO, "ERROR: Failed to attach IRQ\n");
      return NULL;
    }

  IEN(PERIB, INTB185) = 1U;

  syslog(LOG_INFO, "Debug:USB host Initialized, Device connected:%s\n",
         priv->connected ? "YES" : "NO");

  return &g_usbconn;
}
